[
    {
        "id": 3263,
        "title": "Honey Ginger Grilled Salmon",
        "ingredients": [
            "ground ginger",
            "garlic powder",
            "reduced sodium soy sauce",
            "honey",
            "green onion",
            "salmon fillets"
        ],
        "direction": [
            "In a large self-closing plastic bag, combine first six ingredients; mix well.",
            "Place salmon in bag and seal tightly.",
            "Turn bag gently to distribute marinade.",
            "Refrigerate 15 minutes or up to 30 minutes for stronger flavor.",
            "Turn bag occasionally.",
            "Lightly grease grill rack.",
            "Preheat grill to medium heat.",
            "Remove salmon from marinade; reserve the marinade.",
            "Grill 12-15 minutes per inch of thickness or until fish flakes easily with a fork.",
            "Brush with reserved marinade up until the last 5 minutes of cooking time.",
            "Discard leftover marinade."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/13/98/2/cg72v2oVSFO84VtIfgZb_Honey%2520Ginger%2520Grilled%2520Salmon_final_3.jpg"
    },
    {
        "id": 3264,
        "title": "Grilled Orange Chicken Breasts",
        "ingredients": [
            "boneless skinless chicken breasts",
            "olive oil",
            "lime juice",
            "garlic cloves",
            "dried thyme",
            "dried oregano",
            "ground cumin",
            "salt"
        ],
        "direction": [
            "Combine all ingredients except the chicken in a large resealable plastic bag; seal then lightly shake to mix.",
            "Add the chicken then turn to coat well.",
            "Seal and refrigerate 1-2 hours.",
            "Drain and discard marinade.",
            "Grill uncovered, over medium-hot coals, turning often, 10-15 minutes or until juices run clear."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/21/64/17/g417YNu0S1ulEIygMVv1_IAM_8150.jpg"
    },
    {
        "id": 3265,
        "title": "Ww 0 Point Weight Watchers Cabbage Soup",
        "ingredients": [
            "vegetable broth",
            "garlic cloves",
            "tomato paste",
            "cabbage",
            "yellow onion",
            "carrot",
            "green beans",
            "zucchini",
            "basil",
            "oregano"
        ],
        "direction": [
            "Spray pot with non stick cooking spray saute onions carrots and garlic for 5 minutes.",
            "Add broth, Tomato paste, cabbage, green beans, basil, oregano and Salt & Pepper to taste.",
            "Simmer for a about 5-10 minutes until all vegetables are tender then add the zucchini and simmer for another 5 or so minutes.",
            "I have tried different variations. Leaving out green beans. Adding chopped green onions in addition to the yellow onion.",
            "All very good. You can customize it a bit."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/12/89/56/tunMZv24R9W8wsDTVD68_cabbage%2520soup%2520(1%2520of%25204).jpg"
    },
    {
        "id": 3266,
        "title": "Tomato and Barley Soup",
        "ingredients": [
            "onion",
            "carrot",
            "celery",
            "garlic",
            "olive oil",
            "pearl barley",
            "stewed tomatoes",
            "chicken broth",
            "water",
            "bay leaf",
            "black pepper"
        ],
        "direction": [
            "Heat the olive oil in a large pot.",
            "Add the onions, carrots, celery and garlic. Saute for about 10 minutes or until the vegetables are starting to soften.",
            "While they are cooking pour the barley into a dish with water to cover.",
            "Add the tomatoes, broth, water, bay leaf, and pepper and bring to a boil, stirring occasionally.",
            "Drain the barley and add to the pot.",
            "Reduce heat and cook at a low boil for about 45 minutes (until the barley is tender).",
            "Add more water or broth if it thickens too much."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/28/04/66/qJJ0NiqTWOHNfeNs8hAg_tomato-barley-soup-4237.jpg"
    },
    {
        "id": 3267,
        "title": "Veggie Packed Cheesy Chicken Salad (Reduced Fat)",
        "ingredients": [
            "celery",
            "carrot",
            "fat-free mayonnaise",
            "nonfat sour cream",
            "dried parsley",
            "Dijon mustard",
            "reduced-fat sharp cheddar cheese"
        ],
        "direction": [
            "Mix all ingredients in a bowl so that everything is coated well with the mayonnaise mixture.",
            "Chill in the fridge for at least 30 minutes but you could do it the night before.",
            "Serve."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/27/93/61/bQuhmloQzeBej2wYRgG5_0S9A0399.jpg"
    },
    {
        "id": 3268,
        "title": "Cajun Shrimp and Mashed Cauliflower",
        "ingredients": [
            "salt",
            "cauliflower",
            "milk",
            "parmesan cheese",
            "salt",
            "olive oil",
            "onion",
            "garlic clove",
            "shrimp",
            "salt",
            "parsley",
            "black pepper"
        ],
        "direction": [
            "In a medium pot, bring a plenty of water to a boil. Add 1 tsp of salt and cauliflower florets, and boil until the cauliflower becomes very soft.",
            "Drain water. Add milk, Parmesan cheese (if using), and salt and mush the cauliflower. Adjust the amount of milk and salt. Set aside.",
            "In a sauté pan, heat olive oil and sauté onion for a few minutes. Add garlic and sauté until the garlic is fragrant.",
            "Add shrimp, sprinkle cajun seasoning and salt and sauté until the shrimp is cooked.",
            "Turn off the heat and add parsley.",
            "On two plates, place mashed cauliflower and add sautéed shrimp on top.",
            "Sprinkle some black pepper, infuse love and serve!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/51/17/52/URS8rfNRwnSpEZsdxtbg_0S9A7212.jpg"
    },
    {
        "id": 3269,
        "title": "Cobb Salad with Brown Derby Dressing",
        "ingredients": [
            "iceberg lettuce",
            "watercress",
            "chicory lettuce",
            "romaine lettuce",
            "tomatoes",
            "crisp bacon",
            "avocado",
            "chives",
            "blue cheese",
            "water",
            "sugar",
            "kosher salt",
            "Worcestershire sauce",
            "fresh lemon juice",
            "fresh ground black pepper",
            "Dijon mustard",
            "olive oil",
            "garlic"
        ],
        "direction": [
            "Chop all the greens very, very fine (almost minced).",
            "Arrange in rows in a chilled salad bowl.",
            "Cut the tomatoes in half, seed, and chop very fine.",
            "Fine dice the turkey, avocado, eggs and bacon.",
            "Arrange all the ingredients, including the blue cheese, in rows across the lettuces.",
            "Sprinkle with the chives.",
            "Present at the table in this fashion, then toss with the dressing at the very last minute and serve in chilled salad bowls.",
            "Serve with fresh french bread.",
            "FOR THE DRESSING: Combine all the ingredients except the olive oil in a blender and blend.",
            "Slowly, with the machine running, add the oil and blend well.",
            "Keep refrigerated.",
            "*NOTE:This dish should be kept chilled, and served as chilled as possible."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/51/55/5/v2hwt340S5mF9LoThUlk_IMG_2512-cobb-salad-brown-derby-dresssing.jpg"
    },
    {
        "id": 3270,
        "title": "Couscous-Chickpea Salad",
        "ingredients": [
            "cinnamon",
            "ground ginger",
            "ground cumin",
            "turmeric",
            "couscous",
            "carrot",
            "red onion",
            "red bell pepper",
            "cucumbers",
            "apple",
            "currants",
            "canned chick-peas",
            "salt",
            "fresh ground black pepper",
            "vinegar"
        ],
        "direction": [
            "In a heavy medium saucepan, whisk together the stock, cinnamon,ginger, cumin, and turmeric.",
            "Add the couscous in a slow steady stream, stirring constantly, and continue to boil, stirring, for 1 minute.",
            "Cover the pot tightly, remove from the heat and let stand for 15 minutes.",
            "Fluff the couscous grains with a fork, transfer to a large mixing bowl and let cool.",
            "Then fluff again, rubbing with your fingers to break up any lumps.",
            "Mix the carrot, bell pepper, cucumber, onion, apple, currants and chick peas and toss with the lemon juice.  Add to the couscous.",
            "Add salt and pepper to taste.  Add desired amount of vinaigrette and stir until well mixed.",
            "Cover and refrigerate for several hours or up to 3 days.",
            "Season with additional salt, pepper, lemon juice, and/or vinaigrette to taste before serving."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/54/59/3/YWF41Ob5TiWQN0grrXR3_untitled-1894.jpg"
    },
    {
        "id": 3271,
        "title": "Avocado Smoothie",
        "ingredients": [
            "avocado",
            "banana"
        ],
        "direction": [
            "Combine in blender and mix until there are no ice chunks and there is an overall smooth consistency. It will turn light green."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/20/83/99/PN2DzNgLSqyyvUfjt9n7_food.com-34.jpg"
    },
    {
        "id": 3272,
        "title": "Citrusy Kale Salad W/ Blueberries and Pepitas (& Variations)",
        "ingredients": [
            "kale",
            "extra virgin olive oil",
            "sea salt",
            "lemon, juice and zest of",
            "orange, juice and zest of",
            "honey",
            "avocado",
            "fresh blueberries"
        ],
        "direction": [
            "Variations-Instead of blueberries and pepitas try any of the following: blackberries and walnuts, sliced strawberries and pecans, raspberries and sliced almonds, marionberries and hazelnuts (<<--Oregon style!). I chose blackberry and walnut. There is a blackberry bush down the street that now is producing and I had to act quickly before the deer devoured my secret stash.",
            "Remove kale leaves from the stem and chop into bite sized pieces (or tear using hands).",
            "Place kale in a large bowl and drizzle 1 tablespoon olive oil and salt into leaves, massaging with hands. Do this for a few minutes, massaging the olive oil well into the leaves. Set aside. (Leaves should begin to wilt a little.).",
            "Whisk together lemon and orange juice and zest, remaining 1 Tbsp olive oil and honey. Season with a small amount of salt and pepper to taste. Pour dressing over the kale leaves.",
            "Add the avocado, berries and seeds and toss all together. Do not add the dressing, avocado, berries or seeds to the salad until just before serving."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/46/25/94/MwrTLl9tTi5LzTfU9XdA_kale%2520salad-9820.jpg"
    },
    {
        "id": 3273,
        "title": "Kale and Ginger Stir Fry",
        "ingredients": [
            "kale",
            "soy sauce",
            "water",
            "toasted sesame seeds"
        ],
        "direction": [
            "In a medium skillet, cook the ginger root in oil, stirring, over medium heat for 1 minute.",
            "Add the kale and raise the heat to medium high.",
            "Add the soy sauce and water, and stir-fry until the kale is wilted but still slightly crunchy, about 3 minutes.",
            "Sprinkle with sesame seeds.",
            "Serve warm or cold.",
            "You may substitute spinach or bok choy for the kale.",
            "Enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/58/85/3/gtLi4jp3TUugWUC0Uw3l_DSC_0659.JPG"
    },
    {
        "id": 3274,
        "title": "Vegan Fried ‘Fish’ Tacos",
        "ingredients": [
            "silken tofu",
            "panko breadcrumbs",
            "plain flour",
            "salt",
            "cayenne pepper",
            "ground cumin",
            "milk",
            "cabbage",
            "avocado",
            "tortillas",
            "vegan mayonnaise",
            "red onion",
            "apple cider vinegar",
            "sugar",
            "salt"
        ],
        "direction": [
            "Pat the tofu with a fiew pieces of kitchen roll to remove excess moisture. Use a knife to break the tofu into rough 1-inch chunks – I like them to be imperfect, not cubes, so they look nicer!",
            "Place the breadcrumbs into one wide shallow bowl.",
            "Place the flour, salt, smoked paprika, cayenne and cumin into another wide shallow bowl and stir together.",
            "Place the milk into a third wide shallow bowl.",
            "Take the chunks of tofu and gently coat them in the flour then the milk then the breadcrumbs and onto a baking sheet.",
            "Fill a deep frying pan with 1/2 -inch depth of vegetable oil. Place over a medium heat and let the oil get hot – sprinkle a breadcrumb in and if it start to bubble and brown, the oil is hot enough. Add chunks of breaded tofu to the oil and fry until golden underneath then flip and cook so it’s golden all over. Remove to a baking sheet lined with kitchen roll to drain. Repeat with the remaining tofu.",
            "Heat the apple cide vinegar, salt and sugar in a small pot until steaming. Place the finely sliced red onion in a bowl or jar and pour the hot vinegar over. Let it sit for at least 30 minutes to soften and turn pink.",
            "Serve the hot fried tofu in warmed tortillas (I warm them over the lit gas ring of my stove), pickled onion, a smear of vegan mayo, some avocado and shredded cabbage."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/73/99/RZ9ZDEiyRAi8opqEhKTi_IndulgentVegan-6791.jpg"
    },
    {
        "id": 3275,
        "title": "Mexican Casserole - 6.5 Weight Watcher Points",
        "ingredients": [
            "onion",
            "fresh tomatoes",
            "kernel corn",
            "black beans",
            "corn tortillas",
            "nonfat sour cream",
            "fresh cilantro"
        ],
        "direction": [
            "Brown ground beef and chopped onions in large skillet; brown 10 to 12 minutes or until thoroughly cooked, stirring constantly. Drain well and rinse with warm water to remove all fat; return beef/onions to skillet.",
            "Add corn, black beans, tomatoes, chilies/jalapenos and taco seasoning mix; mix well. Reduce heat; simmer 5 minutes.",
            "Meanwhile spray 12x8-inch (2-quart) baking dish with nonstick cooking spray. Cut each tortilla in half; place 8 halves in bottom of sprayed baking dish, overlapping slightly.",
            "Spoon half of beef mixture evenly over tortillas. Spoon sour cream over beef mixture; spread evenly. Top with remaining 8 tortilla halves and remaining beef mixture. (Cover tightly with foil & Freeze for later OR cook as directed below…).",
            "(Thaw overnight if frozen) Heat oven to 350ºF. Bake at 350ºF for 25 minutes. Remove from oven; sprinkle with cheese. Cover; let stand 5 minutes or until cheese is melted. Sprinkle with chopped cilantro and serve with fresh chopped lettuce, tomatoes, salsa, black olives, etc… /.",
            "Makes 6 large Servings at 6.5 weight watcher pts/each."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/13/58/14/93KxsbP3RQGseFxE4yC3_december%2520batch-3.jpg"
    },
    {
        "id": 3276,
        "title": "Gluten-Free Pancakes",
        "ingredients": [
            "Gluten-Free Flour Blend",
            "xanthan gum",
            "baking powder",
            "salt",
            "sugar",
            "milk",
            "eggs"
        ],
        "direction": [
            "Combine all dry ingredients in a bowl.",
            "In a separate bowl, whisk together milk, eggs, and cooking oil.",
            "Add milk mixture to the dry ingredients, and whisk until well blended.",
            "Let stand for about 10 minutes.",
            "Preheat ungreased, non-stick frying pan to medium heat.",
            "Pour batter by spoonfuls onto the hot pan.",
            "Pancakes are ready to be turned over when the edges are no longer glossy, and the bubbles that pop stay open.  To check the second side for doneness, you just have to lift an edge of the pancake up with a spatula and take a peek."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/20/85/56/CspPqjBqS1G0npE30mXx-075-gluten-free-pancakes.jpg"
    },
    {
        "id": 3277,
        "title": "Air Fryer Chicken Parm",
        "ingredients": [
            "panko breadcrumbs",
            "parmesan cheese",
            "salt",
            "dried oregano",
            "olive oil",
            "boneless skinless chicken breasts",
            "part-skim mozzarella cheese"
        ],
        "direction": [
            "Set the air fryer to 350°F (It will need about three minutes to preheat.).",
            "Place Panko breadcrumbs, parmesan cheese, salt and oregano in a shallow dish.",
            "Brush chicken breasts on both sides with olive oil.",
            "Dredge the chicken in the panko mixture, coating both sides.",
            "Transfer two pieces of coated chicken to the air fryer and cook for 10 minutes.",
            "Pause the air fryer and open the basket.",
            "Top each piece of chicken with sauce and cheese.",
            "Cook for an additional 5 to 7 minutes until chicken is cooked through and cheese is melted and bubbly or until the internal temperature of the chicken is 165°F.",
            "Repeat with remaining 2 pieces of chicken."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/87/25/YRXktkpQYWpbk1yqm0eh_0S9A3674.jpg"
    },
    {
        "id": 3278,
        "title": "Cauliflower Rice Pudding",
        "ingredients": [
            "rice",
            "coconut cream",
            "sugar",
            "vanilla extract",
            "cinnamon",
            "coconut",
            "blueberries"
        ],
        "direction": [
            "Add the cauliflower to a food processor and pulse until finely chopped.  Transfer to a saucepan and add coconut cream, sugar, vanilla extract and cinnamon.",
            "Bring to a simmer over medium heat and let simmer about 5-7 minutes, stirring frequently.",
            "Add egg yolk to a small bowl and beat with a fork.  Add a couple ladles of the hot cauliflower mixture into the bowl with the egg yolk and beat to combine.  Then add that mixture to the saucepan and stir to combine.",
            "Simmer 5-10 minutes, or until thickened.",
            "Transfer mixture to an ice bath and let chill until cooled to room temperature, stirring occasionally.",
            "Transfer to a container and chill in the refrigerator for at least 3 hours before serving.",
            "To serve, garnish with a spoonful of coconut or almond milk, toasted almonds and blueberries."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/74/71/d8vqkwKiTRi8tCxs9NSb_DSC04546-2.jpg"
    },
    {
        "id": 3279,
        "title": "Vegan Tiramisu",
        "ingredients": [
            "coconut milk",
            "vegan cream cheese",
            "granulated sugar",
            "all-purpose flour",
            "granulated sugar",
            "baking powder",
            "coffee",
            "vanilla extract",
            "salt",
            "marsala wine"
        ],
        "direction": [
            "Place the coconut milk can in the fridge overnight so the cream separates out and hardens. Remove from the fridge the next day, flip the can over and open from the bottom of the can. Pour out the liquid leaving the hardened coconut cream behind. Scoop the cream into a bowl and whisk until fluffy. Whisk in the vegan cream cheese and sugar until smooth. Chill until needed.",
            "Preheat the oven to 350&deg;F Mix the flour, sugar, baking powder and salt in a medium bowl. Add the vegetable oil, coffee and vanilla and stir together until just smooth. Line an 8-inch square tin with baking paper and pour in the cake batter. Bake for 25-30 minutes until a skewer inserted into the center of the cake comes out clean. Set aside to cool then break into roughly 2-inch chunks.",
            "When ready to assemble gather 6-8 glasses. Mix the marsala and strong coffee in a wide, shallow bowl. Dip the cake chunks into the coffee mixture and place into the glasses to make the first layer. Top with a spoonful of the coconut cream. Repeat the dipping and layering until all the glasses are filled. Dust the tops of the glasses with a thick layer of cocoa powder and chill the glasses for at least an hour to set and soften."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/73/89/05LmVUoBQSOvcHPq10kF_IndulgentVegan-6756.jpg"
    },
    {
        "id": 3280,
        "title": "Mediterranean Chicken Breasts With Avocado Tapenade",
        "ingredients": [
            "boneless skinless chicken breast halves",
            "lemon peel",
            "fresh lemon juice",
            "olive oil",
            "olive oil",
            "garlic clove",
            "salt",
            "ground black pepper",
            "garlic cloves",
            "sea salt",
            "fresh ground pepper",
            "tomatoes",
            "capers",
            "fresh basil leaves",
            "Hass avocado"
        ],
        "direction": [
            "In sealable plastic bag, combine chicken and marinade of lemon peel, 2 tablespoons lemon juice, 2 tablespoons olive oil, garlic, salt and pepper. Seal bag and refrigerate for 30 minutes.",
            "In bowl, whisk together remaining 3 tablespoons lemon juice, roasted garlic, remaining 1/2 teaspoons olive oil, sea salt and fresh ground pepper. Mix in tomato, green olives, capers, basil and avocado; set aside.",
            "Remove chicken from bag and discard marinade. Grill over medium-hot coals for 4 to 5 minutes per side or to desired degree of doneness.",
            "Serve with Avocado Tapenade."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/17/82/49/C0UjeSAKQi69gCwS0DBQ_0S9A2819.jpg"
    },
    {
        "id": 3281,
        "title": "Warm Steak-And-Mushroom Salad",
        "ingredients": [
            "kosher salt",
            "fresh ground black pepper",
            "olive oil",
            "mushrooms",
            "beef broth",
            "dry red wine",
            "garlic cloves"
        ],
        "direction": [
            "Heat a large heavy-bottomed skillet over medium-high heat. Sprinkle steak with 1 teaspoon of the salt and 1/2 teaspoon of the pepper; place in skillet and cook 8 minutes, turning half-way through, for medium-rare. Remove from skillet and keep warm.",
            "Add oil to skillet and cook mushrooms 3 minutes; remove from skillet and keep warm.",
            "Raise heat to high; add broth, wine, and garlic and cook until reduced to 1/2 cup, 10 minutes. Stir in remaining salt and pepper.",
            "Remove 4 tablespoons of broth mixture and toss with spinach in a large bowl; divide spinach among four plates.",
            "Top with sliced steak and mushrooms; drizzle with remaining broth mixture."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/16/80/39/mkijWWdCReFLLy8bjxdn_0S9A2985.jpg"
    },
    {
        "id": 3282,
        "title": "Healthy Chocolate Chip Cookies",
        "ingredients": [
            "sugar",
            "whole wheat flour",
            "oats",
            "milk",
            "olive oil",
            "egg",
            "baking soda",
            "cinnamon",
            "nutmeg",
            "walnuts",
            "salt"
        ],
        "direction": [
            "Combine dry ingredients.",
            "Mix in olive oil, egg and milk.",
            "Add spices and salt.",
            "Add chocolate chips and nuts.",
            "Bake at 350 for 10-12 minutes.",
            "Enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/29/58/13/01503343086.jpeg"
    },
    {
        "id": 3283,
        "title": "\" Healthy\" Fried Rice",
        "ingredients": [
            "brown rice",
            "olive oil",
            "peas",
            "carrot",
            "broccoli floret",
            "egg",
            "soy sauce"
        ],
        "direction": [
            "Heat 1 tbsp oil in pan and sauté mushrooms until browned.",
            "Remove from heat.",
            "Heat remaining oil in pan and add rice.",
            "Add egg and mix until rice is thoroughly coated with egg.",
            "Cook for 5-10 minutes on high, or until egg is lightly browned.",
            "Combine rice mixture and vegetables in large bowl and stir until vegetables are well mixed.",
            "Add soy sauce to taste and serve."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/66/93/2/0UWfWxCRR8G73Ry0eFzX_DSC04911-2.jpg"
    },
    {
        "id": 3284,
        "title": "Tarragon Chicken Casserole",
        "ingredients": [
            "boneless skinless chicken breasts",
            "onion",
            "tarragon",
            "poultry seasoning",
            "salt",
            "pepper",
            "milk"
        ],
        "direction": [
            "In 13 X 9 inch baking pan, place chicken pieces.",
            "Do not overlap.",
            "Place onion rings over top.",
            "Mix seasonings with cream of chicken soup and milk and spoon over chicken.",
            "Bake, uncovered, in 375 degree oven for 40 minutes.",
            "Sprinkle chicken with almonds, if desired.",
            "Bake 10 minutes more or until chicken is tender."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/31/07/8/F5QSjXaoR7yEeMfluhiO_tarragon-chicken-casserole-7682.jpg"
    },
    {
        "id": 3285,
        "title": "Baked Honey-Lime Chicken Wings",
        "ingredients": [
            "limes",
            "honey",
            "garlic cloves",
            "ground coriander",
            "salt",
            "black pepper",
            "chicken drumsticks",
            "lime wedge"
        ],
        "direction": [
            "Preheat over to 450 degrees. From limes, grate 2 tsp peel and squeeze 1/4 cup juice.",
            "In small bowl with fork, mix honey, garlic, coriander, salt, pepper, lime juice, and 1 tsp lime peel.",
            "Arrange chicken on two 15 1/2\" by 10 1/2\" jelly roll pans. Drizzle lime mixture over chicken; toss to coat evenly. Place pans on  oven racks. Bake drumsticks 30-35 minutes, rotating pans between upper and lower racks halfway through baking and occasionally brushing chicken with glaze in pan, until chicken is cooked through.",
            "Transfer chicken to serving dish. Drizzle with pan juices. Garnish with lime wedges and sprinkle with remaining lime peel."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/21/49/45/bULWFWCrRYmXVzWwSiFL_honey-lime-chicken-wings-3858.jpg"
    },
    {
        "id": 3286,
        "title": "Baked-Up Fried Chicken, Low Fat",
        "ingredients": [
            "low-fat buttermilk",
            "boneless skinless chicken breasts",
            "all-purpose flour",
            "salt",
            "garlic powder",
            "dried oregano leaves",
            "chili powder",
            "baking powder",
            "olive oil"
        ],
        "direction": [
            ". Preheat oven to 450F (230C).",
            "Line a rimmed baking sheet with foil and set a wire rack on top.",
            "Spray rack with cooking spray.",
            "In a large bowl, whisk buttermilk with egg white, add chicken and turn to evenly coat.",
            "Measure flour, salt, garlic powder, oregano, chili powder and baking powder into a large plastic bag.",
            "Close top and gently shake to evenly mix.",
            "Remove chicken, one piece at a time, from buttermilk and shake off excess liquid, then place in bag.",
            "Close top and shake gently to evenly coat.",
            "Remove from bag, shaking off excess coating, then place on rack, repeat with remaining chicken, one piece at a time.",
            "Discard any remaining milk and flour mixtures.",
            "Using a brush, lightly dab oil as evenly as possible over coating on chicken.",
            "Bake in centre of preheated oven until coating is crisp and golden, about 30 minutes.",
            "TIP:.",
            "If you have time, let chicken marinate in buttermilk before roasting. This makes it even more tender and adds tang, too! Place chicken and buttermilk mixture in a large plastic bag. Push chicken down into marinade, then squeeze out as much air as possible from bag. Seal tightly with an elastic band as close to chicken as possible. Place in a large bowl. Refrigerate 4 hours or overnight. Then proceed with recipe as written."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/35/65/49/W3YCW9QKSWai9oJT1zYd_baked-up-fried-chicken-healthy-4082.jpg"
    },
    {
        "id": 3287,
        "title": "Spinach and Bulgar Salad",
        "ingredients": [
            "Bulgar wheat",
            "green onion",
            "fresh dill",
            "feta cheese",
            "red wine vinegar",
            "olive oil",
            "cherry tomatoes"
        ],
        "direction": [
            "In a small bowl, combine bulgur and 1 and a 1/2 cups boiling water. Let stand until bulgur is tender to bite, about 15 minutes.",
            "Meanwhile, stack spinach leaves and cut into 1/4-inch-wide strips.",
            "Place spinach, onions, dill, and cheese in a wide bowl. Pour bulgur into a fine strainer and press out the excess water. Add bulgur to bowl with spinach.",
            "Mix vinegar and oil. Add to salad and mix. Season with salt and pepper to taste."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/38/24/32/4tyy395TXeU8v1p34le3_untitled-4769.jpg"
    },
    {
        "id": 3288,
        "title": "Chicken Tenders With Lemon-Spinach Rice",
        "ingredients": [
            "unsalted butter",
            "garlic cloves",
            "instant brown rice",
            "chicken broth",
            "mushroom",
            "dried thyme",
            "lemon juice",
            "lemon zest",
            "sea salt",
            "fresh ground black pepper"
        ],
        "direction": [
            "Melt the butter in a large skillet over medium heat; add the chicken tenders and the garlic; cook, turning, for 6 minutes or until the chicken is golden brown and the juices run clear; transfer to a plate and keep warm.",
            "Add all the remaining ingredients except the spinach and bring to the boil over a high heat; cover and reduce the heat to low;cook for 10 minutes or until the liquid has been absorbed.",
            "Add the spinach to the skillet and toss to mix well; place the contents of the pan on a large platter and top with the chicken."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/35/17/03/aVE3poGTjCpr2JtoClBB_chi2.jpg"
    },
    {
        "id": 3289,
        "title": "Orange Pork Chops for 2",
        "ingredients": [
            "extra virgin olive oil",
            "sweet potatoes",
            "orange",
            "cinnamon",
            "cayenne pepper"
        ],
        "direction": [
            "Brown chops in hot oil.",
            "squeeze juice of 1/2 orange over pork chops,deglaze the pan while browning chops.",
            "Cut sweet potatoe into 1/2 inch slices.",
            "Place meat, juice and sweet potatoe slices in a baking dish, sprinkle with cinnamon, salt and cayenne pepper, Cover all with orange slices.",
            "Bake covered in 350 degree oven for 1 hour or until meat is tender."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/12/45/5/LTxASlTW2Jq4UmGcySgP_0S9A9063.jpg"
    },
    {
        "id": 3290,
        "title": "Low-Fat Cajun-Style Fish in Parchment ...delish!",
        "ingredients": [
            "parchment paper",
            "shrimp",
            "parsley"
        ],
        "direction": [
            "Fold each sheet of parchment in half and cut into a heart shape.",
            "Sprinkle both sides of the filet's with the Cajun spice blend.",
            "Place fillets on one half of each parchment heart and top with shrimp and a sprinkling of parsley.",
            "Fold the edges of the parchment together to seal.",
            "Preheat oven to 425 degrees.",
            "Arrange parchment packets on a baking sheet.",
            "Bake for 12 minutes.",
            "Remove from heat and serve fast!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/14/07/27/ihdYjR27T4GAVtdgfpHh_cajun-fish-parchment-IMG_8535.jpg"
    },
    {
        "id": 3291,
        "title": "Grapefruit, Onion and Basil Salad",
        "ingredients": [
            "grapefruits",
            "red onion",
            "black olives",
            "fresh basil",
            "chives",
            "extra virgin olive oil"
        ],
        "direction": [
            "Place grapefruit slices on a platter, overlapping the edges.",
            "Top with onion and olives.",
            "Sprinkle with basil and chives.",
            "Drizzle with oil and vinegar."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/30/14/76/R8GmjAZ9T4qQqTvJQnYl_0S9A1338.jpg"
    },
    {
        "id": 3292,
        "title": "Broccomole",
        "ingredients": [
            "broccoli stems",
            "fresh lemon juice",
            "cumin",
            "garlic powder",
            "tomatoes",
            "scallion",
            "green chilies"
        ],
        "direction": [
            "Place broccoli stems, lemon juice, cumin & garlic powder in a blender or food processor & puree until smooth, then transfer to a bowl.",
            "Add remaining ingredients & mix well.",
            "Before serving, chill well for the best flavor."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/36/81/12/IO2Dug31ROyXe1HcGsCa_0S9A7382.jpg"
    },
    {
        "id": 3293,
        "title": "Easy Shrimp and Dijon Vinnaigrette Salad",
        "ingredients": [
            "red wine vinegar",
            "Dijon mustard",
            "Splenda sugar substitute",
            "extra virgin olive oil",
            "lettuce"
        ],
        "direction": [
            "In a large bowl whisk together red wine vinegar , Dijon mustard and Splenda.",
            "Then continue to whisk while adding olive oil until dressing is thoroughly mixed.",
            "Add lettuce and vegetables of your choice. Toss to coat.",
            "Top with cooked shrimp and you're ready to eat."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/23/77/67/7Fo2nUrrRKa9sZxZMApU_DSC04861-2.jpg"
    },
    {
        "id": 3294,
        "title": "Pork Roast over Sweet Potatoes for the Crock Pot",
        "ingredients": [
            "fennel seeds",
            "dried oregano",
            "paprika",
            "garlic",
            "salt",
            "pepper",
            "sweet potatoes",
            "chicken broth"
        ],
        "direction": [
            "Combine first 6 ingredients.",
            "Rub into pork.",
            "Put potatoes in the crock pot.",
            "Place pork on top of potatoes.",
            "Pour broth over all.",
            "Cover and cook on low for 8 to 10 hours."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/13/68/5/nKFJA4UsRCmrylZcBB1g_pork-roast-over-sweet-potatoes-IMG_9499.jpg"
    },
    {
        "id": 3295,
        "title": "Mangocado Pudding (Raw Recipe)",
        "ingredients": [
            "mango",
            "avocado",
            "flaked coconut"
        ],
        "direction": [
            "Blend fruit until smooth in food processor.",
            "Garnish with coconut if you like.",
            "Refrigerate until ready to serve."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/33/75/26/1MHSbxNbSIeGHEBjbsxW_mangocado-pudding-2.jpg"
    },
    {
        "id": 3296,
        "title": "Almond Joy Chocolate Bark",
        "ingredients": [
            "dark chocolate"
        ],
        "direction": [
            "Melt chocolate over very low heat.",
            "Pour chocolate into a parchment lined 8x8 inch baking dish.",
            "Scatter almonds and 3 tablespoons of coconut over chocolate.",
            "Using a spatula spread the mixture evenly back and forth to  ½ inch thickness.",
            "Sprinkle remaining tablespoon of coconut on top of mixture.",
            "Place bark in fridge for 2 hours to set.",
            "Break into square bars.",
            "Serve."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/42/13/13/picNkD1ec.jpg"
    },
    {
        "id": 3297,
        "title": "Rick's Vegetable Beef Soup",
        "ingredients": [
            "beef stew meat",
            "carrots",
            "potatoes",
            "frozen corn",
            "onion",
            "bay leaf",
            "diced tomatoes",
            "green beans",
            "water",
            "salt",
            "fresh ground black pepper"
        ],
        "direction": [
            "In a large pot, brown beef in hot oil.",
            "Add bouillon, spices, and water.",
            "Bring to a boil; reduce heat.",
            "Cover and simmer for 1 1/2 hour.",
            "Add remaining ingredients.",
            "Return to boiling; reduce heat.",
            "Cover and simmer 1/2 hour or until  vegetables are done.",
            "Season to taste with salt and black pepper."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/12/61/58/picqMp5hW.jpg"
    },
    {
        "id": 3298,
        "title": "Paleo Carrot Banana Muffins",
        "ingredients": [
            "baking soda",
            "sea salt",
            "cinnamon",
            "dates",
            "bananas",
            "eggs",
            "apple cider vinegar",
            "coconut oil",
            "carrots"
        ],
        "direction": [
            "Combine dry ingredients.",
            "Blend bananas, dates, eggs, vinegar, and coconut oil in a food processor.",
            "Mix wet ingredients with dry and fold in carrots.",
            "Spoon into greased or lined muffin tins and bake at 350 degrees for 25 minutes (or 20 minutes for mini-muffins)."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/44/19/44/ctWCD7ltSlu15YXALpQD_063%2520paleo%2520muffins.jpg"
    },
    {
        "id": 3299,
        "title": "Low Carb Scotch Eggs",
        "ingredients": [
            "bulk pork sausage",
            "cheddar cheese",
            "garlic powder",
            "banana pepper"
        ],
        "direction": [
            "Mix all ingredients (except eggs) together until thoroughly blended (it is best to use your hands).",
            "Divide the meat mixture into sixths and pat out one piece in your hand and mold it around one of the eggs.",
            "Repeat with remaining eggs and meat.",
            "Place them all on a baking sheet or in a baking pan and bake at 350°F for 30 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/98/87/4/Z2FL7Q9RkeDCe0BC3ZbL_Low%2520Carb%2520Scotch%2520Eggs_final_3.jpg"
    },
    {
        "id": 3300,
        "title": "Low-Carb Chocolate Peanut Butter Fudge (Xylitol)",
        "ingredients": [
            "artificial sweetener",
            "half-and-half cream",
            "vanilla extract"
        ],
        "direction": [
            "Melt the baking chocolate in a double boiler over medium heat.",
            "Add xylitol and half & half, and stir to blend well.",
            "Heat the mixture, stirring occasionally, until dissolved, smooth, and very hot (no need to boil).",
            "Remove from heat and stir in peanut butter and vanilla.",
            "Press mixture into a flat container that gives the desired height for your fudge. I use a fairly small container so that when I slice the fudge, pieces will be square.",
            "Chill until firm, then cut into 16 pieces. Store in refrigerator."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/45/02/57/cIRWUyTqS2eTJieFGPXa_chocolate-peanut-butter-fudge-9116.jpg"
    },
    {
        "id": 3301,
        "title": "Thai Chicken Noodle Salad (Gluten Free)",
        "ingredients": [
            "rice vinegar",
            "fish sauce",
            "honey",
            "garlic clove",
            "fresh ginger",
            "carrots",
            "red bell pepper",
            "English cucumber",
            "bean sprouts",
            "green onions",
            "cilantro",
            "sesame seeds",
            "lime"
        ],
        "direction": [
            "Place noodles in a large heat-proof bowl. Bring 5 cups of water to a boil and pour water over the noodles. Make sure noodles are fully submerged. Let stand, stirring occasionally, until noodles become tender, 20 to 25 minutes. Drain well and place noodles back in the bowl.",
            "While noodles are standing, stir together rice vinegar, soy sauce, fish sauce (if using), sesame oil, honey or sugar, hot sauce, garlic and ginger in a small bowl. After noodles have been drained, add this dressing to noodles and toss to coat.",
            "Add chicken, carrots, red pepper, cucumber, bean sprouts and green onions to noodles, tossing to combine.",
            "Divide noodles among serving plates and garnish with cilantro or basil and sesame seeds. Serve with lime wedges on the side."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/50/46/43/iMYbG0c6SqSuly07TckN_thai-chicken-noodle-salad-IMG_9692.jpg"
    },
    {
        "id": 3302,
        "title": "Graham Crackers (Gluten Free)",
        "ingredients": [
            "brown sugar",
            "cinnamon",
            "baking powder",
            "baking soda",
            "xanthan gum",
            "salt",
            "butter",
            "cold water",
            "honey",
            "vanilla",
            "sugar"
        ],
        "direction": [
            "In a large bowl, whisk together flours, sugar, cinnamon, baking powder, xanthan gum, baking soda and salt.",
            "Cut in butter using a pastry cutter or two knives until it resembles cornmeal.",
            "Stir in cold water, honey and vanilla. Dough should form a ball. If dough is too dry, add more cold water a tbsp at a time.",
            "Preheat oven to 325 degrees.",
            "Get out two cookie sheets and cover with wax or parchment paper. Spray lightly with non-stick cooking spray.",
            "Gather dough into a ball and divide in half. Using a lightly floured cloth covered rolling pin (I use sweet rice flour), roll half of the dough into a rectangle on one of the cookie sheets to about a 1/8\" thick. Repeat with the other half.",
            "Score dough with a pizza cutter (or knife) into desired shapes and prick all over with a fork. (I like to use plastic forks for pricking since they tend to make rounder and thicker holes.).",
            "Very lightly sprinkle all over with sugar.",
            "Bake for 20 minutes or until golden brown and starting to harden. Let cool for 5 minutes before breaking apart. (If not fully crispened, put back in turned off warm oven until crisp.)."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/34/08/12/Nu0sJj2RS2YRGWpHIyPz_GF%2520graham.JPG"
    },
    {
        "id": 3303,
        "title": "Quick Gluten Free Cinnamon Rolls",
        "ingredients": [
            "water",
            "butter",
            "honey",
            "cinnamon",
            "pine nuts"
        ],
        "direction": [
            "Preheat oven to 200 ° Celsius.",
            "Mix gluten-free bread flour mix and cream lightly. You should just barely nead to get a soft dough. If it's too crumbly, add water by tablespoons until the consistency is so that you can just form a ball of dough to roll out.",
            "Roll the dough out between two sheets of nonstick baking paper into a rectangle as thinly as possible. I managed about 1/2 inch thickness.",
            "Cream together butter, honey and cinnamon.",
            "Gently brush the mixture on the dough, maybe using a knife or your fingers. If the mass is too solid to brush, lightly melt it in a water bath so that it becomes softer but not liquid.",
            "Sprinkle with chopped pine nuts.",
            "Carefully roll the dough into a log.",
            "Using a sharp knife dusted with some rice flour, cut it into 14 rolls.",
            "If the filling is too runny, cover the log with cling-wrap and let it settle in the fridge for some minutes, then cut into rolls.",
            "Place rolls on a baking tray layered with baking paper. As **Jubes** suggests, put them together close to assist rising.",
            "Brush the top of the rolls with milk.",
            "Bake for about 10 minutes or until they're done.",
            "Enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/38/10/89/picUBaj24.jpg"
    },
    {
        "id": 3304,
        "title": "Quinoa Mexi 6-Layer (Ww Core)",
        "ingredients": [
            "quinoa",
            "olive oil",
            "onion",
            "garlic clove",
            "chili powder",
            "oregano",
            "corn",
            "black beans",
            "whole tomatoes",
            "Herdez red salsa"
        ],
        "direction": [
            "Prepare Quinoa:  Rinse in a sieve under running water.  Dry Roast in a skillet for approximately 7 minutes until a crackling sound is heard.  Boil 1.5 cups of water in a small saucepan, add the dry roasted quinoa.  Turn down the heat to low, cover and simmer for 20 minutes.",
            "While quinoa is simmering, heat oil in large skillet.  Add garlic and chopped onions, cook 2 or 3 minutes.",
            "Add beef, spices and hot sauce.  You may want to add a little salt and pepper here also.  Brown.",
            "Spread quinoa in a large baking dish.",
            "Layer remaining ingredients in this order:  Beef, corn, tomatoes, salsa, black beans and finally the grated soy cheese (Jalapeño flavor recommended).",
            "Bake at 450°F for 20 minutes.",
            "Broil for an additional 3-5 minutes to turn the cheese golden."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/30/22/18/zleO3TeSsOqXGpZIZ58k_DSC_4207.jpg"
    },
    {
        "id": 3305,
        "title": "Ww 3 Points - Grilled Chicken and Key Lime Salsa",
        "ingredients": [
            "Worcestershire sauce",
            "key lime juice",
            "chicken breast",
            "oranges",
            "key lime juice",
            "scallions",
            "cilantro",
            "green chili"
        ],
        "direction": [
            "Combine Worcestershire sauce, 3 tablespoons of lime juice and chicken in a ziptop plastic bag.",
            "Refrigerate up to 4 hours.",
            "Meanwhile, combine remaining ingredients in a medium bowl to make salsa.",
            "Refrigerate for a minimum of 1 hour.",
            "Preheat grill or broiler.",
            "Grill or broil chicken until cooked through, about 4 to 5 minutes per side.",
            "Serve chicken with salsa."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/28/31/99/1lLRWwq0QEOuVPLJUNqK_december%2520batch-2.jpg"
    },
    {
        "id": 3306,
        "title": "Red Beet Chocolate Cake",
        "ingredients": [
            "unbleached flour",
            "baking soda",
            "salt",
            "sugar",
            "eggs",
            "beet",
            "vanilla extract",
            "confectioners' sugar"
        ],
        "direction": [
            "Preheat oven to 350.",
            "Grease 13 x 9 x 2-inch baking pan.",
            "Sift together the flour, baking soda and salt; set aside.",
            "Combine sugar, eggs, and oil in a mixing bowl.",
            "Beat with an electric mixer set at medium speed for 2 minutes.",
            "Beat in the beets, cooled chocolate, and vanilla.",
            "Gradually add dry ingredients, beating well after each addition.",
            "Pour into prepared baking pan.",
            "Bake  for 25 minutes or until cake tests done.",
            "Cool in pan on rack.",
            "Cover and let stand overnight to improve flavor.",
            "Sprinkle with confectioners' sugar."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/78/83/nTVsoP9pS5mMP8Iuulru_BC%25206%2520-%2520final_1.jpg"
    },
    {
        "id": 3307,
        "title": "Crock Pot Chicken Casablanca (Ww Flex and Almost Core)",
        "ingredients": [
            "olive oil",
            "onions",
            "fresh ginger",
            "garlic cloves",
            "boneless skinless chicken breasts",
            "carrots",
            "sweet potatoes",
            "currants",
            "cumin",
            "turmeric",
            "pepper",
            "cinnamon",
            "cayenne pepper",
            "diced tomatoes",
            "zucchini",
            "garbanzo beans",
            "fresh parsley",
            "fresh cilantro"
        ],
        "direction": [
            "Sauté onions, ginger and garlic in oil for 3 or 4 minutes and transfer to crockpot.",
            "Brown chicken in same pan over medium heat. Reserve in skillet.",
            "Add carrots, potatoes to crock pot.",
            "Place chicken on top of veggies.",
            "Stir seasonings in a small bowl and sprinkle over chicken along with currants and raisins.",
            "If you like a very thick sauce, drain one of the two cans of tomatoes before adding to crock pot.  Top chicken with diced tomatoes.",
            "Add zucchini to the top.",
            "Cover and cook on HIGH for 4 to 6 hours.",
            "Add beans, parsley and cilantro 30 minutes before serving. (You can also do all cilantro or all parsley according to personal preference.).",
            "Serve over cooked rice or couscous."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/22/00/89/flZoQegTVqEwhfoVDnmQ_casablanca-chicken-veggies-crockpot-3888.jpg"
    },
    {
        "id": 3308,
        "title": "Quinoa-Stuffed Green Bell Peppers",
        "ingredients": [
            "quinoa",
            "onion",
            "mushrooms",
            "frozen corn kernels",
            "fresh coriander",
            "soy sauce",
            "fresh garlic",
            "red pepper flakes"
        ],
        "direction": [
            "Rinse quinoa under cold water; drain well.",
            "In a saucepan, bring 1 cup of water to boil and then stir in quinoa.",
            "Reduce heat, cover, and simmer for 15 minutes or until the water is absorbed and quinoa is translucent.",
            "Cut 1/2-inch off top of green peppers and remove seeds.",
            "In a large saucepan filled with boiling water, cook peppers for 5 minutes or until tender-crisp.",
            "Remove from water and drain well, upside down.",
            "In a skillet, heat oil over medium heat and cook onion until tender; stir in mushrooms, quinoa, corn, half the coriander, soy sauce, sesame oil, garlic and pepper flakes.",
            "Stuff this mixture into peppers.",
            "Sprinkle with bread crumbs and remaining coriander.",
            "Bake in a greased 8-inch baking dish in a preheated 350F (180C) oven for 30 minutes or until heated through."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/16/49/7/4HxsbHJnRPuIeXU1yuNm_2peppers%2520(1%2520of%25201).jpg"
    },
    {
        "id": 3309,
        "title": "Ww 7 Points - Chicken Yakitori (Kebabs)",
        "ingredients": [
            "reduced sodium soy sauce",
            "mirin",
            "sugar",
            "fresh ginger",
            "garlic clove",
            "boneless skinless chicken thighs",
            "red bell peppers",
            "scallions",
            "cooked brown rice"
        ],
        "direction": [
            "Make sauce: bring soy sauce, mirin, sugar, ginger, and garlic to boil in small saucepan.",
            "Cook over med-high heat until sauce thickens, about 5 minute.",
            "Remove from heat, set aside.",
            "Spray grill or broiler pan with nonstick spray.",
            "Thread chicken, bell peppers, and scallions on to skewers, alternating the ingredients.",
            "Grill or broil kebabs 5-inches from heat, frequently brushing with sauce, until veggies are tender and chicken is cooked through.",
            "Serve with the rice.",
            "7 Points for 2 skewers and 1/2 cup rice."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/25/03/99/etLCY8VTSGVBOa2svuRg_1chkskewer3%2520(1%2520of%25201).jpg"
    },
    {
        "id": 3310,
        "title": "Weight Watcher 1 Point Banana Bread--Flex Points",
        "ingredients": [
            "bananas",
            "Splenda sugar substitute",
            "all-purpose flour",
            "whole wheat flour",
            "salt",
            "baking soda"
        ],
        "direction": [
            "Preheat oven to 350 degrees.",
            "In a mixer, mash bananas, add Splenda and mix.",
            "Mix in rest of indgredients.",
            "Pour ingredients into a bread pan sprayed with non-stick spray.",
            "Bake for 50 to 60 minutes; cake tester should come out clean when done.",
            "Remove from pan and cool on a wire rack.",
            "*If using a dark coated pan, bake at 325 degrees and bake a little longer; cake tester to should come out clean when done."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/15/46/36/MJhXkgteTmBYuVbV8rxH_DSC05656-2.jpg"
    },
    {
        "id": 3311,
        "title": "Slim Chili Lasagna",
        "ingredients": [
            "butter",
            "onion",
            "garlic clove",
            "green pepper",
            "ground turkey",
            "chili powder",
            "tomato sauce",
            "sugar",
            "lentils",
            "egg",
            "low fat cottage cheese",
            "part-skim mozzarella cheese"
        ],
        "direction": [
            "In a 2-qt. non- stick saucepan, melt butter over medium heat.",
            "Add onion, garlic, green pepper and ground turkey.",
            "Cook, stirring and breaking up meat until brown, about 5 minutes.",
            "Pour off drippings.",
            "Stir in chili powder, tomato sauce, sugar and lentils.",
            "Bring to boiling; reduce heat to low, cover and simmer for about 30 minutes, or until lentils are tender, stirring occasionally to keep mixture from sticking.",
            "Meanwhile, cook lasagna according to directions on package; drain.",
            "In medium bowl, beat egg, blend in cottage cheese, mix well.",
            "Preheat oven to 375*F.",
            "In a 13x9x2-inch pan, arrange half the noodles, overlapping to fit, spread with half the cheese-egg mixture, half the meat mixture, and half the Mozzarella.",
            "Repeat layers.",
            "Bake covered about 40 minutes, until bubbly. Let stand 10 minutes before serving."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/37/97/16/zoKiEklhQYquaXPPS3Ug_skinny-chili-lasagna-3.jpg"
    },
    {
        "id": 3312,
        "title": "Quinoa Pudding",
        "ingredients": [
            "quinoa",
            "water",
            "eggs",
            "nonfat milk",
            "non-fat powdered milk",
            "vanilla",
            "sugar",
            "sugar",
            "salt",
            "dried currant",
            "cinnamon"
        ],
        "direction": [
            "Place quinoa in a bowl of water.  Begin the cleaning by rubbing the grain together between your hands. Drain and repeat several times.  You will know the quinoa is clean when the water is no longer milky after rubbing.  This step is essential for removing the bitter layer that surrounds the grain.",
            "Bring quinoa and 6 cups water to a boil in a large saucepan. Reduce heat and simmer, uncovered, until grains are translucent, 13 to 15 minutes. Drain well in a sieve.",
            "Preheat oven to 350°F.",
            "To measure milk, place powdered milk in measuring cup and add milk to one cup. Stir together to dissolve milk powder.  If you do not have powdered milk, its best to use whole milk.",
            "Whisk together eggs, egg whites, milk, vanilla, 3/4 cup sugar, and salt in a large bowl until just combined. Mix in quinoa, nuts, and currants.  Pour into a buttered 9-inch square baking pan prepared with a coat of cooking spray.",
            "Stir together cinnamon and remaining tablespoon sugar and sprinkle over top of pudding. Bake until a knife inserted in center comes out clean, around 40 minutes.",
            "Serve warm or at room temperature."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/13/75/05/x4R5ttERQGzfo2UX0w4L_DSC_4126.jpg"
    },
    {
        "id": 3313,
        "title": "Perfect Cauliflower Pizza Crust",
        "ingredients": [
            "raw cauliflower",
            "egg",
            "dried oregano",
            "salt"
        ],
        "direction": [
            "Preheat your oven to 400°F.",
            "To make the cauliflower rice, pulse batches of raw cauliflower florets in a food processor, until a rice-like texture is achieved.",
            "Fill a large pot with about an inch of water, and bring it to a boil. Add the “rice” and cover; let it cook for about 4-5 minutes. Drain into a fine-mesh strainer.",
            "THIS IS THE SECRET: Once you’ve strained the rice, transfer it to a clean, thin dishtowel. Wrap up the steamed rice in the dishtowel, twist it up, then SQUEEZE all the excess moisture out! It’s amazing how much extra liquid will be released, which will leave you with a nice and dry pizza crust.",
            "In a large bowl, mix up your strained rice, beaten egg, goat cheese, and spices. (Don’t be afraid to use your hands! You want it very well mixed.) It won’t be like any pizza dough you’ve ever worked with, but don’t worry– it’ll hold together!",
            "Press the dough out onto a baking sheet lined with parchment paper. (It’s important that it’s lined with parchment paper, or it will stick.) Keep the dough about 3/8” thick, and make the edges a little higher for a “crust” effect, if you like.",
            "Bake for 35-40 minutes at 400°F The crust should be firm, and golden brown when finished.",
            "Now’s the time to add all your favorites– sauce, cheese, and any other toppings you like. Return the pizza to the 400F oven, and bake an additional 5-10 minutes, just until the cheese is hot and bubbly.",
            "Slice and serve immediately!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/50/02/26/mJ29jVb8QJ6TXmhsPOlz_untitled-8180.jpg"
    },
    {
        "id": 3314,
        "title": "Buffalo Chicken Tostone Sandwiches",
        "ingredients": [
            "ghee",
            "red wine vinegar",
            "chicken",
            "scallions",
            "avocados",
            "lime",
            "coconut oil",
            "green plantains",
            "romaine lettuce",
            "tomatoes",
            "red onion",
            "fresh cilantro stem",
            "kosher salt"
        ],
        "direction": [
            "In a medium skillet over medium heat, combine wing sauce, ghee and red wine vinegar. Fold in shredded chicken, scallions and season with salt and pepper to taste. In a medium bowl, mash avocados with lime juice, salt and pepper; set aside.",
            "Heat coconut oil in a medium skillet over medium high heat. Working in batches, fry the plantains until golden and cooked through, about 3-4 minutes per side. Remove from oil and smash to flatten with a mallet or small fry pan. Return plantain  to oil and cook another 2-3 minutes to crisp. Remove from oil, drain on a towel-lined plate and season with salt. Repeat with remaining ingredients.",
            "To assemble, top a plantain with chicken, shredded lettuce, sliced tomatoes, sliced onions smashed avocados and sprigs cilantro. Top with another plantain and cut in half to serve."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/75/07/f5bPF0vzTLyAckRzD61a_0S9A4847.jpg"
    },
    {
        "id": 3315,
        "title": "Neapolitan Cheesecake and Coconut Whipped Cream",
        "ingredients": [
            "pitted dates",
            "unsweetened flaked coconut",
            "sea salt",
            "coconut oil",
            "cashews",
            "pitted dates",
            "coconut oil",
            "lemon juice",
            "vanilla bean",
            "sea salt",
            "unsweetened coconut milk",
            "frozen cherries",
            "vanilla bean",
            "sea salt"
        ],
        "direction": [
            "To make the crust: Place all the ingredients in a food processor except for the coconut oil. Process until a fine crumb is formed. Slowly pour in the melted coconut oil, 1 tablespoon at a time, until the crust holds together when you squeeze it. Place the crust in a 9-inch spring form pan, pressing it firmly into the bottom of the pan in a single, even layer. Put the crust in the freezer until ready to top it with the filling.",
            "To make the cheesecake filling: Bring a pot of water to a boil. Remove from heat and add in the cashews. Let the cashews soak for 2 hours. Drain the cashews.",
            "Place the soaked cashews, 1 cup dates, coconut oil, lemon juice, vanilla and sea salt in a food processor. Process until the dates and cashews have broken down into small pieces. With the food processor running, slowly stream in 2 1/4 cups coconut milk. Continue to process for 5 minutes or until the filling is smooth.",
            "Remove 1/2 cup of filling and set aside, this will be the vanilla layer.",
            "Remove another 2 1/2 cups of filling to a large bowl. Whisk in the unsweetened cocoa powder, cacao nibs and 3 tablespoons chopped dates. Set aside.",
            "To the remaining filling in the food processor add half the cherries. Process for 1 minute or until the cherries have completely broken down. Add in the remaining cherries and pulse a few times until there are small pieces of cherry visible in the filling.",
            "Check the consistency of each of the fillings and make sure they are pourable. If they do not easily pour, stir in some additional coconut milk to get the right consistency.",
            "Pour the cherry filling into the spring form pan. Then, gently pour the chocolate filling into the center of the cherry filling. Take your time pouring the filling so that it stays in the middle. Tap the spring form pan on the table as needed to settle the filling. Next, slowly pour in the vanilla filling into the center of the chocolate filling. Again, tap the pan on the table to settle the filling. Use a toothpick to drag the top of the cheesecake to make a design on top.",
            "Place the cheesecake in the freezer for at least 4 hours to set but ideally overnight.",
            "To make the coconut whipped cream: Carefully open the cold coconut cream. Gently scoop out the thick coconut cream to the bowl of a stand mixer fitted with a whip attachment and add in the vanilla beans. Whip the coconut cream on high until it doubles in volume. If necessary, add in up to 1 tablespoon of the coconut liquid from the can to get a smooth texture.",
            "To serve: When ready to serve, remove the cheesecake from the freezer and let stand at room temperature for 30 minutes before removing the sides from the spring form pan. Cut the cake into slices and serve with 1 tablespoon coconut whipped cream. Sprinkle flakey sea salt on top and serve immediately.",
            "Nutrition Info Per Serving.",
            "Calories: 993.",
            "Total Fat: 74  grams.",
            "Saturated Fat: 41 grams.",
            "Total Carbohydrate:  84 grams.",
            "Sugars: 54 grams.",
            "Protein:  15 grams.",
            "Sodium:  108 milligrams.",
            "Cholesterol:  0 milligrams.",
            "Fiber:  11 grams."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/74/50/bxC3gBYAQQ6HMjg76JP7_cheesecake%2520(4%2520of%25206).jpg"
    },
    {
        "id": 3316,
        "title": "Blackened Tuna Bites with Cajun mustard",
        "ingredients": [
            "tuna",
            "olive oil",
            "sour cream",
            "mayonnaise",
            "spicy mustard",
            "horseradish",
            "paprika"
        ],
        "direction": [
            "Make the mustard first: Mix all ingredients in a small saucepan.",
            "Bring to a boil, stirring often.",
            "When somewhat smooth, it's done.",
            "Now start the tuna: TUNA Cut up tuna in large bite size pieces Coat with blackening seasoning Heat oil in pan till very hot, but not smoking Sear tuna on all sides for about 7-10 minutes total.",
            "Do not overcook.",
            "It's good for the tuna to be slightly pink on the inside.",
            "Serve right away with Cajun Mustard.",
            "This can also be made with peeled jumbo shrimp."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/82/66/3/fYS5nHzSzi2szggfkKEN_blackened-tuna-bite-cajun-mustard_2074.jpg"
    },
    {
        "id": 3317,
        "title": "Tvp Vegan Sloppy Joes",
        "ingredients": [
            "onion",
            "green pepper",
            "olive oil",
            "boiling water",
            "tomato sauce",
            "chili powder",
            "pepper",
            "salt",
            "soy sauce",
            "mustard",
            "sugar"
        ],
        "direction": [
            "Saute onion and green pepper in oil.",
            "Add remaining ingredients and simmer together for 20 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/22/09/80/yGIj5bjQyeT6aj26MOlX_0S9A0971.jpg"
    },
    {
        "id": 3318,
        "title": "Cauliflower \"Steaks\" With Olive Relish",
        "ingredients": [
            "cauliflower head",
            "kalamata olive",
            "sun-dried tomatoes",
            "olive oil",
            "flat leaf parsley",
            "fresh lemon juice",
            "kosher salt",
            "fresh ground black pepper",
            "garlic cloves",
            "plum tomatoes"
        ],
        "direction": [
            "Remove leaves and trim stem end of cauliflower, leaving core intact. Slice cauliflower into four 1/2\" \"steaks\" from center of cauliflower (some florets will break loose; reserve).",
            "Finely chop enough loose florets to measure 1/2 cup.",
            "Transfer chopped florets to a small bowl and mix with olives, sun-dried tomatoes, 1 tablespoon oil, parsley, and lemon juice. Season relish with salt and pepper.",
            "Preheat oven to 400°. Heat 1 tablespoon olive oil in a large heavy ovenproof skillet over medium-high heat. Cook cauliflower steaks until golden brown, about 2 minutes per side, adding tablespoon oil to pan between batches.",
            "Transfer steaks to a large rimmed baking sheet. Reserve skillet. Roast cauliflower until tender, about 15 minutes.",
            "Meanwhile, return skillet to medium-high heat and add garlic cloves and tomatoes, one cut side down. Cook until tomatoes are browned; turn tomatoes over and transfer skillet to oven with cauliflower. Roast garlic and tomatoes until tender, about 12 minutes.",
            "Transfer garlic, tomatoes, and 1/2 tablespoon oil to a blender; purée until smooth. Season with salt and pepper. Divide tomato sauce among plates. Place 1 cauliflower steak on each plate; spoon relish over. Serve warm or at room temperature."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/50/51/15/hnVDQLENSiW5x0nRV7m1_cauliflower-steaks-olive-relish_0061-3840x2160.jpg"
    },
    {
        "id": 3319,
        "title": "Whole30 Slow Cooked BBQ Pulled Pork With Coleslaw",
        "ingredients": [
            "kosher salt",
            "paprika",
            "ground black pepper",
            "garlic powder",
            "onion powder",
            "chili powder",
            "ground coriander",
            "ground cumin",
            "ground fennel",
            "extra virgin olive oil",
            "boneless pork shoulder",
            "tomato paste",
            "apple cider vinegar",
            "Dijon mustard",
            "dates",
            "chili powder",
            "garlic powder",
            "kosher salt",
            "red cabbage",
            "green cabbage",
            "fennel bulb",
            "fuji apple",
            "red onion",
            "fresh parsley leaves",
            "lemon",
            "apple cider vinegar",
            "mayonnaise",
            "kosher salt",
            "Dijon mustard",
            "lemon juice",
            "garlic clove",
            "canola oil",
            "kosher salt"
        ],
        "direction": [
            "To make the pulled pork: In a medium bowl, whisk together all the spices. Set aside.",
            "Rub spice mixture evenly over the pork, store any extra spice rub in an airtight container with the rest of your spices. You can cook the pork right away but ideally marinate the pork in the spice rub for 4 hours or even overnight.",
            "Preheat oven to 250 degrees F. Place a long piece of foil across a half sheet tray so there is some hanging off both sides. Then place another long piece of foil going in the opposite direction. Place the seasoned pork, fat side up, in the center of the foil and toss to coat with the olive oil. Tightly cover the pork with the foil, keeping the foil seam on the top. Place in the oven and cook for 3 hours. Remove the pork from the oven and carefully open the foil pack so the top is exposed but so that the foil is still catching the juices released from the pork. Place the pork back in the oven and cook an additional 2 ½ - 3 hours or until the pork is tender and easily shreds with a fork. Remove from the oven and turn on the broiler.",
            "To make the BBQ sauce: While the pork is cooking make the BBQ sauce. Drain the dates and chiles from the warm water once they have softened. Add chilies to the sauce based on your spice preference. Place all the ingredients in a blender and blend on high until the sauce is smooth and shiny. Season with salt and remove to an airtight container and refrigerate until ready to serve.",
            "To make the Whole30 mayo: Place the yolks, mustard, lemon juice and garlic in a blender and blend on high until smooth and combined. With the blender running slowly stream in the oil until the mixture emulsifies and forms mayonnaise. Season to taste with salt. Store in an airtight container in the refrigerator until ready to serve. You can use it right away but I like to serve it the next day after the garlic has flavored the mayo.",
            "To make the coleslaw: In a large bowl combine the cabbages, fennel, apple, red onion, parsley, lemon juice and vinegar. Fold in enough mayo to lighten the coleslaw in color and give a creamy taste, up to a ¼ cup. Taste and season with salt. Refrigerate until ready to serve.",
            "To serve: Top the pork with 1/2 cup of BBQ sauce and place under the broiler for 4-5 minutes or until the sauce has caramelized. Remove from the oven and shred the pork into bite sized pieces. Toss the pork with more of the BBQ sauce. Serve the remaining BBQ sauce on the side with the coleslaw.",
            "All leftovers hold well in the refrigerator for up two days except for the BBQ sauce which will hold in the refrigerator for up to 1 week."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/72/39/vUG1GZLYROeA1SAMYWIq_Porkandslaw1%2520(1%2520of%25201).jpg"
    },
    {
        "id": 3320,
        "title": "The Orange Creamsicle - Vegan / Non-Dairy Smoothie",
        "ingredients": [
            "banana",
            "vanilla"
        ],
        "direction": [
            "Combine ingredients in blender.",
            "Blend until smooth and frothy.",
            "Serve immediately."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/20/44/95/iTh98xDTdu8BSDC24QiN_sangria.JPG"
    },
    {
        "id": 3321,
        "title": "Vegan Galaxy Doughnuts",
        "ingredients": [
            "all-purpose flour",
            "water",
            "dry active yeast",
            "water",
            "all-purpose flour",
            "all-purpose flour",
            "granulated sugar",
            "salt",
            "powdered sugar",
            "milk",
            "vanilla extract"
        ],
        "direction": [
            "¼ cup all-purpose flour.",
            "1/3 cup water.",
            "2 tsp active dried yeast.",
            "1 cup lukewarm water.",
            "4 cups plus 2 tbsp all-purpose flour.",
            "1/4 cup granulated sugar.",
            "1 tsp salt.",
            "¼ cup vegetable oil.",
            "Vegetable oil, for frying.",
            "1 cup powdered sugar.",
            "1 ½ to 2 ½ tbsp soy cream or non-dairy milk.",
            "1 tsp vanilla extract.",
            "Food gel colouring.",
            "Small sprinkles.",
            "Stir the ¼ cup of flour and 1/3 cup water together in a small pot. Place over a medium heat on the stove and cook until the mixture has thickened into a stiff paste. Remove from the heat and set aside to cool.",
            "In the bowl of a stand mixer, combine the yeast and lukewarm water. Let it stand for 10 minutes until bubbly. Add the cooled paste you made earlier, the flour, sugar, salt and vegetable oil to the bowl of the stand mixer. With the dough hook attached, knead the dough in the mixer for 6 minutes on a medium speed until smooth and elastic. Pour a little bit of oil into the bowl and turn the dough so that the oil coats the dough. Cover with a damp cloth and set aside in a warm place until doubled in volume, about 2 hours.",
            "Once risen, punch the dough down and tip out onto a floured counter. Roll out to be 1/4-inch thick and use a 3-inch round cutter (or a glass that width) to punch out circles from the dough. Use a pastry tip to cut out the centre of each circle to make the doughnut hole. Place onto a floured baking tray and cover with a damp tea towel, leave in a warm place for 30 minutes to rise.",
            "Heat ½-inch depth of vegetable oil in a deep frying pan to 350oF. Gently lower in a few dougnuts into the oil. Let fry until golden underneath then flip and let it cook until the other side is golden. Remove to a baking tray lined with kitchen paper.",
            "For the glaze, stir together the powdered sugar, vanilla extract and soy cream in a medium bowl until you get a thick but drizzleable glaze. Divide between 4 small bowls. Leave one white. Colour one a very pale blue. Colour one a dark blue/purple. Colour another pink. Dollop a few dots of the dark blue and pink glaze into the light blue glaze. Swirl a few times with a spoon just to lightly combine then drizzle in some of the white glaze. Using a swooshing motion, dip a doughnut into the glaze and place glaze-side up on a wire rack to set. Repeat with the remaining doughnuts adding more of the dark blue/pink/white glaze to the bowl as needed. Decorate with a few sprinkles or edible glitter if you’d like for extra flair."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/73/94/VlDIdGobQs2Df25UtVkq_IndulgentVegan-7056.jpg"
    },
    {
        "id": 3322,
        "title": "Vegan Ginger Cookies",
        "ingredients": [
            "flour",
            "baking soda",
            "salt",
            "ground ginger",
            "ground cinnamon",
            "ground cloves",
            "canola oil",
            "molasses",
            "soymilk",
            "sugar",
            "vanilla"
        ],
        "direction": [
            "Sift dry ingredient (except sugar) into a bowl and set aside.",
            "In a large bowl combine wet ingredients, including sugar and whisk or beat on medium until blended.",
            "Stir in the pre-sifted dry ingredients and mix until well combined.",
            "The dough will be quite sticky and you may need to dampen your hands to work with it. Roll the dough into little balls (about 1 Tablespoon) and flatten out to your liking.",
            "The thinner the cookie the crisper it will be - a slightly thicker cookie will yield a crunch on the edges and a slightly chewy interior.",
            "Press the coarse sugar onto the tops of the cookies and bake about 10 minutes at 350 on a greased cookie sheet."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/22/71/14/khqMpDc8TiQNzHJ18z9m_vegan-ginger-cookies-2.jpg"
    },
    {
        "id": 3323,
        "title": "Aloo Gobi",
        "ingredients": [
            "onion",
            "fresh coriander",
            "green chili",
            "cauliflower",
            "potatoes",
            "diced tomatoes",
            "fresh ginger",
            "fresh garlic",
            "cumin seed",
            "turmeric",
            "salt",
            "garam masala"
        ],
        "direction": [
            "Heat vegetable oil in a large saucepan.",
            "Add the chopped onion and one teaspoon of cumin seeds to the oil.",
            "Stir together and cook until onions become creamy, golden, and translucent.",
            "Add chopped coriander stalks, two teaspoons of turmeric, and one teaspoon of salt.",
            "Add chopped chillis (according to taste) Stir tomatoes into onion mixture.",
            "Add ginger and garlic; mix thoroughly.",
            "Add potatoes and cauliflower to the sauce plus a few tablespoons of water (ensuring that the mixture doesn't stick to the saucepan).",
            "Ensure that the potatoes and cauliflower are coated with the curry sauce.",
            "Cover and allow to simmer for twenty minutes (or until potatoes are cooked).",
            "Add two teaspoons of Garam Masala and stir.",
            "Sprinkle chopped coriander leaves on top of the curry.",
            "Turn off the heat, cover, and leave for as long as possible before serving."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/84/32/4/kRQt5TUcS2Sb46wPCryi_aloo%2520gobi.jpg"
    },
    {
        "id": 3324,
        "title": "Baked Vegetarian Enchiladas",
        "ingredients": [
            "corn",
            "black beans",
            "salsa",
            "firm tofu",
            "salt",
            "corn tortillas",
            "cheese",
            "sour cream"
        ],
        "direction": [
            "Grease 2 9x13 baking dishes.",
            "Combine beans, corn, salsa, tofu, and salt, mixing thoroughly.",
            "Add 1/3 to 1/2 of the cheese, and mix it in with the rest.",
            "Spoon some of the mixture into a warm tortilla and roll it up.",
            "Place the seam side in the baking dish.",
            "Pour enchilada sauce over enchiladas (I only used 1 1/2 cans).",
            "Sprinkle remaining cheese over top.",
            "Bake at 350°F.",
            "for 20 to 30 minutes.",
            "If desired, garnish each enchilada with a dollop of sour cream."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/48/97/2/tmRG3QQTuGdmCNcre8pv_untitled-4399.jpg"
    },
    {
        "id": 3325,
        "title": "Creamy Vegan Mac & Cheese",
        "ingredients": [
            "olive oil",
            "potato",
            "cashews",
            "water",
            "garlic granules",
            "nutritional yeast",
            "soy sauce",
            "mustard",
            "apple cider vinegar",
            "salt",
            "black pepper",
            "macaroni noodles"
        ],
        "direction": [
            "Heat 4 tbsp of the olive oil in a large pot over a medium-low heat. Add the onion to the pot and saute until it starts to brown slightly – about 10 minutes. Add the potato, cashews, water, smoked paprika, garlic granules, nutritional yeast, soy sauce/miso, and mustard to the pot.",
            "Bring to the boil and turn down to simmer – leave for 15 minutes so that the potatoes and cashews can soften.",
            "Pour the contents of the pot into the jug of a high-speed blender along with the apple cider vinegar and blitz until completely smooth, adding more water if needed to get the right sauce texture. Taste and season with salt and black pepper.",
            "Cook the pasta in a large pot of well-salted boiling water according to the package directions. Drain and return the pasta to the pot. Pour the sauce in and stir together – taste again and add more salt and pepper if needed. Tip into an oven-proof serving dish.",
            "Preheat your oven grill to the highest setting.",
            "Toss the breadcrumbs with the remaining 2 tbsp of olive oil and a pinch of salt. Sprinkle the breadcrumbs over the pasta. Place the pasta under the grill in the oven and let it crisp up the breadcrumbs – this will only take a couple of minutes so watch it carefully.",
            "Serve immediately."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/73/84/wpUwRrMaRQaULTFBXbB7_IndulgentVegan-6640.jpg"
    },
    {
        "id": 3326,
        "title": "Broccoli Stuffed Vidalia Onions",
        "ingredients": [
            "parmesan cheese",
            "mayonnaise",
            "lemon juice",
            "butter",
            "all-purpose flour",
            "sea salt",
            "fresh ground black pepper",
            "garlic powder",
            "milk",
            "cream cheese"
        ],
        "direction": [
            "Peel and halve the onions. Pot boil in salted water for 12 minutes. Remove centers, leaving about 3/4\" edge.",
            "s.  Place onion cups in a 13x9x2\" pan.",
            "Chop the center portions which were removed from the onions to equal about 1 cup.",
            "Cook broccoli to package directions; drain.",
            "Combine chopped onion, broccoli, Parmesan cheese, mayonnaise and lemon juice; spoon into the onion cups.",
            "Note: at this point the onions can be refrigerated until ready to bake.",
            "Melt butter; blend in the flour, salt, pepper and garlic powder(if using). Add milk and cook until thick, stirring constantly.",
            "Remove from heat and blend in softened cream cheese. Spoon sauce over the onions; bake, uncovered, at 375*F. for 20 minutes.",
            "Serve and enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/29/24/33/u3ivzGLfT9ej1NtY25gb_0S9A0618.jpg"
    },
    {
        "id": 3327,
        "title": "Banana Sorbet (Raw Food)",
        "ingredients": [
            "bananas",
            "banana"
        ],
        "direction": [
            "In a bowl, mash (or in a juicer 'puree')  the bananas.",
            "Spoon into a serving bowl, top with fresh fruit, a proper raw food granola, or nothing at all, & enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/32/79/04/rH7Ja6mQyyp71oLhmvCB_IAM_8106.jpg"
    },
    {
        "id": 3328,
        "title": "Winter Squash, Chickpea & Red Lentil Stew",
        "ingredients": [
            "dried garbanzo beans",
            "carrots",
            "onion",
            "red lentil",
            "vegetable broth",
            "tomato paste",
            "fresh ginger",
            "garlic clove",
            "cinnamon",
            "ground cumin",
            "saffron",
            "fresh ground pepper",
            "salt",
            "lime juice",
            "roasted unsalted peanuts",
            "fresh cilantro leaves",
            "lime"
        ],
        "direction": [
            "Soak chickpeas in enough cold water to cover them by 2 inches for 6 hours or overnight. (Alternatively, use the quick-soak method: Place beans in a large pot with enough water to cover by 2 inches. Bring to a boil over high heat. Remove from heat and let stand for 1 hour.) Drain when ready to use. If you like a very soft chickpea, use the quick method and let the chickpeas boil for five minutes in order to speed up the cooking process.",
            "Chef's note: Keep your squash and carrots large so that they can withstand the look cooking time without breaking down into the stew.",
            "Combine the soaked chickpeas, squash, carrots, onion, lentils, broth, tomato paste, ginger, cinnamon, cumin, salt, saffron and pepper in a 6-quart slow cooker.",
            "Put on the lid and cook on low until the chickpeas are tender and the lentils have begun to break down, about 5 1/2 to 6 1/2 hours.",
            "Chef's note: If you are planning to serve part of this as leftovers, remove that portion from the crock pot and scale the amount of lime juice accordingly.  Reserve the rest of your lime to add after reheating the leftover stew.",
            "Stir in lime juice. Season with salt to taste.",
            "Serve over rice (white or brown) sprinkled with peanuts and cilantro.",
            "Place additional lime wedges on the side for diners to add as they wish."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/21/72/44/XNMQG1pBTuiSVLf4dzvj_veggie1.jpg"
    },
    {
        "id": 3329,
        "title": "Ratatouille With Chickpeas -- Crock-Pot",
        "ingredients": [
            "onion",
            "garlic cloves",
            "eggplants",
            "basil",
            "oregano",
            "salt",
            "pepper",
            "zucchini",
            "tomato paste",
            "chickpeas",
            "tomatoes",
            "fresh basil"
        ],
        "direction": [
            "In a large skillet, heat oil over medium heat, cook onion, garlic, eggplant, basil, oregano, salt & pepper, stirring occasionally, until onion is softened, about 10 minutes.  Scrape into crockpot.",
            "Halve, core, and seed peppers; cut into 1 inch pieces.  Cut zucchini into half lengthwise, cut crosswise into 1 1/2 inch chunks.  Add to crockpot.",
            "Add tomato paste, chickpeas, and tomatoes, breaking up tomatoes with a spoon.  Cover and cook on low for 4 hours, or until vegetables are tender.  Stir in basil / parsley."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/37/38/33/BSXZBDOnSsOr0JOVVWf4_The%2520Food%2520Gays%2520-%2520Crockpot%2520Ratatouille_-2.jpg"
    },
    {
        "id": 3330,
        "title": "Thai Satay Noodles",
        "ingredients": [
            "crunchy peanut butter",
            "coconut milk",
            "soy sauce",
            "fresh ginger",
            "broccoli florets",
            "mange-touts peas",
            "garlic cloves",
            "fresh basil",
            "roasted peanuts"
        ],
        "direction": [
            "In a bowl mix the peanut butter, chilli sauce, coconut milk, vegetable stock and soy sauce to make a smooth sauce. (this can be kept in a container for up to 3 days)",
            "Heat the oil in a wok and stir fry the broccoli, red pepper, baby corn and ginger for 3 minutes Add the mange tout and garlic and cook for a further 2 minutes Pour over the satay sauce and bring to the boil.",
            "Drain the noodles or remove from pack and add to the wok. Stir fry over a high heat for a couple of minutes.",
            "Serve with the basil leaves and peanuts sprinkled over."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/20/22/44/AU2lov1lQ8O9BU2Svopb_Thai%2520Satay%2520Noodles%2520202244_final%25202.jpg"
    },
    {
        "id": 3331,
        "title": "Green & Yellow Squash 'linguini' W/ Shrimp Scampi",
        "ingredients": [
            "green zucchini",
            "large shrimp",
            "olive oil",
            "garlic cloves",
            "white wine",
            "lemon",
            "romano cheese",
            "red pepper flakes",
            "parsley",
            "basil"
        ],
        "direction": [
            "Rinse and pat dry all zucchini and squash. Remove the ends. Over a large bowl, with a vegetable peeler, peel all zucchini and squash lengthwise into linguini/pappardelle-like strips. Continue to peel until you see seeds. Discard seeded cores of zucchini and squash.",
            "Finely mince the garlic cloves. Heat a large skillet over medium-high heat. Add 1 tablespoon of the olive oil. Once oil is heated, add the \"linguini\". Sauté for about 1 minute. Add half the minced garlic, generous amounts of salt and pepper, and sauté for 1 more minute, gently stirring/folding with tongs. Remove \"linguini\" from heat and reserve.",
            "To the same skillet, add the remaining 1 tablespoon of olive oil and heat. Add the remaining garlic and stir; do not burn garlic. When garlic is lightly toasted, add the shrimp, cooking for only 1 to 2 minutes, stirring occasionally. Add the white wine and let simmer for a few seconds.",
            "Before shrimp are completely pink, add the red pepper flakes, parsley, basil and lemon juice. Add the \"linguini\", more salt and pepper and the grated cheese. Toss to combine, about 1 to 2 minutes. Transfer to a large dish and serve sprinkled with additional grated cheese and lemon wedges."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/47/11/58/xcbHanqGRVuBjofzf61Y_yellow-squash-zucchini-shrimp-scampi-8114.jpg"
    },
    {
        "id": 3332,
        "title": "Raw Kale Salad With Tahini Dressing",
        "ingredients": [
            "kale",
            "apple",
            "craisins",
            "walnuts",
            "carrot",
            "celery",
            "tahini",
            "water",
            "fresh lemon juice",
            "garlic cloves",
            "sea salt",
            "honey"
        ],
        "direction": [
            "Place all the chopped and grated veggies, nuts, and sprouts in a large bowl. Add the edamame beans and/or garbanzo beans, if using.",
            "Place tahini, water(start with less water and add more to get to desired consistency), lemon juice, garlic, salt and honey in food processor or blender. Blend until smooth. This makes about 1 cup.",
            "Add desired amount of dressing to salad and toss to mix.",
            "Enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/49/85/81/picxSxxCc.jpg"
    },
    {
        "id": 3333,
        "title": "World-Famous Low Carb Bread",
        "ingredients": [
            "bread machine yeast",
            "sugar",
            "water",
            "olive oil",
            "baking powder",
            "salt",
            "Splenda sugar substitute",
            "vital wheat gluten flour",
            "flax seed",
            "sunflower seeds",
            "flax seeds",
            "sesame seeds",
            "caraway seeds",
            "instant coffee"
        ],
        "direction": [
            "In the bread machine pan, put the water, oil, and sugar.",
            "In a separate bowl, mix all the dry ingredients and the seeds if you are using them, with the exception of the yeast and baking powder.",
            "Mix well.",
            "Take out appoximately 1/4 cup.",
            "Pour the rest of dry ingredients into the pan.",
            "Mix the reserved 1/4 cup of dry ingredients with the yeast and baking powder.",
            "Pour into the bread machine pan.",
            "On our machine, we use the three hour bake cycle.",
            "After 55 minutes, gently lift the dough out and remove the paddle and place the dough back into the machine.",
            "This way, you will not have such a large hole in your bread.",
            "If you do it on the 80 minute cycle, remove the paddle after 30 minutes.",
            "Let cool.",
            "Place in a ziploc bag in the refrigerator.",
            "This bread seems to slice better when it is nice and cold.",
            "Makes great toast.",
            "This bread is a little more\"spongey\" in texture than regular bread."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/60/59/4/xEvsMa7QiC9WSMU59dlo_low%2520carb%2520bread.JPG"
    },
    {
        "id": 3334,
        "title": "Richie's Turkey Meatloaf",
        "ingredients": [
            "quick-cooking oats",
            "nonfat milk",
            "egg",
            "chili sauce",
            "onion",
            "Worcestershire sauce",
            "ketchup"
        ],
        "direction": [
            "In small bowl combine oats and milk--let absorb about 10 minutes.",
            "Combine absorbed oats and all ingredients--except for ketchup-- in a large bowl.",
            "Mix with large fork.",
            "Spray a 9x13 baking pan with cooking spray.",
            "Shape meat mixture into loaf.",
            "Brush with ketchup.",
            "Bake at 350 for 50  minutes.",
            "Enjoy."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/21/33/59/b0Oj9e3iTai2PkpuQu1u_0S9A1397.jpg"
    },
    {
        "id": 3335,
        "title": "Israeli Shakshuka",
        "ingredients": [
            "olive oil",
            "tomatoes",
            "red bell peppers",
            "onion",
            "chopped tomatoes",
            "kosher salt",
            "black pepper",
            "eggs"
        ],
        "direction": [
            "You need a large nonstick deep sauté pan that has a cover. Sauté onions in olive oil until opaque and tender.",
            "Add red bell pepper and continue sauteeing until it softens up.",
            "Reduce heat to low. Add the fresh chopped tomatoes, cook until they are breaking apart.",
            "With a slotted spoon, add the chunkiest parts of the contents of the \"Pomi\" - the majority of the sauce should remain in the carton. Add the jalapeno now also.",
            "Cook for 30-40 minutes, partially cover, and stir every once in a while. If it starts to look dry, add some of the sauce from the carton, slowly , as you need it. Add the salt and pepper - I like a lot because I love salt on tomatoes.",
            "The final product should be a thick sauce that just looks like a whole lot of tomatoes stuck together - with very little to no juice, that is about 1-1 1/2 inches high.",
            "Crack open the eggs on top of the shakshuka, one by one, giving each their own space. The whites should overlap, but the yolk should be spaced about 4 fingerwidths from each other. My pan can fit 6-8 eggs very comfortably.",
            "Cover tightly with a lid and simmer for 20 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/28/18/77/ZyG0h2VYRjei7iPFSWNI_food.com-14.jpg"
    },
    {
        "id": 3336,
        "title": "Zucchini Lasagna (Lasagne) - Low Carb",
        "ingredients": [
            "zucchini",
            "lean ground beef",
            "onion",
            "tomatoes",
            "tomato paste",
            "garlic clove",
            "dried oregano",
            "dried basil",
            "dried thyme",
            "water",
            "pepper",
            "egg",
            "low fat cottage cheese",
            "mozzarella cheese",
            "flour"
        ],
        "direction": [
            "Cook zucchini until tender, drain and set aside. Fry meat and onions until meat is brown and onions are tender; drain fat. Add next 8 ingredients and bring to a boil.",
            "Reduce heat; simmer, uncovered 10 minutes or until reduced to 2 cups.",
            "In small bowl slightly beat egg.",
            "Add cottage cheese, half of shredded cheese and flour.",
            "In (1 1/2-qt.) baking-roasting pan arrange half of the meat mixture. Top with half of the zucchini and all the cottage cheese mixture. Top with remaining meat and zucchini.",
            "Bake uncovered at 375 degrees F for 30 minutes.",
            "Sprinkle with remaining cheese. Bake 10 minutes longer.",
            "Let stand 10 minutes before serving."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/74/9/hctvbRoQFSW9CZ4FVcin_ZL%25204%2520-%2520final_1.png"
    },
    {
        "id": 3337,
        "title": "Paleo Chocolate Chip Coconut Cookies",
        "ingredients": [
            "butter",
            "stevia",
            "egg",
            "vanilla",
            "baking soda",
            "salt",
            "chocolate chips",
            "sweetened coconut"
        ],
        "direction": [
            "Preheat oven to 375.",
            "Cream butter, stevia, and vanilla.",
            "Add almond flour, baking soda, salt, and cocoa. Carefully mix.",
            "Mix in chocolate chips and coconut. Drop by rounded tablespoons and flatten or shape as you wish, these cookies do not spread.",
            "Bake for 10-12 minutes (only until they look slightly under-done) and allow to cool on sheet for 2 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/47/39/16/picuEnmNj.jpg"
    },
    {
        "id": 3338,
        "title": "Prosciutto Breakfast Bake",
        "ingredients": [
            "prosciutto",
            "egg",
            "red capsicums",
            "red onions",
            "cracked pepper"
        ],
        "direction": [
            "Pre-heat over to 180C / 350°F.",
            "Trim excess fat from prosciutto and lay into small lightly greased ramekin dish with fat end at the bottom and other end laying out to the side.",
            "Crack egg into dish and carefully, top with diced capsicum and pepper (and onion if using) and fold prosciutto over the top.",
            "Bake for 15 minutes for fairly soft yolks, around 20 if you like them firmer.",
            "Serve over a slice of toast."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/28/10/09/nCtfAV5JQoS2yjlbUFoi_prosciutto-breakfast-bake-IMG_8918.jpg"
    },
    {
        "id": 3339,
        "title": "Sauteed Chicken With Cherry Tomatoes",
        "ingredients": [
            "extra virgin olive oil",
            "boneless skinless chicken breasts",
            "garlic cloves",
            "shallots",
            "cherry tomatoes",
            "dried oregano",
            "dry white wine",
            "salt",
            "fresh ground black pepper"
        ],
        "direction": [
            "Heat 12 inch skillet, Dutch oven or casserole with lid. Pour in oil and heat until quite hot. Line pan with a batch of chicken breasts and fry over high heat until golden brown on one side, about 2 1/2 to 3 minutes. Turn over and brown other side. Remove with tongs and continue browning remaining pieces. Set chicken aside.",
            "Reduce heat to medium, put garlic and shallots in pan, and saute until fragrant, about 15 seconds. Add oregano, white wine, salt and pepper and saute uncovered about 4 to 4 1/2 minutes, shaking pan from time to time.Add tomatoes and return chicken to pan, cover and cook about 10 to  15 minutes, or until chicken is done. Taste for seasoning and adjust if necessary.",
            "Scoop chicken out onto a platter and serve with rice or over mashed potatoes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/18/32/00/13lP5GgRsiQkyDyxIqWR_sauteed-chicken-cherry-tomatoes-1.jpg"
    },
    {
        "id": 3340,
        "title": "Vegan Paleo Vegetable Pancakes",
        "ingredients": [
            "zucchini",
            "carrot",
            "onion",
            "arrowroot",
            "garlic cloves",
            "dried basil",
            "dried parsley",
            "coconut oil",
            "green onion"
        ],
        "direction": [
            "Shred all vegetables.",
            "Mix with almond flour, starch, and seasonings.",
            "Make 8 patties.",
            "Heat a large skillet medium high and add oil to melt.",
            "Fry until golden brown on each side."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/51/08/95/vlc6cehOQFu7hDszvQCz_THE%2520FOOD%2520GAYS%2520-%2520Paleo%2520Pancake-2.jpg"
    },
    {
        "id": 3341,
        "title": "Cauliflower Grilled Cheese",
        "ingredients": [
            "rice",
            "eggs",
            "parmesan cheese",
            "kosher salt",
            "black pepper"
        ],
        "direction": [
            "Preheat an oven to 450 degrees.",
            "Add the cauliflower rice to a large microwave safe. Cover with plastic wrap and microwave for 6-8 minutes. Stir every two minutes until the cauliflower is cooked through.",
            "When cool enough to handle, place the cauliflower in a clean kitchen towel and wring out the excess liquid.",
            "To a bowl add the cooked cauliflower rice, eggs and grated parmesan cheese. Season with salt and pepper and mix until the ingredients are thoroughly combined.",
            "Lightly spray a parchment paper lined sheet tray with nonstick cooking spray.",
            "Divide the cauliflower mixture in 4. Using your hands press and shape the mixture to resemble a slice of bread. Repeat process until you have 4 slices of bread.",
            "Bake in the oven for 20 minutes until golden brown.",
            "Remove from oven and sprinkle the shredded cheddar cheese on to two pieces of the cauliflower.",
            "Using a spatula, carefully place a piece of cauliflower bread on top of each sandwich. Place back in oven and cook until the cheese has melted, about 3 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/53/15/Kl90qSWOTfqoVpILQvHP_GK-NLE-Cauliflower-Grilled-Cheese_16x9-1.jpg"
    },
    {
        "id": 3342,
        "title": "Oven-Baked Coconut Shrimp (Low-Fat)",
        "ingredients": [
            "shrimp",
            "cornstarch",
            "salt",
            "sweetened flaked coconut"
        ],
        "direction": [
            "Set oven to 375 degrees F.",
            "Rinse the shrimp under cold water and pat dry with paper towels.",
            "In a shallow dish combine the cornstarch with salt and red pepper; stir to combine.",
            "Place the egg whites in a medium bowl; beat using an electric mixer on high speed until frothy (about 2 minutes).",
            "Place the coconut in a shallow dish.",
            "Working one shrimp at a time dredge the shrimp firstly in the cornstarch mixture, then dip in egg whites and then in shredded coconut.",
            "Place the shrimp on a foil-lined baking sheet that has been generously coated with cooking spray.",
            "Repeat with remaining shrimp (cornstarch, then egg white and then in coconut).",
            "Lightly spray the shrimp with cooking spray.",
            "Bake for about 20 minutes or until the shrimp are done, turn the shrimp after 10 minutes of cooking making that 10 minutes per side."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/17/64/03/SdaI1vQcqamP469AzE0Q_IMG_6953.jpg"
    },
    {
        "id": 3343,
        "title": "Salmon and Asparagus in Foil",
        "ingredients": [
            "salmon fillets",
            "asparagus",
            "lemon",
            "fresh ground black pepper",
            "seasoning salt",
            "lemon wedge"
        ],
        "direction": [
            "Preheat oven to 450 degrees.",
            "Snap the ends off asparagus spears (they will break where tender) and divide into 4 equal portions.",
            "Spray the center of each foil sheet with non-stick cooking spray.",
            "Place one salmon fillet in the center of each sheet, top with a serving of the asparagus and drizzle with lemon juice.",
            "Sprinkle with fresh ground pepper and salt or seasoning blend as desired.",
            "Bring up the sides of foil and fold top over twice.",
            "Seal ends, leaving room for air to circulate inside the packet.",
            "Place packets on a cookie sheet and cook in oven for 15 to 18 minutes or until salmon is opaque.",
            "Serve with lemon wedges on the side.",
            "Please use caution when opening the foil packs, as the steam is very hot."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/11/38/17/GNVVmNnqTGiWAhHwDVTL_salmon-foil-packets-asparagus-02780.jpg"
    },
    {
        "id": 3344,
        "title": "Larabar Copycat (Raw Food)",
        "ingredients": [
            "dates",
            "cashews"
        ],
        "direction": [
            "Add dates to food processor and pulse until smooth.",
            "Chop cashews.",
            "Smoosh dates and cashews together until cashews are evently distributed.",
            "Form dough into into a rope.",
            "Lay a cutting board over the dough rope and press until bar shaped."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/34/77/84/picRRuHMT.jpg"
    },
    {
        "id": 3345,
        "title": "Berry Crisp - Weight Watchers Core Recipe",
        "ingredients": [
            "cherries",
            "sugar-free vanilla pudding mix",
            "cinnamon",
            "nutmeg",
            "nonfat milk",
            "old fashioned oats",
            "Splenda sugar substitute",
            "plain fat-free yogurt"
        ],
        "direction": [
            "Spray an 8X8 baking pan.",
            "Mix the fruit ingredients in the pan and stir well.",
            "In a separate bowl, mix together crisp mix.",
            "Spread this mixture over the berry mixture to make a top crust.",
            "Bake at 350°F for 40-45 minutes or until topping gets crunchy."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/20/64/91/JZawOCsSHy9xxx3Ib29G_weight-watchers-berry-crisp-8552.jpg"
    },
    {
        "id": 3346,
        "title": "Lemon Kale Chips",
        "ingredients": [
            "kale",
            "olive oil",
            "lemon juice",
            "sea salt"
        ],
        "direction": [
            "Preheat oven to 350°.",
            "Chop kale into ½ inch pieces.",
            "Place kale in a large bowl.",
            "With hands massage oil, lemon juice and salt into kale.",
            "Place kale on parchment lined baking sheet.",
            "Bake at 350° for 10-15 minutes until kale is dark green and crispy (Shauna from Gluten-Free Girl has a great Baked Kale Chips recipe on her site. She says the 12 minute mark is the perfect done time).",
            "Cool and serve."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/41/96/82/T80AEgpSIyfYoXfAWMas_DSC_0798.jpg"
    },
    {
        "id": 3347,
        "title": "Scrambled Egg Tortilla Wraps  Aust Ww 5.5 Pts",
        "ingredients": [
            "flour tortillas",
            "shallots",
            "red chile",
            "eggs",
            "skim milk",
            "fresh coriander leaves"
        ],
        "direction": [
            "Warm the tortillas following the packet instructions.",
            "Lightly spray a non-stick saucepan with olive oil.",
            "Add the shallots and chili.",
            "Cook, stirring, over a medium heat for 2 minutes or until softened.",
            "Lightly beat the eggs with the milk and season to taste.",
            "Add to the pan.",
            "Stir over medium-low heat for 3 minutes or until just set.",
            "Place the warmed tortillas on serving plates.",
            "Top with the egg mixture and sprinkle with the cheese and coriander.",
            "Roll up to serve."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/25/24/13/NCKPnXv7SsO4W43Tcc5W_DSC05695-2.jpg"
    },
    {
        "id": 3348,
        "title": "Ww 7 Points - Banana Stuffed French Toast",
        "ingredients": [
            "light cream cheese",
            "banana",
            "low-fat milk",
            "egg",
            "vanilla extract",
            "unsalted butter",
            "maple syrup",
            "fresh strawberries"
        ],
        "direction": [
            "Spread the cream cheese on all 4 slices of bread.",
            "Place the banana slices over 2 slices of the bread and top each with the remaining bread.",
            "Combine the milk, egg, and vanilla in a small shallow bowl; beat lightly with a fork.",
            "Melt the butter in a large nonstick skillet over med heat.",
            "Briefly dip the sandwiches, one at a time, into the egg mixture.",
            "Place both sandwiches in the skillet. Cook until golden brown, 3-4 min on each side.",
            "Place each piece on a plate; top each piece with 1 tbsp of the maple syrup and 3 tbsp of the sliced strawberries.",
            "7 points per serving (1 piece stuffed french toast with toppings)."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/12/73/45/doQYnugaSp6KYze5RQO5_banana%2520stuffed%2520french%2520toast%2520SITE-1.jpg"
    },
    {
        "id": 3349,
        "title": "Gluten-Free Cocoa Brownies",
        "ingredients": [
            "butter",
            "cocoa powder",
            "sugar",
            "eggs",
            "vanilla",
            "salt",
            "xanthan gum"
        ],
        "direction": [
            "Preheat oven to 350 degrees and grease an 8×8x2 pan (or a 9 x 12 pan if doubling recipe) or 12 muffin tins. (You can line the pan with parchment paper so that you can easily lift out the brownies and slice them when they are done.).",
            "Melt butter in a sauce pan or in a 1 quart container in the microwave. Remove from heat. Add cocoa until blended, then add sugar and mix well. Add eggs, one at a time. Stir in vanilla, flour, salt & xanthan gum – do not overmix.",
            "Bake 25-30 minutes (less if using muffin tins).",
            "Cool and serve."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/46/36/26/N3kcaN5ERe6YQ3s9WBrF_165%2520gluten%2520free%2520cocoa%2520brownies.jpg"
    },
    {
        "id": 3350,
        "title": "Another Shrimp Scampi",
        "ingredients": [
            "extra virgin olive oil",
            "garlic cloves",
            "red pepper flakes",
            "shrimp",
            "salt",
            "lemon juice",
            "dry white wine",
            "butter",
            "flat leaf parsley"
        ],
        "direction": [
            "Put olive oil and garlic in a large skillet over medium heat and cook slowly to infuse the oil with the garlic, but do not burn garlic.",
            "Add red pepper flakes.",
            "Raise the heat to medium high.",
            "Add shrimp and season with a little salt.",
            "Cook until shrimp is almost done.",
            "Add wine, cook until alcohol is burned off, about 1 minute.",
            "Add the lemon juice and butter to finish.",
            "Garnish with parsley."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/41/99/2/scLQ1783QQGBo9okewiC_another-shrimp-scampi-IMG_8789.jpg"
    },
    {
        "id": 3351,
        "title": "Ww  2 Points - Caramel Apple Salad",
        "ingredients": [
            "fat-free cool whip",
            "apples",
            "pineapple tidbits",
            "fat free sugar-free instant butterscotch pudding mix",
            "peanuts"
        ],
        "direction": [
            "Cut up apples into small pieces.",
            "Add in all other ingredients (pineapple juice included) and mix.",
            "Chill for 1 hour.",
            "2 Points per serving (1 cup)."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/13/28/49/r8TwUzzsTVmZpZ4YrKZX_weight-watchers-caramel-apple-salad-8525.jpg"
    },
    {
        "id": 3352,
        "title": "Creamy Shrimp Cauliflower Risotto",
        "ingredients": [
            "unsalted butter",
            "medium shrimp",
            "rice",
            "shallots",
            "garlic cloves",
            "chicken broth",
            "cream cheese",
            "parmesan cheese",
            "salt",
            "pepper",
            "nutmeg",
            "parsley",
            "lemon wedge"
        ],
        "direction": [
            "Heat a small heavy-bottomed pot over medium heat. Add 2 tablespoon butter and let melt.  Add shrimp and season with salt and pepper. Stir occasionally with a wooden spoon and cook until just cooked through, about 5-7 minutes. Transfer cooked shrimp to a plate, cover with aluminum foil and set aside.",
            "Add 3 tablespoons of butter of the pot and let melt. Add shallot and garlic and season with salt and pepper. Let cook until translucent, about 5-7 minutes. Add the cauliflower rice and cook 2-3 minutes.",
            "Add 1 cup of the chicken broth and simmer on medium high until the moisture has been absorbed by the cauliflower. Add 1/2 cup of broth and let absorb. Repeat without remaining 1/2 cup broth.",
            "Lower heat to medium and add the cream cheese, parmesan and a pinch of freshly grated nutmeg.  Stir to combine and cook for 1 minute.",
            "Add the cooked shrimp and parsley. Season with salt and pepper. Cook for 2 minutes until heated through.",
            "Garnish with more parsley and serve with lemon wedges."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/74/72/M3hXfi26QougzQUTB7gm_cauli%2520risotto%2520SITE-3.jpg"
    },
    {
        "id": 3353,
        "title": "Roasted Butternut Squash-Quinoa Veggie Burger",
        "ingredients": [
            "honey",
            "unsalted butter",
            "ground cinnamon",
            "olive oil",
            "olive oil",
            "quinoa",
            "water",
            "ground hazelnuts",
            "egg",
            "gruyere cheese",
            "butter lettuce",
            "tomatoes",
            "shallot",
            "ketchup"
        ],
        "direction": [
            "Preheat oven to 400°F Line a baking sheet with foil.",
            "In a small bowl, mix together the honey, butter, cinnamon and salt and pepper to taste.",
            "Arrange the squash on the baking sheet, cut side up, and coat the squash with the butter mixture.",
            "Roast until soft, about 40 minutes.",
            "While the squash is roasting, heat 2 teaspoons olive oil in saucepan. Add quinoa and toast lightly, about 3 minutes.",
            "Add the water. Bring to a boil. Add large pinch of salt and cover. Simmer for about 15 minutes. Let cool and fluff grains with a fork.",
            "Scoop squash flesh into a small bowl and mash lightly. Add about 2 cups of the squash to the quinoa with the hazelnuts, breadcrumbs, beaten egg, crushed red pepper and salt and pepper to taste.",
            "Cover bowl and refrigerate for 30 minutes. Form into 6 patties and refrigerate the patties for another 30 minutes.",
            "Heat remaining two tablespoons olive oil in large nonstick skillet. Cook burgers until crusted and brown, about 3 minutes per side. Melt a slice of Gruyère cheese over each burger for the last minute of cooking.",
            "Toast buns. Arrange lettuce leaf on bun bottom along with tomato slice and caramelized shallots (Recipe #408147). Top with a burger and spoonful of Piquillo Pepper Ketchup (Recipe #408089). Serve with oven fries (Recipe #408087)."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/40/80/58/NKLGGD5WTUKhvYQbszRM_butternut%2520squash%2520quinoa%2520burger-0004.jpg"
    },
    {
        "id": 3354,
        "title": "Garlic Soup That Cures What Ails You (Aka Hangover Soup)",
        "ingredients": [
            "heads of garlic",
            "whole cloves",
            "dried sage",
            "dried leaf thyme",
            "parsley",
            "pepper",
            "tomato juice",
            "alphabet pasta",
            "Garlic Bread Croûtes",
            "sharp cheddar cheese",
            "fresh parsley",
            "avocado"
        ],
        "direction": [
            "In a large stock soup pot combine the garlic, stock, cloves, sage thyme, and parsley. Bring to a boil, lower the heat to medium-low, and let simmer gently, uncovered for 45 to 60 minutes. Strain the soup, pressing down the solids with the back of a wooden spoon to extract most of the garlic from the peels. Scrape garlic purée from the underside of the strainer into the broth. Discard the garlic peels and the spent herbs.",
            "Add the tomato or V8 juice to the strained soup and bring it to a boil. Drop in the pasta and let it cook until done – 5 minutes for alphabets and 8-10 minutes for the larger shapes.",
            "Meanwhile beat the egg yolks in a small bowl.",
            "Put a croûte in each soup bowl and top with a handful of grated cheese.",
            "When the pasta is done, ladle out a little of the hot soup into the beaten egg yolks. Whisk together, and then whisk this mixture into the soup pot. The soup should thicken almost immediately. Remove the pot from the heat, and ladle the soup over the cheese-covered croûtes. Garnish each serving with a sprinkle of parsley and/or cilantro, and top with a few slices of ripe avocado. Enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/15/06/99/e9mogrJRUiUrQX3Egbqf_december%2520batch-3.jpg"
    },
    {
        "id": 3355,
        "title": "Eggplant (Aubergine) Meatballs",
        "ingredients": [
            "eggplant",
            "eggs",
            "parmesan cheese",
            "garlic powder",
            "onion powder",
            "black pepper",
            "sea salt"
        ],
        "direction": [
            "Slice eggplant and sprinkle with salt.",
            "Let sit 10 minutes to draw out water.",
            "Rinse and pat dry.",
            "Saute on stovetop with a splash of olive oil and about 1/4 cup water until eggplant is soft.",
            "Remove and chop finely.",
            "Mix everything but the breadcrumbs when eggplant is cool.",
            "Then add breadcrumbs and mix until you get the consistency you want to form the balls.",
            "Place in a generously olive oiled pan about l inch apart and bake at 400 degrees until golden brown, about 40 60 minutes.",
            "Turn halfway through baking to ensure even browning."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/23/77/5/VatnycASEqIHt8CGw0HV_0S9A0697.jpg"
    },
    {
        "id": 3356,
        "title": "Tilapia Al Ajillo (Garlic Tilapia)",
        "ingredients": [
            "garlic cloves",
            "olive oil",
            "lemon",
            "parsley"
        ],
        "direction": [
            "Season tilapia fillets with salt and pepper.",
            "Heat oil in a skillet over medium heat.",
            "Put fillets in first, and when they start to turn color a bit (after 1-2 minutes) add garlic slices.",
            "Continue cooking about 4 minutes or so, then flip fillets.",
            "Fry until cooked through, and fish flakes easily with a fork-- this will depend entirely on the thickness of your fillets, so you will need to watch them carefully.",
            "The garlic should turn a dark golden brown, but not be burned, if you notice that the garlic is starting to burn, spoon it over the fish, so it is no longer in contact with the pan.",
            "Serve with freshly squeezed lemon juice and garnish with chopped parsley."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/57/91/9/hhXOX18ZRjGnRzhvkQNB_0S9A3000.jpg"
    },
    {
        "id": 3357,
        "title": "Quinoa Crusted Chicken Fingers",
        "ingredients": [
            "boneless skinless chicken breasts",
            "salt",
            "garlic powder",
            "fresh ground black pepper",
            "paprika",
            "quinoa",
            "olive oil"
        ],
        "direction": [
            "Spread out the quinoa on a piece of wax paper or aluminum foil. Sprinkle the breadcrumbs over the quinoa. With your fingertips, squeeze the quinoa and breadcrumbs together until the moisture of the quinoa is absorbed.",
            "Sprinkle the chicken with salt, garlic powder, pepper and paprika.",
            "Place the egg whites in a shallow bowl. Dip the chicken in the egg and then into the quinoa mixture.",
            "Warm the oil in a large skillet over high heat. When the oil is hot, add the chicken and reduce the heat to medium. Cook each side 5 minutes or until the crust begins to brown and the chicken is no longer translucent (turn once).",
            "Transfer fingers to a plate and serve immediately."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/41/65/71/mWougfgSESR9RBAnnRjw_quinoa-chicken-tenders-6700.jpg"
    },
    {
        "id": 3358,
        "title": "Spaghetti Squash",
        "ingredients": [
            "spaghetti squash"
        ],
        "direction": [
            "Heat oven to 400°F (200°C). Cut squash in half lengthwise and remove seeds. Brush with oil. Place on baking sheet, cut-side down. Bake 45 minute or until tender.",
            "Use a fork to gently scrape squash into spaghetti-like strands, and discard rind. Top with sauce. Serve while warm."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/submissions/recipe/2001795471/M5XHfNTRSEyYG7CsiZp4_ecfb93ab-5309-42c7-9e83-41f0114e272b_fi.jpg"
    },
    {
        "id": 3359,
        "title": "Bruschetta Grilled Chicken Zoodle Bowl",
        "ingredients": [
            "olive oil",
            "sea salt",
            "black pepper",
            "garlic cloves",
            "fresh basil",
            "chicken breasts",
            "roma tomatoes",
            "red onion",
            "garlic cloves",
            "fresh basil",
            "extra virgin olive oil",
            "salt",
            "black pepper",
            "parmesan cheese",
            "zucchini"
        ],
        "direction": [
            "Combine 2 tbsp olive oil, balsamic vinegar, sea salt, black pepper, garlic and basil.",
            "Add to a large plastic bag with the chicken and marinate for up to 8 hours. I would recommend at least an hour.",
            "Before grilling the chicken, combine all of the tomato basil bruschetta ingredients in a medium bowl. (ingredients from the roma tomatoes, down).",
            "Place in the refrigerator until ready to serve the bowls.",
            "Remove the chicken from the marinade and place on a grill over medium heat for 10-12 minutes per side.",
            "While the chicken is grilling, add the remaining 1 tbsp olive oil to a large skillet, then add the zucchini noodles and saute 3-5 minutes.",
            "Divide the zucchini noodles between two bowls. Once the chicken is grilled, slice it up and place on top of the zoodles. Spoon the bruschetta over the chicken and zoodles."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/26/37/1rLL1GOHQiCOXPVMcHW2_bruschetta-chicken-zoodle_0929.jpg"
    },
    {
        "id": 3360,
        "title": "Smoked Salmon & Avocado Baked Eggs",
        "ingredients": [
            "avocados",
            "smoked salmon",
            "eggs",
            "salt",
            "black pepper",
            "dill"
        ],
        "direction": [
            "Preheat oven to 425 degrees F.",
            "Halve all of the avocados and remove pits.",
            "Place avocados on a baking sheet and fill the holes with strips of smoked salmon. Crack an egg into each hole, making sure the yolk remains intact. If all of the egg white doesn't fit into the hole, leave some out.",
            "Top each egg with salt and fresh black pepper.",
            "Bake eggs for 15 minutes or until whites are set.",
            "Garnish with red chili flakes and fresh dill.",
            "Serve with toast."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/03/16/YYK0OsjRQB232QrV7jKe_FN_0266134_BG_001.jpg"
    },
    {
        "id": 3361,
        "title": "Weight Watchers Parmesan Chicken Cutlets",
        "ingredients": [
            "parmesan cheese",
            "paprika",
            "dried parsley",
            "garlic powder",
            "fresh ground pepper",
            "boneless skinless chicken breast"
        ],
        "direction": [
            "Preheat oven to 400 degrees.",
            "In resealable plastic bag, combine cheese, crumbs and all seasonings; shake well.",
            "Transfer mixture to plate; dip each chicken breast in cheese mixture, turning to coat all sides.",
            "Arrange on nonstick baking sheet.",
            "Bake until chicken is cooked through, 20-25 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/18/53/42/qh75rY6tQmGTP0ytQcuD_Parmesan-Chicken-Cutlets-2.png"
    },
    {
        "id": 3362,
        "title": "Portobello Pizzas",
        "ingredients": [
            "portabella mushrooms",
            "mozzarella cheese",
            "basil leaves",
            "olive oil",
            "kosher salt",
            "black pepper"
        ],
        "direction": [
            "Preheat oven to 450 degrees. Line a baking sheet with parchment paper.",
            "Brush inside and outside of mushrooms with olive oil. Season with salt and pepper and place on prepared sheet tray with the tops down.",
            "Build the pizzas by laying tomato sauce, italian seasoning, cheese and pepperoni.",
            "Bake for 10-12 minutes until cheese has melted and the mushroom is tender. Top with basil and serve."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/53/14/OKWZ46RfTEC1e7vZf9S4_GK-NLE-Portobello-Pizzas_16x9-2.jpg"
    }
]