[
    {
        "id": 3486,
        "title": "Vegan Bacon",
        "ingredients": [
            "firm tofu",
            "nutritional yeast",
            "soya sauce",
            "liquid smoke"
        ],
        "direction": [
            "Fry tofu strips on low heat until they are crispy on the outside. The best way to do this is to lay them in the pan in the oil and let them sit for at least 10 minutes, simmering. They should turn easily after that.",
            "Turn them and give them another 10 minutes on the other side.",
            "Mix the soya sauce with the liquid smoke first, then take the pan off the heat.",
            "Pour the liquid smoke/soya sauce into the pan and stir the tofu so all sides are coated.",
            "Sprinkle the yeast over all, stir some more, over the heat, until the liquid is gone and the tofu is covered with sticky yeast."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/14/88/99/LlkHd9qlTpqOlaaYdJjy_0S9A6887.jpg"
    },
    {
        "id": 3487,
        "title": "Aloo Gobi",
        "ingredients": [
            "onion",
            "fresh coriander",
            "green chili",
            "cauliflower",
            "potatoes",
            "diced tomatoes",
            "fresh ginger",
            "fresh garlic",
            "cumin seed",
            "turmeric",
            "salt",
            "garam masala"
        ],
        "direction": [
            "Heat vegetable oil in a large saucepan.",
            "Add the chopped onion and one teaspoon of cumin seeds to the oil.",
            "Stir together and cook until onions become creamy, golden, and translucent.",
            "Add chopped coriander stalks, two teaspoons of turmeric, and one teaspoon of salt.",
            "Add chopped chillis (according to taste) Stir tomatoes into onion mixture.",
            "Add ginger and garlic; mix thoroughly.",
            "Add potatoes and cauliflower to the sauce plus a few tablespoons of water (ensuring that the mixture doesn't stick to the saucepan).",
            "Ensure that the potatoes and cauliflower are coated with the curry sauce.",
            "Cover and allow to simmer for twenty minutes (or until potatoes are cooked).",
            "Add two teaspoons of Garam Masala and stir.",
            "Sprinkle chopped coriander leaves on top of the curry.",
            "Turn off the heat, cover, and leave for as long as possible before serving."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/84/32/4/kRQt5TUcS2Sb46wPCryi_aloo%2520gobi.jpg"
    },
    {
        "id": 3488,
        "title": "5 Minute Vegan Pancakes",
        "ingredients": [
            "flour",
            "sugar",
            "baking powder",
            "salt",
            "soymilk"
        ],
        "direction": [
            "Set out all your ingredients.",
            "Set a stove element with a pan to medium heat.",
            "Combine the 4 dry ingredients (flour, sugar, baking powder -- two Tablespoons, not two Teaspoons as some have suggested, salt) in a bowl.",
            "Add the soy milk and vegetable oil to your mixture.",
            "Mix until smooth.",
            "Now the pan should be ready for your batter, so spoon one pancakes' worth of the mixture into the pan.",
            "Flip [carefully] when you see bubbles in the middle of the pancake, or if the edges are looking stiffened.",
            "Repeat until the batter is gone, and try not to eat them all while you're cooking them."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/13/22/63/D30C2lxTy6SAflQlb61Q_VP%25204%2520-%2520final_2.jpg"
    },
    {
        "id": 3489,
        "title": "Creamy Vegan Pesto Pasta With Broccoli",
        "ingredients": [
            "firm tofu",
            "raw cashews",
            "frozen chopped spinach",
            "garlic cloves",
            "olive oil",
            "salt",
            "onion",
            "water",
            "water",
            "water",
            "nutritional yeast",
            "pesto sauce",
            "head of broccoli"
        ],
        "direction": [
            "In a blender or food processor, blend cashews and 1/2 cup water until smooth.  Then add the tofu, 1 tablespoons olive oil (reserve 1 Tbsp), 3/4 cup water, vegetarian chicken seasoning, 1 1/2 Tbsp nutritional yeast, and salt, and blend until smooth and creamy.  You may want to add a tad more water if it's too thick.  Set aside.",
            "Boil pasta noodles and drain.",
            "In a large saucepan, saute the onion and garlic in the remaining 1 tablespoons olive oil until onions are clear.  Add 1/3 cup water and the vegan chicken seasoning.  If you are using fresh spinach, cook it with the onion, if using frozen spinach add it to the saucepan after the onion is clear.",
            "Once the onion, garlic, and spinach is cooked and the water has been evaporated, add the blended mixture (cashews, tofu, etc), cooked broccoli, and pesto sauce to the sauce pan.  Cook together on low for 5 minutes.",
            "Serve mixed sauce on top of cooked pasta and enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/24/14/51/gNlIFxRXQ2KhaEjVqEHB_untitled-7012.jpg"
    },
    {
        "id": 3490,
        "title": "Vegan French Toast",
        "ingredients": [
            "vanilla-flavored soymilk",
            "flour",
            "sugar",
            "nutritional yeast",
            "cinnamon"
        ],
        "direction": [
            "Mix together the first 5 ingredients.",
            "Dip a piece of bread in the mixture and cook on a skillet until it's golden-brown.",
            "Repeat until you have as many as you want."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/68/36/7/AIXhJleYSEK6PzHjrd0M_french%20toast-1.jpg"
    },
    {
        "id": 3491,
        "title": "Vegan Ginger Cookies",
        "ingredients": [
            "flour",
            "baking soda",
            "salt",
            "ground ginger",
            "ground cinnamon",
            "ground cloves",
            "canola oil",
            "molasses",
            "soymilk",
            "sugar",
            "vanilla"
        ],
        "direction": [
            "Sift dry ingredient (except sugar) into a bowl and set aside.",
            "In a large bowl combine wet ingredients, including sugar and whisk or beat on medium until blended.",
            "Stir in the pre-sifted dry ingredients and mix until well combined.",
            "The dough will be quite sticky and you may need to dampen your hands to work with it. Roll the dough into little balls (about 1 Tablespoon) and flatten out to your liking.",
            "The thinner the cookie the crisper it will be - a slightly thicker cookie will yield a crunch on the edges and a slightly chewy interior.",
            "Press the coarse sugar onto the tops of the cookies and bake about 10 minutes at 350 on a greased cookie sheet."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/22/71/14/khqMpDc8TiQNzHJ18z9m_vegan-ginger-cookies-2.jpg"
    },
    {
        "id": 3492,
        "title": "Fried Tofu",
        "ingredients": [
            "extra firm tofu",
            "tamari",
            "Red Star nutritional yeast",
            "olive oil"
        ],
        "direction": [
            "Lightly grease a non-stick pan with oil.",
            "Put tamari (soy sauce) in a bowl.",
            "In another bowl mix yeast and spices.",
            "Slice tofu into 1/4-inch slices.",
            "Dip tofu in the tamari and then in the yeast mixture.",
            "Fry until golden; flip and brown the other side.",
            "Add a bit of oil if necessary."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/10/98/6/hY9JILOTRwGi6XYdPHsc_fried%20tofu%20SITE-2.jpg"
    },
    {
        "id": 3493,
        "title": "Vegan Pesto Sauce",
        "ingredients": [
            "pine nuts",
            "garlic cloves",
            "fresh basil",
            "nutritional yeast",
            "fine sea salt",
            "pepper",
            "extra virgin olive oil"
        ],
        "direction": [
            "In food processor add one ingredient at a time and pulse to blend with some of the olive oil until all ingredients are blended together. Add more olive oil if needed. Use immediately or store in refrigerator with a little olive oil drizzled over the top to keep from browning. Serve over bow tie pasta or gnocchi. The taste of the pesto is strong enough to hold it's own when served with whole wheat pasta."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/34/45/96/MKjIWs6BR6ONACsgZeXz_VP%25204%2520-%2520final_2.jpg"
    },
    {
        "id": 3494,
        "title": "Vegan Cornbread",
        "ingredients": [
            "ground flax seeds",
            "water",
            "all-purpose flour",
            "cornmeal",
            "sugar",
            "baking powder",
            "table salt",
            "soymilk",
            "canola oil"
        ],
        "direction": [
            "Preheat oven to 425°F",
            "Spray 8-inch-square baking dish with nonstick cooking spray.",
            "Bring the water to a boil in a small saucepan.",
            "Add the ground flax seed, reduce the heat to medium-low, and simmer the ground flax seed in the water for 3 minutes or until thickened, stirring occasionally.",
            "Set aside.",
            "In a medium bowl, whisk together the flour, cornmeal, sugar, baking powder, and salt until well-combined.",
            "Add the ground flax seed mixture, soy milk, and canola oil to the flour mixture.",
            "Beat just until smooth (do not overbeat.)",
            "Turn into prepared baking pan. Bake for 20 to 25 minutes, or until a toothpick inserted in the middle comes out clean.",
            "Cool on wire rack 10 minutes; invert cornbread onto wire rack, then turn right side up and continue to cool until warm, about 10 minutes longer."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/11/59/29/u9NKOD8yROKX3l26BcPL_vegan%20cornbread%20SITE-2.jpg"
    },
    {
        "id": 3495,
        "title": "Traditional Minestrone",
        "ingredients": [
            "olive oil",
            "onions",
            "garlic cloves",
            "salt",
            "celery",
            "carrot",
            "green beans",
            "oregano",
            "fresh black pepper",
            "basil",
            "bell pepper",
            "water",
            "chickpeas",
            "dry pasta",
            "parsley",
            "parmesan cheese"
        ],
        "direction": [
            "Heat the olive oil in nonstick Dutch oven.",
            "Add onion, garlic and salt.",
            "Saute over medium heat for about 5 minutes.",
            "Add celery, carrot, green beans and seasonings.",
            "Cover and cook overy very low heat 10 minutes, stirring occasionally.",
            "Add bell pepper, water and spaghetti sauce.",
            "Cover and simmer 15 minutes.",
            "Add beans and simmer another 5 minutes.",
            "Bring to a gentle boil.",
            "Add pasta.",
            "Stir and cook until pasta is done.",
            "Serve topped with parsley and parmesan."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/22/38/50/sJVWV8jeSMSYCxbLgBPG_0S9A9436.jpg"
    },
    {
        "id": 3496,
        "title": "Tvp Vegan Sloppy Joes",
        "ingredients": [
            "onion",
            "green pepper",
            "olive oil",
            "boiling water",
            "tomato sauce",
            "chili powder",
            "pepper",
            "salt",
            "soy sauce",
            "mustard",
            "sugar"
        ],
        "direction": [
            "Saute onion and green pepper in oil.",
            "Add remaining ingredients and simmer together for 20 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/22/09/80/yGIj5bjQyeT6aj26MOlX_0S9A0971.jpg"
    },
    {
        "id": 3497,
        "title": "Easy Black Beans and Rice",
        "ingredients": [
            "olive oil",
            "onion",
            "garlic",
            "white rice",
            "vegetable broth",
            "ground cumin",
            "curry powder",
            "cayenne pepper",
            "canned black beans"
        ],
        "direction": [
            "In a stockpot over medium-high heat, heat the oil.",
            "Add the onion,pepper and garlic and saute for 4 minutes.",
            "Add the rice and saute for 2 minutes.",
            "Add the vegetable broth, bring to a boil, cover and lower the heat and cook for 20 minutes.",
            "Add the spices and black beans."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/61/72/6/fS5UENsKTVmrdxeTV5fC_0S9A7248.jpg"
    },
    {
        "id": 3498,
        "title": "Asian Pesto",
        "ingredients": [
            "garlic cloves",
            "fresh cilantro",
            "of fresh mint",
            "fresh basil",
            "water chestnuts",
            "fresh lime juice",
            "fresh ginger",
            "salt"
        ],
        "direction": [
            "In food processor, with motor running, drop garlic through the feed tube and process until finely chopped. Add cilantro, mint, and basil and pulse until coarsely chopped.",
            "Add macadamia nuts, water chestnuts, lime juice, ginger, chile and sesame oil and pulse to combine. Scrape down sides.",
            "Slowly add the sunflower oil through the feed tube and process until smooth.   Season to taste with salt."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/gk-static/gk/img/recipe-default-images/image-03.svg"
    },
    {
        "id": 3499,
        "title": "Avocado Cilantro Dip",
        "ingredients": [
            "avocados",
            "mayonnaise",
            "fresh cilantro",
            "fresh lime juice",
            "onion powder",
            "garlic powder",
            "salt",
            "cayenne"
        ],
        "direction": [
            "In food processor, combine all ingredients until smooth."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/48/57/40/pic8FQOii.jpg"
    },
    {
        "id": 3500,
        "title": "Vegan Enchilada Casserole",
        "ingredients": [
            "yellow onion",
            "garlic",
            "chili powder",
            "dried oregano",
            "dried basil",
            "diced tomatoes",
            "black beans",
            "zucchini",
            "greens",
            "corn tortillas",
            "avocado"
        ],
        "direction": [
            "1. Heat 1 tablespoon of water in a large frying pan or soup pot over medium-high heat. When the water starts to sputter, add the onion and bell pepper, and cook, stirring, for about 5 minutes. Reduce the heat to medium, and add the garlic, chili powder, oregano, and basil, and cook for 2 minutes more, adding a little water as needed to prevent sticking.",
            "2. Stir in the diced tomatoes, beans, zucchini, corn, greens, and the 4 cut-up corn tortillas, then cover and cook for 5 minutes, stirring halfway through.",
            "3. Preheat the oven to 375°F. Set aside a 9×13-inch casserole dish (you do not need to prepare it with any oil or parchment paper).",
            "4. Place 1 cup of the cooked vegetables into a blender, and blend until smooth (add a little water if the mixture is too thick to blend). Stir this back into the cooked vegetables.",
            "5. Spoon the mixture into the casserole dish, and scatter the remaining 2 cut-up corn tortillas on the top. Bake uncovered for 15 minutes. Set aside for 5 minutes before serving."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/submissions/recipe/1803495670/hgKeIhu3TgS753wO1WQR_Enchilada-Casserole-vertical-800x793.jpg"
    },
    {
        "id": 3501,
        "title": "Chef Joey's Vegan Nori Pizzas",
        "ingredients": [
            "nori",
            "avocados",
            "nutritional yeast",
            "garlic powder",
            "fresh basil leaves",
            "cherry tomatoes",
            "sweet bell pepper",
            "carrot",
            "kalamata olive",
            "vegan cheese"
        ],
        "direction": [
            "Prepare the 6 nori sheets by brushing water on 3 of the sheets and then stick one sheet on top of each of the 3 sheets on 3 separate plates.",
            "Set aside.",
            "Shred the carrot.  Shred the cheese.  Set them aside.",
            "Chop up the bell pepper, olives and tomatoes. Set aside.",
            "In a food processor combine the avocados, yeast, garlic powder, and 6 basil leaves.  Puree and then set aside.",
            "Divide the Avocado puree between the three Nori sheets.",
            "Divide each of the vegetable between each of the 3 pizzas.",
            "Top each pizza with the veggies and the shredded cheese.",
            "Chop the 6 remaining basil leaves thin and top each pizza with 1/3 of the leaves.",
            "Bon Appetit!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/31/93/15/picxcs2Xi.jpg"
    },
    {
        "id": 3502,
        "title": "Sweet Chili-Glazed Tofu With Bok Choy",
        "ingredients": [
            "firm tofu",
            "soy sauce",
            "fresh ginger",
            "cornstarch",
            "bok choy",
            "garlic cloves"
        ],
        "direction": [
            "Cut tofu planks into 2 x 1 inch pieces.  Arrange on paper towel lined plate.  Let drain 15 minutes.",
            "Whisk together chili sauce, soy sauce, ginger and 1/2 t. cornstarch in bowl.",
            "Heat 1 T. oil in large nonstick skillet over medium-high heat until just smoking.  Add bok choy stems and cook until just tender, about 3 minutes.  Add greens and cook until wilted, about 2 minutes.  Drain in colander.",
            "Add rest of oil and garlic to skillet.  Cook until garlic is golden, about 2 minutes.  Use slotted spoon to transfer garlic to paper towel-lined plate.",
            "Spread rest of cornstarch in shallow plate.  Pat tofu dry.  Season with salt and pepper.  Dredge in cornstarch, shaking off excess.  Cook tofu in garlic oil, turning occasionally, until golden, about 8 minutes.  Pour off oil from skillet.  Add chili sauce mixture and drained bok choy.  Toss to combine.  Top with garlic chips."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/42/46/84/ZgLwx2TZTCKyMNT0O0fS_untitled-4459.jpg"
    },
    {
        "id": 3503,
        "title": "Raspberry Curd",
        "ingredients": [
            "fresh raspberries",
            "firm silken tofu"
        ],
        "direction": [
            "In food process, puree raspberries until liquid. Pour puree through fine mesh strainer into a bowl, pressing hard with the back of a spoon.  Discard seeds.",
            "Stir in agave and set aside.",
            "In clean food processor, add tofu and process until smooth, scraping down sides.",
            "Add raspberry puree and pulse to incorporate.  Scrape down sides and process until mixture is a uniform ruby color. Add almond extract and pulse to combine."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/gk-static/gk/img/recipe-default-images/image-03.svg"
    },
    {
        "id": 3504,
        "title": "Sage Seasoning Blend",
        "ingredients": [
            "dried sage",
            "dried marjoram",
            "dried thyme",
            "celery seeds",
            "salt"
        ],
        "direction": [
            "In a spice grinder, combine sage, marjoram, thyme, celery seeds and salt and pulse into a ground powder."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/gk-static/gk/img/recipe-default-images/image-00.svg"
    },
    {
        "id": 3505,
        "title": "Vegan Chicken Pot Pie",
        "ingredients": [
            "all-purpose flour",
            "wheat flour",
            "salt",
            "olive oil",
            "warm water",
            "vegetable broth",
            "all-purpose flour",
            "dried basil",
            "dried oregano",
            "garlic powder",
            "salt",
            "black pepper"
        ],
        "direction": [
            "For the crust. In a large bow, mix the dry ingredients and stir with a fork, slowly drizzling in the olive oil. Then slowly add the warm water and knead by hand until you get a firm and moist dough. Form into a ball, then place it back into the bowl with a moist towel covering the top, and return to the refrigerator.",
            "The chicken. In a frying pan, brown your chicken tenders by coating the pan with a tablespoon of vegetable oil. Any non meat chicken substitute works well. When done, place on paper towel to drain. When cooled, cut into bite size chunks.",
            "The filling. Bring broth to a boil in a large saucepan, turn the heat to medium low and sift the flour in while whisking to keep from getting lumps. When all the flour is in, turn the heat off and mix in the vegetables and dry ingredients, then set to the side.",
            "Preheat oven to 400°.",
            "Time to build. Using a 9 inch pie plate, or a spring form pan, oil the pan or plate and dust with flour. Take the dough and roll out 3/4 of it to cover the pie plate. Place 1/2 of the filling into the pie, then spread the bite size chicken pieces over the top, and then add the rest of the filling. Next, roll out the remaining 1/4 portion of the dough to make the top covering, and lay it over the top. Fold the edges over and press to seal. Cut vent holes with a knife into the top, and bake at 400° for 30 to 40 minutes, or until crust is golden brown and dry to the touch. Take the pie out of the oven, and allow it set for about 5 minutes or longer to let the gravy thicken up."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/32/60/68FEGZjSRN7hmbDUg19g_Pot%2520pie%2520SITE-2.jpg"
    },
    {
        "id": 3506,
        "title": "\"cheesy\" Vegan Lasagna",
        "ingredients": [
            "carrot",
            "fresh parsley",
            "garlic cloves",
            "vegetable broth",
            "firm tofu",
            "cream cheese",
            "lemon juice",
            "nutmeg",
            "nutritional yeast"
        ],
        "direction": [
            "Slice carrots and steam, set aside.  Saute parsley and garlic for 1 minute in an oiled pan.  Add carrots and veggie broth; simmer uncovered for 5 minutes.  Add tofu, vegan cream cheese, and lemon juice; stir well.  Cook over medium heat stirring constantly until \"cheese\" starts to melt.  Stir in nutmeg and nutritional yeast.  Remove from heat; keep warm.",
            "Place 3 lasagna noodles in bottom of 11x7 baking dish. Layer carrot mixture, noodles, tomato sauce and spinach until done.  Top with spaghetti sauce.  Cover and bake 15 minutes at 375 degrees.  Uncover and bake an additional 30 minutes until thoroughly heated."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/27/90/52/YPfRBedHQRm6TmVkNwaE_0S9A1539.jpg"
    },
    {
        "id": 3507,
        "title": "Vegan Thai Pizza",
        "ingredients": [
            "carrot",
            "mushroom",
            "tomatoes",
            "onion",
            "green onion top"
        ],
        "direction": [
            "Preheat oven to 375.",
            "Spread warmed peanut sauce on flatbread or pre-baked crust.",
            "Layer remaining vegetables on peanut sauce covered crust.",
            "Top with green onions, salt & pepper.",
            "Bake for 12-14 minutes until crust starts to crisp up and brown."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/51/88/40/1aLgOYZATH2PpheGfHBQ_Vegan%2520Thai%2520Pizza.JPG"
    },
    {
        "id": 3508,
        "title": "Creamy Basil and Sun-Dried Tomato Vegan Pasta",
        "ingredients": [
            "whole wheat pasta",
            "sun-dried tomatoes",
            "firm silken tofu",
            "garlic cloves",
            "fresh basil",
            "salt",
            "broccoli"
        ],
        "direction": [
            "Cook pasta.",
            "While pasta is cooking, blend tomatoes, tofu, garlic, basil, and salt in a food processor or blender until smooth.",
            "Set aside.",
            "When pasta is almost done, add broccoli to pasta water and cook for an additional 3 minutes.",
            "Drain and return pasta/broccoli to pot.",
            "Add sauce and toss well.",
            "Serve immediately."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/21/77/34/picHmCXFR.jpg"
    },
    {
        "id": 3509,
        "title": "5 Minute Easy Vegan \" Chicken\" Guacamole Tacos",
        "ingredients": [
            "avocado",
            "garlic clove",
            "onion",
            "vegetarian chicken pieces",
            "tomatoes",
            "salt",
            "lemon juice"
        ],
        "direction": [
            "Combine avacado, salt, lemon juice, garlic, and onion. Mush into a paste.",
            "Microwave nuggets for 1 minute and then chop.",
            "Fill shells with guacamole, 'chicken', and top with tomatoes!",
            "Serve with whatever you like (salsa, etc).",
            "Enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/21/62/76/picGdPy4U.jpg"
    },
    {
        "id": 3510,
        "title": "Vegan Lasagne",
        "ingredients": [
            "olive oil",
            "broth",
            "celery ribs",
            "garlic cloves",
            "onions",
            "mushrooms",
            "vegetable bouillon cubes",
            "fresh thyme",
            "fresh rosemary",
            "plum tomatoes",
            "tomato paste",
            "dry lasagna noodles",
            "soya milk",
            "cornstarch",
            "nutritional yeast",
            "vegan parmesan cheese"
        ],
        "direction": [
            "Fry the onions for five minutes.  Add the celery for two minutes, add the mushrooms and then the garlic and fry gently for a further 5 minutes. add in the fake ground mincemeat anc cook for  a couple of minute.",
            "Add the broth and simmer gently and then add the plum tomatoes.  Squish them a bit so they are not all whole but crushed.  Add the tomato paste, the herbs and stock cubes.",
            "Bring to the boil and simmer gently for 5 - ten minutes.",
            "Preheat your oven to gas mark 7.",
            "Place your lasagne sheets in dish.  Add a little olive oil and some boiling water to cover and let the pasta soak for ten minutes.",
            "Add the gravy granules to the veggie bolognaise, frying in the pan (which should thicken it slightly).",
            "Tip the water away from the pasta and begin layering the tomato bologanise with the pasta starting with sauce and ending with the sauce.",
            "In another pan, whisk the soya milk with the cornflour adding a little butter if desired as well as the nutritional yeast, stirring constantly. Bring gently to the boil whereupon it should thicken.",
            "Pour this mixture over the layers of tomato sauce and pasta and  sprinkle over the fake parmesan; salt and pepper to taste.",
            "Bake in the oven at gas mark 7 for 30-35 minutes.",
            "Eat it--it's gorgeous."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/29/02/42/picpGHIuX.jpg"
    },
    {
        "id": 3511,
        "title": "Quick Vegan Pesto Alfredo Sauce",
        "ingredients": [
            "water",
            "firm tofu",
            "cashews",
            "black pepper",
            "olive oil",
            "nutritional yeast",
            "poultry seasoning",
            "pesto sauce"
        ],
        "direction": [
            "Blend all ingredients together in a blender.",
            "Heat to a boil on the stove while stirring constantly.",
            "Serve on top of cooked pasta and enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/24/66/16/picPbpWSW.jpg"
    },
    {
        "id": 3512,
        "title": "Vegan Cheesy Rice & Cabbage Casserole",
        "ingredients": [
            "cabbage",
            "diced tomatoes",
            "nutritional yeast",
            "sausage",
            "canola oil",
            "brown rice",
            "garlic",
            "baby portabella mushrooms",
            "carrot",
            "salt",
            "pepper",
            "cayenne pepper",
            "oregano"
        ],
        "direction": [
            "Chop ½ of a head of cabbage up into thin strips and place (uncooked) in the bottom of a lightly greased casserole dish.",
            "Sautee mushrooms, garlic, cayenne pepper, oregano & sausage in the Braggs amino acids on medium-high heat until the mushrooms start to soften. Layer on top of the cabbage.",
            "Layer ½ cup nacho cheese on top of the mushrooms/sausage mixture.",
            "In same pan, add canola oil and the onion. Add salt to taste. Cook until onions are translucent.  Add it on top of the cheese layer.",
            "Mix the nutritional yeast with the rice, and then layer the rice on top of the onions.",
            "On top of the rice, layer the entire shaved carrot.",
            "On the carrot, layer the fire roasted tomatoes.",
            "Add the bread crumbs on top of the tomatoes.",
            "Add the rest of the nacho cheese, spread evenly, on top of the bread crumbs.  Sprinkle with salt & pepper.",
            "Cook at 350 for 55 minutes; then broil for 5 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/42/43/22/picxRJ472.jpg"
    },
    {
        "id": 3513,
        "title": "Vegan Breakfast Sausages",
        "ingredients": [
            "vital wheat gluten",
            "nutritional yeast",
            "chickpea flour",
            "onion powder",
            "fennel seed",
            "pepper",
            "paprika",
            "cayenne",
            "oregano",
            "sea salt",
            "allspice",
            "garlic powder",
            "water",
            "vegan worcestershire sauce",
            "olive oil",
            "soy sauce"
        ],
        "direction": [
            "Combine all dry ingredients in a large bowl.",
            "In separate bowl whisk all the wet ingredients.",
            "Stir the wet into dry and mix lightly until combined and spongy dough forms.",
            "Form 1/4 to 1/3 cup of dough at a time into a small log about 6 inches long. INDIVIDUALLY wrap in aluminum foil (tightly, twisting the ends at the top and bottom like sausage casings. If they aren't wrapped tight enough they will burst out.",
            "When they are all wrapped up arrange them into a steamer basket over boiling water, and steam for 30 minutes.",
            "Cool, and remove from foil. Keeps in the fridge for up to a week. I freeze mine and take out as needed.",
            "What you have here when you're done is equal to raw sausage! Is isn't done yet! :)  I like to saute it in a little oil in a cast iron skillet. It also crumbles up swell for tofu scrambles etc. Or slices for sausage and peppers. Sometimes after I unwrap these I immediately throw them in the oven with a little oil for another 10-15 minutes to crisp up the \"skin\".",
            "Note - I don't have a steamer. I use a strainer fitted over the top of a pot making sure the bottom of the strainer doesn't touch the water in the bottom of the pot. Then cover with a lid."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/45/64/46/WTBlzVRTL3fLVAc6dISw_IMG_2711.JPG"
    },
    {
        "id": 3514,
        "title": "Healthy Vegan Chili",
        "ingredients": [
            "boiling water",
            "onion",
            "green pepper",
            "orange bell pepper",
            "garlic",
            "water",
            "kidney beans",
            "whole tomatoes",
            "fresh corn",
            "chili powder",
            "dried oregano",
            "ground cumin",
            "salt",
            "pepper",
            "cayenne"
        ],
        "direction": [
            "Pour the boiling water over the TVP and let stand until softened.",
            "Braise the onion, bell peppers and garlic in water until onion is clear, then add remaining ingredients, including TVP.",
            "Simmer for at least 30 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/27/12/5/h0Z9nwBQh2LvbhPhWxId_vegetarian%2520chili.JPG"
    },
    {
        "id": 3515,
        "title": "Skillet Gardener's Pie - Vegan",
        "ingredients": [
            "yukon gold potatoes",
            "soymilk",
            "onion",
            "garlic cloves",
            "carrots",
            "celery ribs",
            "mushrooms",
            "kidney beans",
            "green beans",
            "thyme",
            "fresh rosemary",
            "sage",
            "cornstarch",
            "water",
            "rosemary"
        ],
        "direction": [
            "Scrub the potatoes and cut them into cubes. (I leave mine unpeeled, but if you want you can peel them before dicing.) Place potatoes in a large pot and cover with water. Bring to a boil and simmer until potatoes are tender. Reserve a cup of their cooking water, if possible, and drain. Place in a large bowl, add the soymilk, and mash until smooth, adding a little of the potato-cooking water if they seem too dry. Add salt and freshly ground pepper to taste and set aside in a warm place.",
            "While the potatoes are cooking, make the \"pie\" filling. Spray a large non-stick or cast iron skillet with canola oil. Heat it on a medium-high burner and add the onions. Sauté until onions are translucent. Add the garlic, carrots, celery, and mushrooms, and sauté for 3 more minutes.",
            "Add the vegetable broth, kidney beans, green beans, and herbs. Simmer on medium heat for 20 minutes and all vegetables are tender. Add salt and pepper to taste (I added a little hickory smoke salt). There should still be some liquid in the pan, but if it has become too dry, add a little of the potato-cooking water. Add the spinach and stir until it's completely wilted. Mix the corn starch with the water until smooth, and add it to the pan. Cook, stirring, until mixture has thickened.",
            "Spoon the potatoes evenly over the top of the filling and sprinkle with chopped rosemary. If potatoes have cooled, put the skillet under the broiler for a minute or two. Serve immediately while hot.",
            "http://blog.fatfreevegan.com/2008/05/skillet-gardeners-pie.html."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/32/70/55/pic976gIU.jpg"
    },
    {
        "id": 3516,
        "title": "Quick, Buttercream (Vegan) Icing from Longmeadow Farm",
        "ingredients": [
            "confectioners' sugar",
            "vanilla-flavored soymilk",
            "vegan butter",
            "vanilla extract"
        ],
        "direction": [
            "In mixer, cream together sugar, butter, soy milk, and vanilla.",
            "Beat until completely creamy and spreadable.",
            "Add 1/4 teaspoon more milk, if *drizzling* is desired, instead of spreading."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/21/94/54/swjJtEToS7eoRFMdRcwH_vegan%2520icing.JPG"
    },
    {
        "id": 3517,
        "title": "Banana Nut Muffins - Vegan",
        "ingredients": [
            "whole wheat flour",
            "sugar",
            "baking powder",
            "baking soda",
            "salt",
            "walnuts",
            "bananas",
            "canola oil",
            "vanilla extract"
        ],
        "direction": [
            "Preheat oven to 375 degrees F/190 degrees Celsius  In a large bowl mix together the first 7 ingredients.",
            "In a smaller bowl, mash up the bananas quite well then add in the oil, vanilla and milk.",
            "Combine the banana mixture with the flour mixture and blend until \"just\" mixed.",
            "Spoon into a lightly oiled muffin tin and bake for 15-20 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/44/13/20/pic8UsrZf.jpg"
    },
    {
        "id": 3518,
        "title": "Vegetarian / Vegan Meatloaf",
        "ingredients": [
            "walnuts",
            "celery ribs",
            "yellow onion",
            "garlic cloves",
            "firm tofu",
            "rolled oats",
            "soy sauce",
            "poultry seasoning",
            "Dijon mustard",
            "ketchup",
            "nutritional yeast"
        ],
        "direction": [
            "Preheat oven to 350.",
            "Grind walnuts in food processor to a powder and set aside.",
            "Reconstitute soy granules in hot water or vegetable broth according to package directions.",
            "Coat medium skillet with cooking spray and place over medium heat.",
            "Add chopped celery and onion and garlic and saute 4-5 minutes or until tender and remove from heat.",
            "Mash drained tofu in large bowl.",
            "Mix in walnuts, vegetables, drained soy granules, oats, soy sauce, nutritional yeast, mustard and poultry seasoning and ketchup - salt and pepper to taste.",
            "Coat 9x5 inch loaf pan with cooking spray and spoon mixture into pan and press.",
            "Spread a layer of ketchup or barbecue sauce over this, if you like.",
            "Bake 55-60 minutes or until inserted knife comes clean."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/36/34/90/PPN1UxVRMa5bA5pn2ye6_20150626_170814_001.jpg"
    },
    {
        "id": 3519,
        "title": "Barley Vegetable Soup",
        "ingredients": [
            "pearl barley",
            "canola oil",
            "onions",
            "carrot",
            "celery",
            "mushroom",
            "salt",
            "fresh parsley"
        ],
        "direction": [
            "In a saucepan, combine the barley and 3 cups of vegetable stock.",
            "Bring to a boil over medium heat, cover, and simmer for 1 hour, or until the liquid is absorbed.",
            "Meanwhile, heat the olive oil in a large pot and add the onion, carrots, celery, and mushrooms.",
            "Cover and cook the vegetables for about 5 minutes, until they begin to soften.",
            "Add the remaining vegetable stock and simmer 30 minutes, covered.",
            "Add the barley and simmer 5 minutes more.",
            "Add salt to taste and ladle into bowls.",
            "Serve garnished with chopped fresh parsley."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/54/12/0/picqT9lnT.jpg"
    },
    {
        "id": 3520,
        "title": "Vegan Veggie Lasagna",
        "ingredients": [
            "tomato sauce",
            "extra firm tofu",
            "soymilk",
            "dried oregano",
            "dried basil",
            "salt",
            "lemon juice",
            "garlic cloves",
            "onion",
            "spinach",
            "olive oil",
            "fresh mushrooms",
            "zucchini",
            "carrots",
            "tomato sauce",
            "water"
        ],
        "direction": [
            "Preheat over to 350 degrees.",
            "In a blender or food processor, combine the tofu, soy milk, oregano, basil, salt, lemon juice, garlic, and onion. Blend until the mixture has the consistency of ricotta cheese.",
            "Stir in the chopped spinach and set aside.",
            "In a large saucepan, saute the red pepper, mushrooms, zucchini, carrots in the oil until crisp-tender. (Feel free to add any other veggies that you like. I just use the ones listed as a starting point.).",
            "Stir in the tomato sauce and water.",
            "Bring to boil, then cover, reduce heat and simmer for 30 minutes, stirring occasionally. (If you find that the veggie mix is too thin, uncover for last 5 minutes.).",
            "Cover bottom of lasagna pan with 1/2 cup tomato sauce.",
            "Layer with lasagne noodles, trimming to fit, if needed.",
            "Cover with a layer of 1/2 the tofu mixture, then layer of noodles, then layer of 1/2 the veggie mixture, then layer of noodles, then remaining tofu mixture, another layer of noodles, and then top with the remaining veggie mixture.",
            "Bake, uncovered for 30-35 minutes. Remove from oven and let stand 5-10 minutes before cutting and serving."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/11/55/53/YZZVqX2TQGw761CUKhqp_untitled-4343.jpg"
    },
    {
        "id": 3521,
        "title": "Vegan/Vegetarian Sausage Patties",
        "ingredients": [
            "boiling water",
            "whole wheat flour",
            "flax seed meal",
            "nutritional yeast",
            "garlic powder",
            "sage",
            "ground fennel",
            "black pepper",
            "cayenne",
            "water",
            "liquid smoke",
            "soy sauce",
            "maple syrup",
            "blackstrap molasses"
        ],
        "direction": [
            "Stir together tvp and boiling water and set aside to soak for 5 minutes.",
            "Meanwhile, mix flour, flax, bran, and dry spices; stir to incorporate. Stir in tvp.  In a measuring cup, measure out water; add liquid smoke directly to the cup and stir, if using (this way the smoke will be evenly distributed). Stir in other liquid ingredients, then add wet to dry; mix well. With your hands, form mixture into 2\" balls and flatten slightly into patties.",
            "Fry in oil in an uncovered frying pan on medium heat, about 2 minutes per side (or until browned).",
            "Freeze leftovers (if you have any) and microwave 1-2 minutes to enjoy on busy weekday mornings."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/38/03/98/picHVGkql.jpg"
    },
    {
        "id": 3522,
        "title": "Cheezy Popcorn(Vegan)",
        "ingredients": [
            "olive oil flavored cooking spray",
            "nutritional yeast",
            "chili powder",
            "salt",
            "garlic powder",
            "onion powder"
        ],
        "direction": [
            "Place warm popcorn in a large bowl and mist it with olive oil. Toss gently and mist again. Repeat until all kernels are lightly coated with oil.",
            "Combine remaining ingredients in a zippered plastic bag. Seal bag and shake until well mixed.",
            "Drop in popcorn, a little at a time, seal bag, and shake and turn bag to coat.",
            "Continue to add a little amount of popcorn to the bag until all kernels are well coated.",
            "Store zippered bag. Shake gently again before serving."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/32/03/44/pic1Hwg9E.jpg"
    },
    {
        "id": 3523,
        "title": "Vegan Chocolate Chip Bars",
        "ingredients": [
            "flour",
            "baking powder",
            "baking soda",
            "salt",
            "sugar",
            "vanilla extract",
            "soymilk",
            "semisweet vegan chocolate chips"
        ],
        "direction": [
            "Preheat oven to 350°F",
            "In a large bowl, stir together the flour, baking powder, baking soda, salt and sugar.",
            "Add the oil, vanilla, milk and chocolate chips and mix together gently.",
            "Pour mixture into a lightly oiled 9x13 inch pan and bake for 25-30 minutes.",
            "Test with a toothpick for doneness.",
            "Let cool 10 minutes before cutting into bars."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/28/01/93/picy1YAd5.jpg"
    },
    {
        "id": 3524,
        "title": "Mini Vegan Wellingtons",
        "ingredients": [
            "walnuts",
            "cooked brown rice",
            "canned chick-peas",
            "sage",
            "marjoram",
            "onion powder",
            "thyme",
            "soy sauce",
            "Dijon mustard",
            "peanut butter",
            "puff pastry",
            "olive oil"
        ],
        "direction": [
            "Line two baking sheets with parchment paper, spray with non-stick spray and set aside.",
            "Have a small bowl of water and a clean, floured pastry board ready.",
            "Chop walnut (food processor makes it easy) into very small bits. Scrape into large bowl.",
            "Chop brown rice and chickpeas in food processor until mixture forms a coarse mash. Add this to the mixing bowl along with oat bran, spices, soy sauce, mustard and peanut butter. Knead together until it holds its shape.",
            "Unfold the first sheet of puff pastry and roll into a 12x12 square. Cut into six rectangles about 6x4.",
            "Scoop up a handful of the nut loaf mixture and form it into a small rectangular loaf (about 3x1x3/4 inches). Place in the center of a puff pastry. Dip your fingers in the water and lightly wet the top of the loaf.",
            "Fold the short ends of the pastry over the loaf, then fold up the long edges using some water to seal it shut.",
            "Place the mini Wellington seam side down on the prepared baking sheet. Repeat with the other 5.",
            "Bake at 400F for 25 minutes. The crust should be puffed and golden and the inside heated through.",
            "The Wellingtons can be made ahead and refrigerated until it's time to bake."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/36/87/17/piczi8a1k.jpg"
    },
    {
        "id": 3525,
        "title": "Really Easy Vegan Gravy or Cheese Sauce",
        "ingredients": [
            "vegetable broth",
            "nutritional yeast",
            "cornstarch"
        ],
        "direction": [
            "Heat up the broth.",
            "Take a little of the hot liquid and put in bowl.",
            "Whisk in cornstarch, set aside.",
            "Pour nutritional yeast and spices into hot liquid, stirring until dissolved.",
            "Add cornstarch mixture and cook until as thick as you desire. This only takes a few minutes.",
            "Add salt and pepper to taste.",
            "Tis is great over baked potatoes, vegetables, rice, noodles. Enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/20/45/81/picrq1AYd.jpg"
    },
    {
        "id": 3526,
        "title": "Spicy, Low-Fat Veggie Burgers (Vegan, Gluten-Free, Soy-Free",
        "ingredients": [
            "onion",
            "bell pepper",
            "flax seed",
            "carrots",
            "celery",
            "garlic cloves",
            "fresh parsley",
            "olive oil",
            "soy sauce",
            "tomato paste",
            "dried oregano",
            "dried basil",
            "chili powder",
            "curry powder",
            "fresh ground black pepper"
        ],
        "direction": [
            "Preheat oven to 350 degrees F.",
            "Squeeze grated onion and bell pepper in a paper towel to remove excess moisture.",
            "Mash most of the lentils.",
            "Combine all of the ingredients.  Your hands are the best tool.",
            "For best flavor, allow the ingredients to marry by letting the mixture sit, covered, at room temperature for an hour.",
            "Use a 1/3-  or 1/2-cup measuring cup to scoop the mixture.  Pack tightly into cup then invert onto greased baking sheet for a total of 6 scoops, leaving lots of room in between.  Smash each scoop into a patty shape using your hands or other flat surface.",
            "Bake for 25 to 30 minutes, flipping halfway through.  Be VERY CAREFUL when you flip them, as they are still rather delicate.",
            "Serve with whole-grain buns and all the condiments."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/38/20/92/picIbpHat.jpg"
    },
    {
        "id": 3527,
        "title": "Almond 'feta Cheese' Spread With Herb Oil (Vegan)",
        "ingredients": [
            "lemon juice",
            "olive oil",
            "olive oil",
            "garlic clove",
            "salt",
            "fresh thyme leave",
            "fresh rosemary leaf"
        ],
        "direction": [
            "Place almonds in medium bowl and cover with 3 inches of water. Let soak 24 hours. Drain and rinse.",
            "Puree almonds, lemon juice, 3 T olive oil, garlic, salt and 1/2 cup water in blender or food processor for 6 minutes or until really creamy.",
            "Place a triple layer of cheesecloth in strainer and spoon almond mixture onto cheesecloth. Bring sides together twist into an orange-sized ball and secure with a twist tie. Chill for 12 hours.",
            "Line baking sheet with parchment and transfer almond ball from cheesecloth. Shape to look like a 6\" round of brie (about 3/4\" thick). (Note, I just put it into a pretty pottery bowl and baked it. Then I could pour the oil on top and serve it. No parchment needed.).",
            "Bake 40 minutes or until top is slightly firm.  Cool. Then chill.",
            "Combine 1/4 cup olive oil with herbs and heat over medium low heat until heated through but not simmering.  Cool to room temperature and drizzle over almond spread just before serving.",
            "Spread on crusty bread or crakers. You'll love it!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/36/47/32/picaq8a2w.jpg"
    },
    {
        "id": 3528,
        "title": "Vegan Caesar Salad Dressing",
        "ingredients": [
            "Dijon mustard",
            "nutritional yeast flakes",
            "garlic cloves",
            "water",
            "lemon juice",
            "soy sauce",
            "olive oil",
            "white pepper"
        ],
        "direction": [
            "In a small bowl, combine the mustard, nutritional yeast, almonds, and garlic. Make a paste.",
            "*Whisk in the water, lemon juice, soy sauce, olive oil and white pepper.",
            "*I prefer to blend the ingredients together in a mini-blender or using a hand-held immersion blender for a creamier consistency.",
            "Refrigerate until ready to serve. Adjust seasonings if necessary."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/14/31/26/pic0Qofp5.jpg"
    },
    {
        "id": 3529,
        "title": "Winter Squash, Chickpea & Red Lentil Stew",
        "ingredients": [
            "dried garbanzo beans",
            "carrots",
            "onion",
            "red lentil",
            "vegetable broth",
            "tomato paste",
            "fresh ginger",
            "garlic clove",
            "cinnamon",
            "ground cumin",
            "saffron",
            "fresh ground pepper",
            "salt",
            "lime juice",
            "roasted unsalted peanuts",
            "fresh cilantro leaves",
            "lime"
        ],
        "direction": [
            "Soak chickpeas in enough cold water to cover them by 2 inches for 6 hours or overnight. (Alternatively, use the quick-soak method: Place beans in a large pot with enough water to cover by 2 inches. Bring to a boil over high heat. Remove from heat and let stand for 1 hour.) Drain when ready to use. If you like a very soft chickpea, use the quick method and let the chickpeas boil for five minutes in order to speed up the cooking process.",
            "Chef's note: Keep your squash and carrots large so that they can withstand the look cooking time without breaking down into the stew.",
            "Combine the soaked chickpeas, squash, carrots, onion, lentils, broth, tomato paste, ginger, cinnamon, cumin, salt, saffron and pepper in a 6-quart slow cooker.",
            "Put on the lid and cook on low until the chickpeas are tender and the lentils have begun to break down, about 5 1/2 to 6 1/2 hours.",
            "Chef's note: If you are planning to serve part of this as leftovers, remove that portion from the crock pot and scale the amount of lime juice accordingly.  Reserve the rest of your lime to add after reheating the leftover stew.",
            "Stir in lime juice. Season with salt to taste.",
            "Serve over rice (white or brown) sprinkled with peanuts and cilantro.",
            "Place additional lime wedges on the side for diners to add as they wish."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/21/72/44/XNMQG1pBTuiSVLf4dzvj_veggie1.jpg"
    },
    {
        "id": 3530,
        "title": "Swedish \"meat\" Balls With Gravy (Vegan)",
        "ingredients": [
            "plain soymilk",
            "vegetable broth",
            "onion",
            "dried parsley flakes",
            "garlic powder",
            "nutmeg",
            "sea salt",
            "black pepper",
            "vegetable broth",
            "canola oil",
            "button mushrooms",
            "cornstarch",
            "vegetable broth",
            "nutritional yeast",
            "nutmeg"
        ],
        "direction": [
            "In a medium bowl combine the breadcrumbs with the soy or rice milk.  Set aside.  Heat up the vegetable broth in a pyrex measuring cup and then add in the dry TVP.  Mix together well and let the TVP absorb for a few minutes.  While that sits, dice up your onion.",
            "Mix together the breadcrumb mixture with the TVP, about 2 tbsp of the onion. the parlsey flakes, garlic powder, nutmeg, salt and pepper.  Adjust the salt to taste as it will really depend on how seasoned your veggie broth is.  You want the mixture to hold together when formed into a ball in your hand - you may need to add a little extra broth, maybe a few tablespoons.  I find pushing down with the spoon as you mix helps to combine everything.  Form into balls, 1 1/2 inches in diameter (should yield 12).",
            "Heat up the oil in a saute pan, add in the \"meat\" balls and brown on all sides as best you can.  When complete, place them into a casserole dish and set aside.",
            "Put your oven on to 350 degrees.",
            "Clean out your saute pan of any bits and then return to medium heat.  Saute the rest of the onion and the mushrooms for about 5 minutes until the onions are translucent.",
            "In a bowl whisk together 1/3 cup soy creamer (or more if you choose) with the corn starch.  Mix in 1 1/2 cups veggie broth, or less if you're using more creamer, along with the nutritional yeast and a pinch of nutmeg.",
            "Pour the broth mixture into the pan with mushrooms & onions, bring up to a gentle boil, stirring well to get a smooth sauce.  Turn heat down and let it simmer for just a few minutes. Add in some braggs for flavour or colour if you choose.",
            "Pour the gravy over the meatballs and bake in the oven for about 20 minutes until bubbly.  Serve over noodles or mashed potatoes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/42/67/98/gn6UPPP2STu4QmW3HtqB_mba1.jpg"
    },
    {
        "id": 3531,
        "title": "The Orange Creamsicle - Vegan / Non-Dairy Smoothie",
        "ingredients": [
            "banana",
            "vanilla"
        ],
        "direction": [
            "Combine ingredients in blender.",
            "Blend until smooth and frothy.",
            "Serve immediately."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/20/44/95/iTh98xDTdu8BSDC24QiN_sangria.JPG"
    },
    {
        "id": 3532,
        "title": "Red Velvet Cupcakes With Cream Cheese Frosting (Vegan)",
        "ingredients": [
            "soymilk",
            "apple cider vinegar",
            "all-purpose flour",
            "granulated sugar",
            "cocoa powder",
            "baking powder",
            "baking soda",
            "salt",
            "canola oil",
            "vanilla extract",
            "margarine",
            "vegan cream cheese",
            "powdered sugar",
            "vanilla extract"
        ],
        "direction": [
            "Preheat oven to 350 degrees and line muffin pans with liners.",
            "Whisk together the soy milk and vinegar and set aside to curdle.",
            "Sift the flour, sugar, cocoa, baking powder, baking soda, and salt into a large bowl and mix.",
            "Add the oil, food coloring, chocolate extract, Vanilla extract and almond extract to the curdled soy milk. Whisk well to combine.",
            "Make well in center of dry ingredients and gently fold wet ingredients into dry, mixing until large lumps disappear.",
            "Do not over mix, oryour cupcakes will turn out gummy - small lumps are okay.",
            "Fill cupcake liners about three-quarters full as these cupcakes will rise fairly high.",
            "Place in hot oven and bake 18-20 minutes until done, or until toothpick inserted in cetner comes out clean.",
            "Cool cupcakes in the pan for five mintues, and then transfer to a cooling rack or surface to cool completely.",
            "Using a hand mixer, cream together margarine and cream cheese until just combined, then whip in the powdered sugar in 1/2 cup batches.",
            "Scrape down the sides and mix until smooth and creamy.",
            "Mix in the vanilla.",
            "Keep tightly covered and refrigerated until ready to use."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/41/25/78/picmbk4Cp.jpg"
    },
    {
        "id": 3533,
        "title": "Vegan Speedy Alfredo Style Sauce (No Tofu)",
        "ingredients": [
            "soymilk",
            "raw cashews",
            "nutritional yeast",
            "tahini",
            "fresh lemon juice",
            "Dijon mustard",
            "paprika",
            "nutmeg",
            "fresh garlic cloves",
            "black pepper"
        ],
        "direction": [
            "Add all the ingredients to a blender and blend until smooth.  I used my \"Magic Bullet\" and it worked just fine.  Depending on your blender or processor, you might have some cashew lumps, which you can always strain out if you want to.",
            "Heat gently and toss with steamed broccoli or cooked pasta -- or anything you like!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/40/32/82/qqU7IiM3Q7ibrLvfuLLM_pasta%2520alfredo.JPG"
    },
    {
        "id": 3534,
        "title": "Vegan Green Bean Casserole",
        "ingredients": [
            "soymilk",
            "mushrooms",
            "cornstarch",
            "garlic powder",
            "fresh ground black pepper"
        ],
        "direction": [
            "Preheat the oven to 350 degrees.",
            "In a pot over medium-high heat, add 2c of the soy milk, the sliced mushrooms, garlic, and black pepper.  Slowly bring to a boil and reduce the heat to a simmer.  Dissolve the corn starch into the remaining ½c of soy milk and add to the pot.  Stir well for 5 minutes and remove from the heat.",
            "Drain the beans and pour them into a casserole dish.  Add about 1c of the onions to the beans, as well as the soy milk mixture and toss.  Place in the oven for 35-45 minutes, top with the rest of the onions, and cook for a few more minutes until the onions are brown.  Let the casserole sit for 10-15 minutes to set and cool."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/24/42/44/Spti1XtxRlaMLrBP5lOw_DSC03953-2.jpg"
    },
    {
        "id": 3535,
        "title": "Vegan Cauliflower \"Chicken\"",
        "ingredients": [
            "cauliflower",
            "nutritional yeast",
            "all-purpose flour",
            "salt",
            "cayenne pepper",
            "white pepper",
            "onion powder",
            "garlic powder",
            "paprika",
            "ground flax seeds",
            "Dijon mustard"
        ],
        "direction": [
            "Preheat oil for frying in a large dutch oven or fryer. It should be around 350 degrees F.",
            "In another bowl combine the ground flax seed with 1/4 cup of water.",
            "In a medium size mixing bowl combine the flour, salt, cayenne pepper, white pepper, onion powder, garlic powder, paprika, Old Bay, and nutritional yeast.",
            "Into the bowl with the flax “egg” add the hot sauce and dijon mustard and whisk until creamy.",
            "Use one hand to carefully dip a cauliflower floret into the wet mixture, then drop it into the flour mixture and use your other dry hand to coat it completely.",
            "Dip it back into the flax mixture, and again into the dry mixture (remember to keep one hand for wet dredging and the other for dry).",
            "Carefully lower the twice coated cauliflower into the hot oil. Repeat with remaining cauliflower until you can’t fit any more into the pot.",
            "Cook for about 4-5 minutes, until the pieces are golden.",
            "Transfer fried cauliflower to a large plate covered with paper towel to absorb excess oil.",
            "Continue to cook the remaining cauliflower.",
            "Serve hot."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/11/67/iYOsru8RRvCc5WmzVZPM_untitled-9216.jpg"
    }
]