[
    {
        "id": 3536,
        "title": "Tofu Tso's for  Average Joes",
        "ingredients": [
            "extra firm tofu",
            "eggs",
            "water",
            "vegetarian chicken bouillon granules",
            "cornstarch",
            "rice wine",
            "sugar",
            "soy sauce",
            "cornstarch",
            "garlic clove"
        ],
        "direction": [
            "Open box of tofu carefully, and put tofu on cutting board.",
            "Slice lengthwise into 4 equal portions, and lay flat on a double-thickness of towel(or, I like unused clean cloth diapers--they absorb really well, without lint), place another double-thickness on top, and place a baking sheet on top of all, and weigh down with something heavy, like a book, or baby, or something.",
            "Let it sit, and if you want to change the towels, even better.  Give it about 20 minutes.",
            "Cut the pieces into 3/4 inch cubes, about the size of dice.",
            "Beat the eggs and water together.",
            "Place cornstarch and bullion powder in another bowl, and stir together.",
            "Heat about 2-3 inches of oil to about 350 degrees.",
            "Dip pieces of tofu into the egg, then dust heavily with the cornstarch, and carefully place 5-6 pieces in the oil at a time--you don't want to change the temp of the oil too drastically by putting in too many, and you don't want them to stick together by crowding them.",
            "Fry until brown and crispy, about 2 minutes, depending.",
            "Drain in a colander.",
            "Repeat process until done.",
            "This can be done a couple of hours in advance, but don't seal the container while hot, because they'll get soggy.",
            "I just cover with a paper towel.",
            "Now, for the sauce, mix the rice wine, sugar, soy sauce, cornstarch (2tsp)--I usually shake them together in a jar)  Feel free to double sauce to taste--it works fine.",
            "Add a tbsp oil to a skillet, heat, and stir fry the garlic until aromatic, but not burned.",
            "Toss tofu in the oil, stir around to heat and crisp a little more, then add the sauce mixture into the pan, and stir to coat tofu, and let thicken--about 1 minute.",
            "Serve hot, over rice, preferably."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/18/11/20/AUqFqHS1WZ9rzOicJAdB_THE%2520FOOD%2520GAYS%2520-%2520General%2520Tso%2527s%2520Tofu.jpg"
    },
    {
        "id": 3537,
        "title": "Nif's Baconless Pasta Carbonara With Breadcrumbs",
        "ingredients": [
            "linguine",
            "olive oil",
            "butter",
            "garlic cloves",
            "eggs",
            "milk",
            "parmesan cheese",
            "fresh parsley"
        ],
        "direction": [
            "Boil pasta in salted water for 1 minute less than the package states.",
            "Meanwhile, heat 1 tablespoon oil and the butter in a large frying pan over medium heat.",
            "Add garlic and breadcrumbs and stir occasionally until everything smells delicious, about 5 minutes.",
            "Remove breadcrumb mixture from the pan and set aside.",
            "In a bowl, stir together eggs,milk and Parmesan cheese.",
            "Pour 1 tablespoon olive oil in pan over medium heat.",
            "When pasta is done, strain (do NOT rinse) and add to frying pan.",
            "Stir to coat with oil and then add egg mixture.",
            "Stir to coat pasta and then stir every minute or so for about 4 minutes, until eggs are mostly cooked.",
            "Stir in breadcrumbs.",
            "Salt and pepper to taste.",
            "Pour into serving dish and top with optional garnish."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/46/30/36/picxFnm6y.jpg"
    },
    {
        "id": 3538,
        "title": "Mexican Noodle Bake (Meatless)",
        "ingredients": [
            "onion",
            "green pepper",
            "celery",
            "black beans",
            "red kidney beans",
            "tomato sauce",
            "diced tomatoes",
            "elbow macaroni",
            "cheddar cheese"
        ],
        "direction": [
            "Cook macaroni according to package directions, drain and rinse in cold water, set aside.",
            "In a large skillet, saute onion, pepper and celery in oil until softened.",
            "Stir in taco seasoning, beans, tomatoes and tomato sauce.",
            "Simmer for 10 minutes.",
            "Remove from heat and stir in cooked noodles.",
            "Spread mixture in a 9 x 13 pan. (or, put in gallon ziploc bag and freeze--write baking instructions on the bag, then when you are ready to eat it, thaw in warm water for about 10 minutes, put in pan and bake).",
            "Bake, uncovered at 375 for 45 minutes.",
            "Sprinkle cheese on top and bake five more minutes or until cheese is melted."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/38/19/43/nfgGM0NQTSIRioNs0x6e_The%2520Food%2520Gays%2520-%2520Vegetable%2520Pasta-3.jpg"
    },
    {
        "id": 3539,
        "title": "Lentil Sloppy Joes",
        "ingredients": [
            "lentils",
            "lager beer",
            "olive oil",
            "yellow onion",
            "green pepper",
            "garlic cloves",
            "chili powder",
            "ground mustard",
            "fire-roasted tomatoes",
            "tomato paste",
            "apple cider vinegar",
            "maple syrup",
            "sea salt",
            "black pepper"
        ],
        "direction": [
            "Put the lentils in a small sauce pot and pour in 4 cups beer. Cover and bring to a boil. Once boiling, lower heat and simmer for about 20 minutes, until lentils are soft. Drain and set aside.",
            "About 10 minutes before the lentils are done boiling, preheat a medium sauce pan pot over medium heat. Saute the onion and pepper in the oil (~ 7 minutes), until softened.",
            "Add the garlic and saute a minute more.",
            "Add the cooked lentils, and the the rest of the spices (except the maple syrup & dried mustard). Stir gently until just combined.",
            "Add the tomato sauce and tomato paste. Cook for about 10 minutes.",
            "Add the maple syrup and mustard and heat through.",
            "Turn the heat off and let sit for about 10 minutes, so that the flavors can meld, or go ahead and eat immediately if you can’t wait. I like to serve these open faced, with a scoop of sloppy joe on each slice of the bun."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/submissions/recipe/1802581412/ymAwifhxTuG61rRMOwRR_Lentil%2520Sloppy%2520Joes%25204-850x.jpg"
    },
    {
        "id": 3540,
        "title": "Broccoli Stuffed Vidalia Onions",
        "ingredients": [
            "parmesan cheese",
            "mayonnaise",
            "lemon juice",
            "butter",
            "all-purpose flour",
            "sea salt",
            "fresh ground black pepper",
            "garlic powder",
            "milk",
            "cream cheese"
        ],
        "direction": [
            "Peel and halve the onions. Pot boil in salted water for 12 minutes. Remove centers, leaving about 3/4\" edge.",
            "s.  Place onion cups in a 13x9x2\" pan.",
            "Chop the center portions which were removed from the onions to equal about 1 cup.",
            "Cook broccoli to package directions; drain.",
            "Combine chopped onion, broccoli, Parmesan cheese, mayonnaise and lemon juice; spoon into the onion cups.",
            "Note: at this point the onions can be refrigerated until ready to bake.",
            "Melt butter; blend in the flour, salt, pepper and garlic powder(if using). Add milk and cook until thick, stirring constantly.",
            "Remove from heat and blend in softened cream cheese. Spoon sauce over the onions; bake, uncovered, at 375*F. for 20 minutes.",
            "Serve and enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/29/24/33/u3ivzGLfT9ej1NtY25gb_0S9A0618.jpg"
    },
    {
        "id": 3541,
        "title": "Falafel",
        "ingredients": [
            "scallions",
            "garlic",
            "fresh cilantro",
            "of fresh mint",
            "chickpeas",
            "ground cumin",
            "baking powder",
            "sea salt",
            "Tabasco sauce",
            "olive oil",
            "lettuce",
            "chopped tomato",
            "onion",
            "plain low-fat yogurt",
            "garlic",
            "fresh lemon juice",
            "kirby cucumber",
            "sea salt",
            "pepper"
        ],
        "direction": [
            "To make Herbed Cucumber Yogurt: Add all yogurt ingredients to a mixing bowl; whisk to combine; cover and chill until ready to serve.",
            "To make Falafel: Add the scallions, garlic, cilantro, and mint to the container of a food processor; pulse until mixture is finely chopped.",
            "Add the chickpeas, breadcrumbs, cumin, baking powder, salt, and Tabasco; continue to pulse until the batter has the consistency of cooked oatmeal.",
            "Lightly oil hands and form mixture into 4 burger shaped patties.",
            "Spray each patty lightly with cooking spray.",
            "Let the olive oil get hot (but not smoking) in a large skillet over medium heat.",
            "Fry patties for about 4 minutes on each side or until golden brown and crisp.",
            "Transfer cooked patties to a paper-towel lined plate.",
            "Put cooked patty into warmed pita pocket with shredded lettuce, chopped tomatoes, and sliced onions.",
            "Serve with Herbed Cucumber Yogurt."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/10/15/25/0nDDrWSYKdsqxAfpbd7w_falafel2.jpg"
    },
    {
        "id": 3542,
        "title": "Sweetie Pie's Mac and Cheese",
        "ingredients": [
            "evaporated milk",
            "eggs",
            "sour cream",
            "butter",
            "colby cheese",
            "monterey jack cheese",
            "sharp cheddar cheese",
            "Velveeta cheese",
            "salt",
            "pepper",
            "sugar",
            "American cheese"
        ],
        "direction": [
            "Preheat oven to 350°C.",
            "Put pasta in 9 by 13 dish and set aside.",
            "Mix milks and eggs well.",
            "Add the butter, sour cream and colby, Montery jack, sharp cheddar and velveeta cheeses to the pasta.",
            "Pour milk and egg mixture over the pasta.",
            "Season with salt , pepper, sugar and toss.",
            "Sprinkle with remaining cups of American or Cheddar cheese.",
            "Bake for 30 to 45 minutes or untill top is lightly browned."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/44/93/78/yI5ynhw6TbSIDAdOR68g_mac%20and%20cheese-2.jpg"
    },
    {
        "id": 3543,
        "title": "Veggie Burger",
        "ingredients": [
            "kidney beans",
            "rolled oats",
            "mushroom",
            "onion",
            "carrot",
            "red bell pepper",
            "garlic",
            "tomato paste",
            "salt",
            "pepper"
        ],
        "direction": [
            "Throw all ingredients in food processor (or blender, if you dont have one).",
            "Pulse (or blend) until coarsely chopped.",
            "Chill mixture, then shape into four (4) 1/2-inch thick patties.",
            "Now you can wrap and freeze them for later.",
            "To cook, thaw patties in microwave, then broil 4-6 inches from heat for 10 to 15 minutes (or until warm in the middle).",
            "You can do this in your broiler or on the grill.",
            "Serve like you do your favorite meat patties!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/10/49/77/7kLZKqlOTPyMW1jCb8Vt_0S9A2565.jpg"
    },
    {
        "id": 3544,
        "title": "Aloo Gobi",
        "ingredients": [
            "onion",
            "fresh coriander",
            "green chili",
            "cauliflower",
            "potatoes",
            "diced tomatoes",
            "fresh ginger",
            "fresh garlic",
            "cumin seed",
            "turmeric",
            "salt",
            "garam masala"
        ],
        "direction": [
            "Heat vegetable oil in a large saucepan.",
            "Add the chopped onion and one teaspoon of cumin seeds to the oil.",
            "Stir together and cook until onions become creamy, golden, and translucent.",
            "Add chopped coriander stalks, two teaspoons of turmeric, and one teaspoon of salt.",
            "Add chopped chillis (according to taste) Stir tomatoes into onion mixture.",
            "Add ginger and garlic; mix thoroughly.",
            "Add potatoes and cauliflower to the sauce plus a few tablespoons of water (ensuring that the mixture doesn't stick to the saucepan).",
            "Ensure that the potatoes and cauliflower are coated with the curry sauce.",
            "Cover and allow to simmer for twenty minutes (or until potatoes are cooked).",
            "Add two teaspoons of Garam Masala and stir.",
            "Sprinkle chopped coriander leaves on top of the curry.",
            "Turn off the heat, cover, and leave for as long as possible before serving."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/84/32/4/kRQt5TUcS2Sb46wPCryi_aloo%2520gobi.jpg"
    },
    {
        "id": 3545,
        "title": "Vegetarian Paella",
        "ingredients": [
            "saffron",
            "eggplant",
            "olive oil",
            "onion",
            "garlic cloves",
            "red bell pepper",
            "paprika",
            "arborio rice",
            "vegetable broth",
            "diced tomatoes",
            "mushroom",
            "green beans",
            "chickpeas"
        ],
        "direction": [
            "Pour 3 tablespoons water over saffron in a small bowl and set aside.",
            "Sprinkle salt over the eggplant chunks and let stand in a colander for 30 minutes. Rinse and drain.",
            "Heat the oil in a large frying pan and saute the onion, garlic, peppers and eggplant for 5 minutes.  Sprinkle with paprika and toss.",
            "Add the rice, then incorporate the vegetable stock, tomatoes, saffron and season with salt and pepper to taste.",
            "Bring to a boil and simmer for 15 minutes, uncovered, stirring frequently.",
            "Fold in the mushrooms, green beans and chickpeas.",
            "Cook for another 15 minutes and serve immediately."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/17/59/08/cFxVjPNoQkqM49xQ4My4_The%2520Food%2520Gays%2520-%2520Vegetarian%2520Paella-3.jpg"
    },
    {
        "id": 3546,
        "title": "Baked Vegetarian Enchiladas",
        "ingredients": [
            "corn",
            "black beans",
            "salsa",
            "firm tofu",
            "salt",
            "corn tortillas",
            "cheese",
            "sour cream"
        ],
        "direction": [
            "Grease 2 9x13 baking dishes.",
            "Combine beans, corn, salsa, tofu, and salt, mixing thoroughly.",
            "Add 1/3 to 1/2 of the cheese, and mix it in with the rest.",
            "Spoon some of the mixture into a warm tortilla and roll it up.",
            "Place the seam side in the baking dish.",
            "Pour enchilada sauce over enchiladas (I only used 1 1/2 cans).",
            "Sprinkle remaining cheese over top.",
            "Bake at 350°F.",
            "for 20 to 30 minutes.",
            "If desired, garnish each enchilada with a dollop of sour cream."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/48/97/2/tmRG3QQTuGdmCNcre8pv_untitled-4399.jpg"
    },
    {
        "id": 3547,
        "title": "Thai Satay Noodles",
        "ingredients": [
            "crunchy peanut butter",
            "coconut milk",
            "soy sauce",
            "fresh ginger",
            "broccoli florets",
            "mange-touts peas",
            "garlic cloves",
            "fresh basil",
            "roasted peanuts"
        ],
        "direction": [
            "In a bowl mix the peanut butter, chilli sauce, coconut milk, vegetable stock and soy sauce to make a smooth sauce. (this can be kept in a container for up to 3 days)",
            "Heat the oil in a wok and stir fry the broccoli, red pepper, baby corn and ginger for 3 minutes Add the mange tout and garlic and cook for a further 2 minutes Pour over the satay sauce and bring to the boil.",
            "Drain the noodles or remove from pack and add to the wok. Stir fry over a high heat for a couple of minutes.",
            "Serve with the basil leaves and peanuts sprinkled over."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/20/22/44/AU2lov1lQ8O9BU2Svopb_Thai%2520Satay%2520Noodles%2520202244_final%25202.jpg"
    },
    {
        "id": 3548,
        "title": "7-Layer Party Dip Torta",
        "ingredients": [
            "flour",
            "heavy cream",
            "eggs",
            "sugar",
            "sesame seeds",
            "sour cream",
            "salsa",
            "lettuce leaves",
            "mozzarella cheese",
            "red onion"
        ],
        "direction": [
            "Combine flour, cream, 2 eggs, yeast, salt, and sugar in the bowl.  Using a stand mixer fitted with a paddle attachment by adding ingredients and mixing on medium speed until a homogenous dough comes together.",
            "Transfer dough to a large mixing bowl, cover tightly with plastic wrap, and let rise at room temperature until about 1 1/2 times its original size, about 2-4 hours.",
            "Lightly flour dough and transfer to a floured work surface. Form into a large ball approx 9\". Transfer the dough ball to a parchment-lined rimmed baking sheet, tucking the seam underneath. Cover with plastic wrap weighted down with a kitchen towel and set aside at room temperature for 1 hour.",
            "Preheat oven to 450°F When ready to bake, beat remaining egg with 1 tablespoon of water. Brush egg mixture on top of each bun until evenly coated. Sprinkle with sesame seeds.",
            "Bake until deep golden brown, 12 to 15 minutes.",
            "Cut the roll in half; remove some of the bread on the bottom portion.",
            "Add a layer of refried beans, sour cream, guacamole, salsa, lettuce, mozzarella cheese, and pickled red onion."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/59/94/hhubKwcPQKyhXbAaoDlr_5244168_GK_GeniusObsessions_7-Layer-Dip-Party-Torta_16x9_v3_H.jpg"
    },
    {
        "id": 3549,
        "title": "Rustic Tuscan Bean Soup",
        "ingredients": [
            "cannellini beans",
            "chopped tomatoes",
            "celery ribs",
            "onion",
            "carrot",
            "garlic cloves",
            "cabbage leaves",
            "kale",
            "thyme leaves",
            "sage leaves",
            "olive oil",
            "water",
            "vegetarian bouillon powder"
        ],
        "direction": [
            "Sweat the Carrot, Onion, Celery and Garlic in the Olive Oil for a few minutes. Add a small pinch of Sea Salt at this stage.",
            "Next add the Tomatoes, Sage, Thyme, Water and Stock powder and season with a little fresh ground Pepper.",
            "Stir in the Cabbage and Kale, cover and simmer for 15 to 20 minutes or until the vegetables are cooked through but still remain vibrant in colour.",
            "Add the Beans towards the end and just heat them through in the soup."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/46/88/61/picIZevVY.jpg"
    },
    {
        "id": 3550,
        "title": "Vegetarian Lasagna",
        "ingredients": [
            "carrot",
            "oregano",
            "ricotta cheese",
            "frozen chopped spinach",
            "eggs",
            "zucchini",
            "fresh mushrooms",
            "part-skim mozzarella cheese",
            "parmesan cheese"
        ],
        "direction": [
            "Mix carrots, oregano, and spaghetti sauce together.",
            "Mix Ricotta, spinach, and eggs together in separate bowl.",
            "Spread ½ cup spaghetti sauce in bottom of 9 x 13 inch baking dish.",
            "Layer 3 lasagna noodles, ½ remaining sauce, ½ Ricotta mixture, ½ sliced zucchini, ½ sliced mushrooms, ½ Mozzarella, and ½ Parmesan.",
            "Repeat layers with remaining ingredients.",
            "Bake in 350 degrees oven for about 45 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/14/68/4/UKqGooweTWUyUquB1wCF_0S9A7786.jpg"
    },
    {
        "id": 3551,
        "title": "Uncle Bill's Vegetarian Minestrone Soup",
        "ingredients": [
            "extra virgin olive oil",
            "onion",
            "water",
            "zucchini",
            "carrot",
            "cannellini beans",
            "celery",
            "dried basil",
            "dried oregano",
            "salt",
            "fresh coarse ground black pepper",
            "canned plum tomatoes",
            "garlic cloves",
            "elbow macaroni"
        ],
        "direction": [
            "Heat oil in a large saucepan over medium-high heat.",
            "Add chopped onion and sauté for 4 minutes or until just lightly browned.",
            "Add water, zucchini, carrots, canellini beans, celery, basil, oregano salt, pepper, tomatoes and garlic.",
            "Bring to boil; reduce heat, cover and simmer on medium-low heat for 25 minutes, stirring occasionally.",
            "Add macaroni, cover and cook an additional 10 minutes.",
            "Adjust spices to suit your taste.",
            "Serve hot."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/81/41/9/5NCEPV5HSYqzfE5p4FyB_The%2520Food%2520Gays%2520-%2520Soup-3.jpg"
    },
    {
        "id": 3552,
        "title": "Rich and Creamy Artichoke Casserole",
        "ingredients": [
            "artichoke hearts",
            "mayonnaise",
            "parmesan cheese",
            "garlic clove",
            "black pepper"
        ],
        "direction": [
            "Preheat oven to 350°F.",
            "Combine mayonnaise, parmesan, garlic and pepper well; add artichoke hearts and mix.",
            "Pour into small greased casserole dish and bake at 350F for 10 minutes.",
            "Top with french fried onions and bake an additional 5 minutes, or until lightly browned."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/35/77/39/Y0XStgpYQPyttytRa6xA_untitled-4318.jpg"
    },
    {
        "id": 3553,
        "title": "Baked Stuffed Pasta Shells",
        "ingredients": [
            "jumbo pasta shells",
            "mozzarella cheese",
            "parmesan cheese",
            "ricotta cheese",
            "eggs",
            "nutmeg",
            "black pepper",
            "garlic powder",
            "dried parsley",
            "fresh basil"
        ],
        "direction": [
            "In an 8 quart pot, bring water to a boil and cook shells for 8 minutes or until al dente.",
            "Drain and cool immediately with cold water.",
            "Drain and place open side down on paper towels.",
            "In a medium bowl, combine the rest of ingredients except the spaghetti sauce.",
            "Reserve the 1/4 cup of Mozzarella.",
            "Place a thin layer of spaghetti sauce into the bottom of a 12 x 9 x 2 inch baking dish.",
            "Preheat oven to 375 degrees Fahrenheit.",
            "Spoon the cheese mixture into each pasta shell and place open side up, in a single layer, in prepared pan.",
            "Pour the rest of sauce over the stuffed shells.",
            "Loosely cover with foil and bake for 40 minutes.",
            "During last 5 minutes of baking, remove foil and sprinkle remaining Mozzarella cheese on top.",
            "Bake 5 more minutes.",
            "Garnish with fresh chopped basil."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/10/66/18/732WWU1oR1ywcQ845cmu_SBS%25204%2520-%2520final_2.jpg"
    },
    {
        "id": 3554,
        "title": "Curried Chickpeas and Black Beans-Low Fat",
        "ingredients": [
            "olive oil",
            "onion",
            "ginger",
            "curry powder",
            "diced tomatoes",
            "salt",
            "black beans",
            "chickpeas",
            "fresh cilantro",
            "fresh lemon juice"
        ],
        "direction": [
            "Heat oil in a large, non-stick skillet over medium heat.",
            "Add onion and ginger and saute about 3 minutes, or until tender.",
            "Add curry powder and stir to coat onions evenly.",
            "Add tomatoes with their juices and cook 1-2 minutes or until mixture seems slightly thickened, stirring well.",
            "Add black beans, chickpeas and salt to taste.",
            "Stir to coat beans evenly.",
            "Cover, reduce heat and simmer for about 5 minutes or until chickpeas are heated through.",
            "Turn off heat, and stir in fresh cilantro (or parsley), and lemon juice.",
            "Serve warm.",
            "This dish goes nicely over some jasmine or basmati rice."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/73/67/9/picwnwCs5.jpg"
    },
    {
        "id": 3555,
        "title": "Torta Salata Di Farro - Savory Farro Pie",
        "ingredients": [
            "fresh ricotta",
            "eggs",
            "parmigiano",
            "parsley",
            "nutmeg",
            "butter"
        ],
        "direction": [
            "Preheat oven to 370 degrees F (180 C).",
            "Prepare the farro: Wash it well, picking out impurities such as bits of chaff, pebbles, or bad grains.  In a medium saucepan, combine the farro with about 4 cups water and 2 teaspoons salt,  then turn heat to high and bring it all to a boil.",
            "When it has come to a boil, reduce the temperature to medium low, cover, and let simmer until the farro is tender, about 30 minutes.",
            "Remove from heat, drain mixture well, then pour it all into a large ceramic or porcelain bowl and set aside to let cool.",
            "When cooled, combine it with the remaining ingredients except the butter and the bread crumbs.",
            "Use the butter and bread crumbs to lightly grease and coat a 9-inch pan, pour the farro mixture into it, and bake it in a 370 F (180C) oven for about 40 minutes.",
            "This will work well as a second course, with a tossed salad.",
            "Recipe adapted from Giada De Laurentiis' method of cooking farro and from a recipe in Luciano Migliolli's \"Il Farro e le sue Ricette.\"  Farro: Grain of the Legions Grano Farro has a long and glorious history - it is the original grain from which all others derive, and fed the Mediterranean and Near Eastern populations for thousands of years; somewhat more recently it was the standard ration of the Roman Legions that expanded throughout the Western World.  Ground into a paste and cooked, it was also the primary ingredient in plus, the polenta eaten for centuries by the Roman poor."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/35/43/pic5MclgH.jpg"
    },
    {
        "id": 3556,
        "title": "Italian Eggplant Ragout",
        "ingredients": [
            "eggplants",
            "salt",
            "olive oil",
            "onion",
            "garlic cloves",
            "diced tomatoes",
            "chickpeas",
            "capers",
            "sugar",
            "parsley"
        ],
        "direction": [
            "Scoop out center and seeds of eggplant halves. Cut eggplants into 3/4 inch dice. Toss with salt in bowl and let it stand for at least 20 minutes. Drain off the fluid that collects, rinse well, and pat dry.",
            "Heat olive oil in large saucepan over medium heat. Add onion, and saute until softened (about 5 minutes.) Add garlic, and cook 1 minute more, or until fragrant. Stir in tomatoes, chickpeas, and eggplants. Reduce heat to medium-low, and cook 15 minutes, or until eggplants are tender but not mushy.",
            "Stir in capers and sugar, and cook 2 minutes more. Fold in parsley, and season with black pepper."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/31/69/25/L92erLJgQyKI08cQIbLo_0S9A1291.jpg"
    },
    {
        "id": 3557,
        "title": "Vegetarian Black Bean Chili",
        "ingredients": [
            "sweet onions",
            "canola oil",
            "mushroom",
            "green pepper",
            "garlic cloves",
            "black beans",
            "diced tomatoes",
            "tomato sauce",
            "tomato paste",
            "brown sugar",
            "chili powder",
            "ground cumin"
        ],
        "direction": [
            "In a large pot, saute onions in oil for 5 minutes.",
            "Add mushrooms, peppers, and garlic; saute 5-6 minutes, until vegetables are crisp-tender.",
            "Stir in remaining ingredients; bring to a boil. Reduce heat; cover and simmer 20-25 minutes, until heated through."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/20/38/77/01482547262.jpeg"
    },
    {
        "id": 3558,
        "title": "Southwestern Quinoa Burrito",
        "ingredients": [
            "quinoa",
            "vegetable broth",
            "red kidney beans",
            "water",
            "garlic",
            "nutritional yeast",
            "water",
            "tortillas",
            "avocado",
            "salsa",
            "water",
            "mayonnaise",
            "cumin",
            "pure maple syrup",
            "lime juice",
            "chili powder"
        ],
        "direction": [
            "Add dry, unwashed quinoa to a large dry skillet. Toast until fragrant, stirring occasionally. Add veggie broth and bring to a boil. Cover, lower heat, and simmer until tender (about 15 minutes).",
            "Add beans, water, garlic, nutritional yeast, salt & pepper.  Cover, and heat over low flame until beans are warmed through. Add more water if needed to keep the quinoa from sticking.",
            "In an oven or toaster oven, lightly toast 2 tortillas until warm and slightly crispy.",
            "Make the sauce: Add all sauce ingredients to a blender and process until sauce is smooth.",
            "Plate. Divide quinoa/bean mixture in half, and place half the filling inside each tortilla. Roll up or fold tortillas in half. Drizzle with southwestern sauce and chopped avocados."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/42/79/27/pickbykWC.jpg"
    },
    {
        "id": 3559,
        "title": "Spicy Stuffed Bell Peppers (Vegetarian/Vegan/Gluten-Free)",
        "ingredients": [
            "bell peppers",
            "olive oil",
            "onion",
            "garlic cloves",
            "carrots",
            "brown rice",
            "lentils",
            "vegetable broth",
            "garam masala",
            "soy sauce",
            "corn",
            "tomato paste",
            "ketchup"
        ],
        "direction": [
            "Sautee onion, jalapeno, and garlic in oil until onion just starts to turn clear.  Add carrots and cook another minute or two.  Add rice, lentils, and liquid.  Turn heat up to high.  Stir in garam masala and 1 tablespoon of the Braggs.  Bring to a boil.  Then cover and reduce heat.  Simmer for 40-50 minutes or until rice and lentils are tender.",
            "Meanwhile, preheat oven to 350 degrees.  Cut tops off of bell peppers and clean seeds out from inside.  Submerge in boiling water for 3-5 minutes.  Place in a shallow baking dish.",
            "Mix tomato paste, remaining Braggs, and ketchup in a small bowl.  Add a little warm water to thin to the consistency of a thick sauce.",
            "When lentil/rice mixture is cooked, stir in corn and peas.  Scoop mixture into bell peppers.  Spoon tomato sauce on top of each and bake for about 20 minutes or until peppers are slightly tender and tomato sauce is dark."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/38/11/41/t13Ea0RYRfuPxlB2UWlF_untitled-4366.jpg"
    },
    {
        "id": 3560,
        "title": "Cauliflower-Potato Curry",
        "ingredients": [
            "water",
            "water",
            "cauliflower",
            "sweet onion",
            "garlic cloves",
            "fresh ginger",
            "ground cumin",
            "chickpeas",
            "fire-roasted tomatoes",
            "turmeric",
            "cayenne pepper",
            "kosher salt",
            "cilantro",
            "plain yogurt"
        ],
        "direction": [
            "Combine potatoes with 2 tablespoons water in a microwave safe bowl; microwave, at full power, 5 minutes.",
            "Add cauliflower and microwave an additional 5 minutes; drain.",
            "Heat a skillet over medium high heat with 1 tablespoon oil; cook onions until they being to turn golden, 2 to 3 minutes, stirring occasionally.",
            "Add garlic, ginger, and cumin; cook 30 seconds.",
            "Add another tablespoon of oil; toss in potatoes and cauliflower, stirring until light brown, about 3 minutes more.",
            "Stir in tomatoes, chickpeas, turmeric, cayenne, and 1/3 cup water.",
            "Bring to a boil, reduce heat, and simmer 4 minutes; season with salt.",
            "Serve garnished with cilantro and a dollop of yogurt."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/43/76/90/pictN7nqO.jpg"
    },
    {
        "id": 3561,
        "title": "Coconut Curried Tofu with Green Jasmine Rice",
        "ingredients": [
            "unsweetened dried shredded coconut",
            "water",
            "salt",
            "basmati rice",
            "fresh cilantro",
            "light coconut milk",
            "fresh ginger",
            "fresh lime juice",
            "garlic",
            "extra firm tofu",
            "green onion",
            "curry powder",
            "ground cumin",
            "dry crushed red pepper",
            "cherry tomatoes",
            "peanuts"
        ],
        "direction": [
            "Stir shredded coconut in small nonstick skillet over medium heat until light golden, about 5 minutes.",
            "Transfer to bowl.",
            "Bring 1 3/4 cups water and salt to boil in heavy medium saucepan.",
            "Stir in rice; bring to boil.",
            "Reduce heat to low, cover, and simmer until water is absorbed and rice is tender, about 18 minutes.",
            "Meanwhile, puree cilantro, 1/2 cup coconut milk, 1 teaspoon ginger, lime juice, and half of garlic in blender.",
            "Mix puree and coconut into rice.",
            "Set aside.",
            "Heat oil in large nonstick skillet over high heat.",
            "Add tofu; stir-fry until golden, about 6 minutes.",
            "Add onions, curry, cumin, red pepper, remaining ginger, and remaining garlic.",
            "Stir-fry 1 minute.",
            "Stir in tomatoes and remaining coconut milk.",
            "Season with salt and pepper.",
            "Divide rice among 4 plates.",
            "Top with tofu mixture.",
            "Sprinkle with peanuts.",
            "*Availableat specialty foods stores and natural foods stores.",
            "**Availableat Asian markets and in the Asian foods section of many supermarkets."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/53/88/0/picGVB4Xm.jpg"
    },
    {
        "id": 3562,
        "title": "Yummy Vegan Veggie Quinoa Soup",
        "ingredients": [
            "olive oil",
            "onion",
            "carrot",
            "celery",
            "garlic cloves",
            "green cabbage",
            "quinoa",
            "tomatoes",
            "vegetable broth",
            "fresh basil"
        ],
        "direction": [
            "Heat oil over medium-high heat in a large saucepan. When oil is hot, add onion, carrots, celery, red pepper, garlic cloves and cabbage. Stir to coat and saute for about 2-3 minutes, until veggies are softened but not browned.",
            "Add quinoa and stir until mixed in with the vegetables. Saute for another 2 minutes.",
            "Add tomatoes and broth and simmer on low-medium heat for about 20-30 minutes or until veggies are cooked to your liking. The longer you cook it, the more the quinoa will naturally thicken the soup.",
            "When soup is done, stir in fresh basil and add salt and pepper to taste."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/46/84/40/picDTJaot.jpg"
    },
    {
        "id": 3563,
        "title": "Pecan and Mushroom Burger  With Blue Cheese Sauce",
        "ingredients": [
            "nonfat plain yogurt",
            "blue cheese",
            "chives",
            "bulgur",
            "salt",
            "boiling water",
            "white mushrooms",
            "onion",
            "garlic",
            "pecan pieces",
            "egg",
            "fresh ground pepper"
        ],
        "direction": [
            "Combine yogurt, blue cheese, chives (if using) and dressing in a small bowl and blend with a fork to make a chunky sauce.  Refrigerate it while you make the burgers; it will keep for up to 2 days.",
            "Place bulgur and 1/4 teaspoon salt in a small bowl. Pour the boiling water over, cover and set aside until the water is absorbed, about 20 minutes. Drain in a sieve, pressing out excess liquid.",
            "Meanwhile, spray a large nonstick skillet with cooking spray and turn on stove to medium heat. Add mushrooms, onion and remaining 1/2 teaspoon salt; cook, stirring, until the vegetables are softened, 8 to 10 minutes. Stir in vinegar and garlic. Immediately transfer the mixture to a plate and let cool to room temperature, about 30 minutes.",
            "Combine the vegetable mixture in a food processor; pulse briefly until coarsely chopped. Add egg; pulse briefly, scraping down the sides if necessary, until the mixture is cohesive but roughly textured. Transfer to a bowl; stir in bulgur, breadcrumbs, pecans Italian seasoning and pepper. Mix well.",
            "With dampened hands, form the mixture into eight 1/2-inch-thick patties, using about 1/2 cup for each. (I made mine into 13 mini burgers using a slider station).",
            "Place burgers on a cookie sheet (coated with cooking spray) and place under a broiler on high.  Mine took 8 minutes to crisp ever so slightly and to become heated through.  You can also cook them in a frying pan for 4 minutes per side (mine fell apart doing this though, that's why I put the rest of them under the broiler).",
            "Garnish the burgers with watercress and the blue cheese sauce, if desired."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/37/78/09/pichVR1YR.jpg"
    },
    {
        "id": 3564,
        "title": "Bulgur Pilaf With Broccoli and Peppers",
        "ingredients": [
            "broccoli floret",
            "onion",
            "green bell peppers",
            "garlic",
            "olive oil",
            "canned tomato",
            "bulgur",
            "canned black beans",
            "dried oregano",
            "salt",
            "pepper",
            "hot water"
        ],
        "direction": [
            "Bring a large pan of salted water to boil over high heat.",
            "Add the broccoli and cook until it is crip tender but still green, about 1 to 2 minutes.",
            "Drain the broccoli and rinse it briefly under cold water.",
            "Using the same pan, add the oil.",
            "Then add the onion, garlic, pepper, and oregano if using.",
            "(Just use about 1/4 tsp.) Cook over medium heat, stirring often, until the onion is translucent which is about 3 to 5 minutes.",
            "Add the tomatoes, bulgur, water, and salt and pepper to taste.",
            "Bring to a boil and then reduce the heat to low.",
            "Cover it and cook until all the liquid is absorbed.",
            "Start checking at 10 minutes but it may take up to 15.",
            "Turn off the heat and add the broccoli and the black beans.",
            "Cover the pan and let it sit until the bulgur is tender but still slightly firm.",
            "This will take about 10 to 15 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/10/72/67/piczLLTJX.jpg"
    },
    {
        "id": 3565,
        "title": "Low Fat Cashew and Carrot Soup (Vegetarian Too!)",
        "ingredients": [
            "carrot",
            "potatoes",
            "onion",
            "cashews"
        ],
        "direction": [
            "ROUGH CUT carrots, onion and potato (can peel the skin).",
            "In large pot, heat the pot, then add 3 Tablespoons vegetable stock.",
            "ADD carrots, onion and potatoes and stir fry for about 5 minutes (until onion is soft).",
            "Add 1 1/2 pints vegetable stock and cover for 25 minutes.",
            "Place cashews in dry frypan; constantly stirring until slightly brown.",
            "ALLOW soup and cashews to cool and place both through a food processor or blender.",
            "ENJOY!",
            "NOTE: If you want to add black pepper, nutmeg or prepared hot sauce, free free to do; Just remember the soup is healthy for YOU!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/22/65/69/piceM0POa.jpg"
    },
    {
        "id": 3566,
        "title": "Creole Baked Cheese Rice",
        "ingredients": [
            "rice",
            "cheddar cheese",
            "green pepper",
            "green onion",
            "eggs",
            "milk",
            "salt",
            "cayenne pepper",
            "butter",
            "Tabasco sauce"
        ],
        "direction": [
            "Arrange alternate layers of rice, cheese, peppers, and onion in buttered baking dish.",
            "Mix eggs, milk, salt, and pepper (and pepper sauce) and pour over rice and cheese.",
            "Top with breadcrumbs and butter.",
            "Bake at 350 degrees for 45 minutes until set."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/18/55/0/pic32H0xR.jpg"
    },
    {
        "id": 3567,
        "title": "Mexican Tomato Soup",
        "ingredients": [
            "garlic",
            "ground cumin",
            "lime, juice of",
            "diced tomatoes",
            "kidney beans",
            "corn",
            "fresh cilantro",
            "chili powder"
        ],
        "direction": [
            "Use the oil to saute the garlic and cumin briefly in a  soup pot.",
            "Add the rest of the ingredients.",
            "Bring to a boil and simmer 10 min or more."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/32/06/23/picLxNZMD.jpg"
    },
    {
        "id": 3568,
        "title": "Stuffed Zucchini With Walnuts and Feta",
        "ingredients": [
            "zucchini",
            "olive oil",
            "onion",
            "garlic clove",
            "Greek feta cheese",
            "walnuts",
            "egg",
            "fresh dill"
        ],
        "direction": [
            "Put the zucchini in a large pan of boiling water, return to a boil, and then boil for 3 minutes. Drain, rinse under cold water, drain again and let cool.",
            "When the zucchini are cool enough to handle, cut a thin strip off the top side of each one with a sharp knife and gently score around the inside edges to help scoop out the flesh. Using a teaspoon, scoop out the flesh, leaving a shell to hold the stuffing. Chop the zucchini flesh.",
            "Heat 2 tablespoons of the oil in a saucepan. Add the onion and garlic and fry for 5 minutes, until softened. Add the chopped zucchini flesh and fry 5 minutes, until the onion is golden brown. Remove from heat and let cool slightly. Stir in the cheese then the walnuts, bread crumbs, egg, dill, salt, and pepper. Use the stuffing to fill the zucchini shells, and place side by side in an ovenproof dish. Drizzle over the remaining oil.",
            "Cover the dish with foil and bake in a preheated oven at 375F for 30 minutes. Remove foil and bake for another 10-15 minutes or until golden brown (mine weren't as brown as I wanted so I broiled them a couple of minutes).  Serve hot."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/12/63/00/picnUyZ4o.jpg"
    },
    {
        "id": 3569,
        "title": "Stir Fry Asparagus and Mushrooms",
        "ingredients": [
            "asparagus",
            "green onions",
            "mushroom",
            "tomatoes",
            "cold water",
            "cornstarch",
            "soy sauce"
        ],
        "direction": [
            "Cut asparagus at an angle into 1\" pieces.",
            "Saute asparagus and green onion in oil for 4 minutes.",
            "Add mushrooms and cook 1 minute longer.",
            "Mix water, corn starch and soy sauce.",
            "Stir into asparagus until thick.",
            "Add tomatoes and toss."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/15/41/47/picBg6QxQ.jpg"
    },
    {
        "id": 3570,
        "title": "Cauliflower Souffle Bake",
        "ingredients": [
            "cauliflower",
            "butter",
            "flour",
            "milk",
            "salt",
            "cheddar cheese",
            "eggs",
            "cayenne"
        ],
        "direction": [
            "In a pot, melt butter and blend in flour.",
            "Gradually add in milk and cook over low heat until thick; stirring often.",
            "Add salt, cayenne and cheese and stir until cheese melts.",
            "Remove from heat and add eggs, stirring.",
            "Add the cauliflower and mix gently.",
            "Pour ingredients into a baking dish and bake at 300 degrees F. for 1 hour and 15."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/21/63/14/picSiRp7A.jpg"
    },
    {
        "id": 3571,
        "title": "Vegetable Lentil Curry",
        "ingredients": [
            "onion",
            "curry powder",
            "sweet potatoes",
            "cauliflower",
            "brown lentils",
            "diced tomatoes with juice"
        ],
        "direction": [
            "Heat a large sauce pan or dutch oven over medium heat and add sauté liquid or pan spray.",
            "Add onion, and cook 5 minutes, or until softened, stirring often.",
            "Stir in curry powder and cook 1 minute, stirring constantly.",
            "Add sweet potatoes, cauliflower, lentils, tomatoes with juice, and 1 1/2 C water.",
            "Bring mixture to a boil. Reduce heat, cover and simmer 30 minutes or until lentils and sweet potatoes are tender.",
            "(Add additional water as needed.)."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/22/50/20/picg66zC3.jpg"
    },
    {
        "id": 3572,
        "title": "Green Tea and Tamarind-Marinated Tofu With Vegetables",
        "ingredients": [
            "garlic clove",
            "tamarind paste",
            "rice vinegar",
            "firm tofu",
            "canola oil",
            "tamari",
            "fresh mushrooms",
            "red onion",
            "broccoli florets"
        ],
        "direction": [
            "Place garlic, ginger, tamarind sauce, rice vinegar and tea leaves in a container with a tight fitting lid. Add tofu cubes and toss well. Marinate all day or overnight, shaking the container occasionally to distribute the marinade.",
            "Heat the oil in a large skillet over medium-high heat. Drain the tofu and reserve the marinade. Add tofu and tamari to taste to hot oil and cook, stirring almost constantly for 5 to 7 minutes, or until tofu is very hot. Transfer to a bowl and set aside.",
            "Add additional oil to the hot skillet if needed, followed by the vegetables and remaining marinade. Again, season to taste with tamari. Cook for 5 to 7 minutes, stirring frequently, or until broccoli is crisp-tender and pan juices have evaporated. Return tofu to skillet and toss to combine. Drizzle with sesame oil and serve."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/31/99/25/EiNvG9RWT1O9lMJTb6Zd_0S9A1483.jpg"
    },
    {
        "id": 3573,
        "title": "Tomato and Camembert Tart",
        "ingredients": [
            "flour",
            "unsalted butter",
            "salt",
            "fresh coarse ground black pepper",
            "extra virgin olive oil",
            "water",
            "Dijon mustard",
            "gruyere cheese",
            "plum tomatoes",
            "camembert cheese",
            "extra virgin olive oil",
            "fresh parsley",
            "fresh basil",
            "fresh rosemary",
            "fresh thyme leave",
            "bay leaf",
            "garlic cloves"
        ],
        "direction": [
            "Using a pastry blender(or 2 knives), mix the flour, butter, salt, and pepper until mixture resembles coarse meal.",
            "Using a fork, mix in 2 tablespoons of the oil and the water just until the bottom of the mixture begins to cling together. If necessary, add an additional tablespoon of oil.",
            "Gather the dough into a ball, flatten into a disk, wrap in plastic wrap, and chill for 30 minutes.",
            "Preheat oven to 375 degrees F.",
            "Roll out the chilled dough into a 14-inch circle and place it into a tart pan; set aside.",
            "Spread the mustard over the bottom of the tart shell. Sprinkle the Gruyère evenly over the mustard and alternately place the tomato and Camembert over the Gruyère.",
            "In a small bowl, mix the remaining 1/2 cup of extra-virgin olive oil, all of the herbs, and the garlic together and brush two-thirds of the mixture over the tart. Bake on the middle shelf of the oven for 35 minutes.",
            "Remove the tart and brush it with the remaining oil. Serve warm. Enjoy!"
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/36/27/13/picaN4mv9.jpg"
    },
    {
        "id": 3574,
        "title": "Golden Mushroom, Pea, and Asparagus Risotto (Vegan)",
        "ingredients": [
            "asparagus",
            "onion",
            "olive oil",
            "cremini mushrooms",
            "garlic",
            "arborio rice",
            "white wine",
            "saffron thread",
            "nutritional yeast flakes",
            "parsley",
            "dill",
            "lemon zest"
        ],
        "direction": [
            "In a medium saucepan, place the vegetable stock and bring to a boil.",
            "Slice the asparagus spears diagonally into 1-inch pieces and place them in a fine mesh strainer. Place the strainer in the boiling vegetable stock and cook the asparagus in the stock for 2 minutes to blanch them.",
            "Remove the strainer from the stock and set the asparagus aside. Reduce the heat of the stock to low.",
            "In a large saucepan, saute the onion in the olive oil for 3 minutes to soften. Add the mushrooms and garlic and saute the mixture an additional 3 minutes.",
            "Add the Arborio rice, stir well to coat it with the sauteed vegetable mixture, and cook an additional 2 minutes while stirring constantly or until rice turns opaque.",
            "Add the white wine (or use some of the stock if omitting) and saffron threads, season to taste with salt and pepper, and stir well to combine. Reduce the heat to low and cook the mixture while stirring occasionally until all of the liquid has been absorbed.",
            "Add 1/2 cup of the simmering vegetable stock and continue to cook, while stirring occasionally, until all of the stock has been absorbed.",
            "Repeat the procedure of adding a 1/2 cup of simmering stock, stirring, and cooking until fully absorbed before adding additional stock, until all but a 1/2 cup of stock remains.",
            "Add the blanched asparagus, along with the remaining ingredients, and stir well to combine. Cook the mixture an additional 2-3 minutes while stirring constantly, adding the remaining stock, as needed, so that the rice is tender and the risotto has a creamy consistency.",
            "Taste and adjust the seasonings, as desired."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/39/17/09/pic0p65F4.jpg"
    },
    {
        "id": 3575,
        "title": "Couscous With Spinach and Pine Nuts",
        "ingredients": [
            "couscous",
            "boiling water",
            "salt",
            "olive oil",
            "garlic cloves",
            "onion",
            "diced tomatoes",
            "fresh basil",
            "pine nuts",
            "fresh spinach",
            "muenster cheese",
            "cracked black pepper"
        ],
        "direction": [
            "Add couscous and salt to boiling water.  Cover and let sit 5 minutes, then fluff with fork.",
            "Preheat oven to 375.",
            "Heat oil in large skillet.  Saute garlic and onion for ten minutes, or until tender.",
            "Drain canned tomatoes, reserving 1/3 cup juice.  Add drained tomatoes to garlic and onions.  Cook 10 more minutes, stirring frequently.",
            "Stir tomato mixture into couscous.  Mix in reserve tomato juice, basil, pine nuts, raw spinach and pepper.",
            "Spread half of the couscous mixture in a shallow baking dish.  Sprinkle muenster evenly, then top with remaining couscous mixture.",
            "Cover dish with foil and bake at 375 for 25 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/20/92/15/pico4xjg4.jpg"
    },
    {
        "id": 3576,
        "title": "Vegetarian Tamale Pizza",
        "ingredients": [
            "chili beans",
            "corn",
            "reduced-fat cheddar cheese",
            "green onions",
            "roma tomatoes"
        ],
        "direction": [
            "Heat oven to 425.",
            "Place drained beans in a small bowl and mash with fork or pastry blender. Stir in chiles.",
            "Place crust on baking sheet and spread with bean mixture to 1/4 inch of edge.",
            "Top with corn, cheese, green onions, and tomatoes.",
            "Bake 10-12 minutes or until cheese is melted and pizza is heated through. Sprinkle with some cilantro if desired."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/43/70/78/picUbLV2J.jpg"
    },
    {
        "id": 3577,
        "title": "Italian Spaghetti Soup With Garlic",
        "ingredients": [
            "dry lentils",
            "onion",
            "carrots",
            "celery ribs",
            "garlic cloves",
            "tomato puree",
            "spaghetti",
            "spinach",
            "olive oil"
        ],
        "direction": [
            "Place everything except for spaghetti and spinach in a large kettle with 2 quarts of water; bring to a boil.",
            "Cover and simmer 1 hour.",
            "Add seasonings, spaghetti and spinach.",
            "Simmer 10-12 minutes until spaghetti in tender.",
            "Drain.",
            "Add a small drizzle of olive oil to each bowl when serving."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/14/64/86/piclGSo0V.jpg"
    },
    {
        "id": 3578,
        "title": "Vegetarian Focaccia Sandwich",
        "ingredients": [
            "olive oil",
            "onion",
            "portabella mushrooms",
            "focaccia bread",
            "dijon-style mustard"
        ],
        "direction": [
            "Slice bread in half lengthwise.",
            "Slice peppers into 1/8 inch slices.",
            "Slice onion and mushrooms.",
            "In a skillet, heat oil over medium heat.",
            "Add peppers and onions, cooking till they begin to soften.",
            "Add mushrooms and cook till mushrooms are softened.",
            "Spread mustard on each half of bread.",
            "Top one half with mushroom mixture, sprinkle with cheese.",
            "Place the other half of the bread on top the half with the mushroom mixture.",
            "Cut into 8 slices."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/95/59/2/picC7cwQD.jpg"
    },
    {
        "id": 3579,
        "title": "Pasta Pesto Rosso",
        "ingredients": [
            "sun-dried tomatoes",
            "bell pepper",
            "zucchini",
            "pasta shells",
            "garlic cloves",
            "olive oil",
            "tomato paste",
            "water",
            "cherry tomatoes",
            "fresh rosemary"
        ],
        "direction": [
            "Cut dried tomatoes into short strips (note: this takes time).",
            "Dice bell pepper and cut zucchini into slices.",
            "In a saucepan heat oil. Sautee crushed garlic, sun-dried tomatoes and rosemary in it until fragrant. Add water, tomato paste and salt and pepper. Simmer for 5-8 minutes until sauce looks nice to you.",
            "Meanwhile in a big pot of boiling water cook pasta shells for 4 minutes. Then add bell pepper, zucchini and broccoli. Cook for another 4-6 minutes until veggies are tender.",
            "Drain pasta and veggies.",
            "Toss with the sauce and add cherry tomatoes to serve. If you like sprinkle with freshly grated parmesan cheese."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/38/60/66/pic09i7NY.jpg"
    },
    {
        "id": 3580,
        "title": "Moroccan Vegetarian Sweet Potato Stew",
        "ingredients": [
            "Spanish onion",
            "garlic cloves",
            "turmeric",
            "curry powder",
            "cumin",
            "red pepper flakes",
            "salt",
            "pepper",
            "cinnamon",
            "ground nutmeg",
            "sweet potatoes",
            "acorn squash",
            "carrots",
            "vegetable broth",
            "chickpeas",
            "whole tomatoes",
            "raisins"
        ],
        "direction": [
            "In a pot sauté onions and garlic over low heat until soft, but not brown.",
            "Add spices and cook a few minutes. Stir in sweet potatoes, acorn squash, carrots and broth and bring to a boil.",
            "Reduce heat to low and simmer covered for 5 minutes.",
            "Add chick peas, tomatoes and raisins and simmer covered until the potatoes, squash and carrots are tender, about 30 minutes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/23/27/17/PvitqwyLSHKLoh61UGjl_0S9A4453.jpg"
    },
    {
        "id": 3581,
        "title": "Vegetarian Mexican Stir-Fry",
        "ingredients": [
            "green pepper",
            "onion",
            "black beans",
            "diced tomato",
            "frozen corn",
            "cooked brown rice",
            "salt"
        ],
        "direction": [
            "Spray skillet with cooking spray and saute green pepper and onion over medium heat until onion is translucent (just a few minutes).",
            "Add the rest of the ingredients and cook 3-5 minutes.  Just spoon into a bowl and top with cheese, avocado, olives, jalepenos, etc. and voila!",
            "* The leftover tomatoes can be frozen in one or two small tupperware to be used later.",
            "** I make it even simpler by using an all-natural taco seasoning (Simply Organic or Trader Joes both make good ones), but you can also mix up your own blend of cumin, chili powder, garlic powder and cayenne (if you like it spicy)."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/46/10/36/pic0SW7qt.jpg"
    },
    {
        "id": 3582,
        "title": "5 Minute Vegan Pancakes",
        "ingredients": [
            "flour",
            "sugar",
            "baking powder",
            "salt",
            "soymilk"
        ],
        "direction": [
            "Set out all your ingredients.",
            "Set a stove element with a pan to medium heat.",
            "Combine the 4 dry ingredients (flour, sugar, baking powder -- two Tablespoons, not two Teaspoons as some have suggested, salt) in a bowl.",
            "Add the soy milk and vegetable oil to your mixture.",
            "Mix until smooth.",
            "Now the pan should be ready for your batter, so spoon one pancakes' worth of the mixture into the pan.",
            "Flip [carefully] when you see bubbles in the middle of the pancake, or if the edges are looking stiffened.",
            "Repeat until the batter is gone, and try not to eat them all while you're cooking them."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/13/22/63/D30C2lxTy6SAflQlb61Q_VP%25204%2520-%2520final_2.jpg"
    },
    {
        "id": 3583,
        "title": "Scallion Wild Rice Crepes, Mushroom Filled W/ Red Pepper Sauce",
        "ingredients": [
            "water",
            "wild rice",
            "salt",
            "eggs",
            "unsalted butter",
            "all-purpose flour",
            "black pepper",
            "scallion",
            "red bell peppers",
            "water",
            "olive oil",
            "salt",
            "dried porcini mushrooms",
            "water",
            "olive oil",
            "unsalted butter",
            "cremini mushrooms",
            "garlic cloves",
            "fresh rosemary",
            "fresh thyme",
            "salt",
            "scallion"
        ],
        "direction": [
            "Bring 4 cups water to a boil in a 2-quart heavy saucepan, then add rice and 1/2 teaspoon salt. Reduce heat and cook, covered, over low heat until rice is tender and grains are split open, 1 to 1 1/4 hours (not all liquid will be absorbed). Drain well in a colander and cool to warm.",
            "Blend together milk, eggs, 3 tablespoons butter, flour, pepper, remaining teaspoon salt, and 1 cup cooked wild rice in a blender until smooth, about 1 minute. Transfer to a large bowl and stir in scallions and 1 1/2 cups cooked wild rice (reserve remainder for another use). Let batter stand, covered, at room temperature 1 hour.",
            "Roast bell peppers on racks of gas burners over high heat, turning with tongs, until skins are blackened, 10 to 12 minutes. (Or broil peppers on a broiler pan about 5 inches from heat, turning occasionally, about 15 minutes.) Transfer to a large bowl and cover tightly with plastic wrap, then let stand 20 minutes.",
            "When cool enough to handle, peel peppers, discarding stems and seeds, and coarsely chop.",
            "Purée peppers with water, oil, vinegar, and salt in cleaned blender until smooth. Season with pepper and pour into a small heavy saucepan.",
            "Soak porcini in boiling-hot water in a small bowl until softened, about 20 minutes. Lift porcini out, squeezing liquid back into bowl, then rinse porcini (to remove any grit) and finely chop. Pour soaking liquid through a sieve lined with a dampened paper towel into another small bowl.",
            "Heat oil and 1 tablespoon butter in a 12- to 13-inch nonstick skillet over moderately high heat until foam subsides, then sauté porcini and cremini mushrooms, tossing with 2 wooden spatulas or spoons, until wilted and any liquid mushrooms give off is evaporated, 3 to 5 minutes. Add garlic, rosemary, thyme, salt, and remaining tablespoon butter and sauté, stirring, 1 minute. Add porcini soaking liquid and boil until most of liquid is evaporated and mushrooms are tender, 3 to 5 minutes. Season with salt and pepper.",
            "Line a plate with 1 square of wax paper. Heat crêpe pan over moderate heat until hot, then brush lightly with some melted butter. Spoon about 1/3 cup batter into pan, tilting and rotating to coat bottom. (If batter sets before skillet is coated, reduce heat slightly for next crêpe.) Cook until underside is lightly browned, about 1 minute, then loosen crêpe with a heatproof plastic spatula and flip over with your fingers. Cook crêpe until other side is lightly browned, about 1 minute, and transfer to wax-paper-lined plate. Top crêpe with another square of wax paper. Make more crêpes with remaining batter, brushing pan lightly with butter as needed. (You will have extra crêpes.).",
            "Preheat oven to 400°F.",
            "Brush some melted butter on bottom of a large shallow baking pan (1 inch deep). Spread 1/4 cup filling centered over half of 1 crêpe, then fold other half over filling to form a half-moon. Fold half-moon in thirds, overlapping outer sections (making a cone shape), and transfer to baking pan. Repeat procedure with 11 more crêpes, arranging in 1 layer in baking pan.",
            "Brush crêpes generously with remaining melted butter and bake in upper third of oven until outsides are crisp and filling is heated through, about 15 minutes.",
            "While crêpes are baking, heat sauce over low heat until hot, about 5 minutes.",
            "Put sauce on each of 6 plates and top with 2 crêpes.",
            "Wild rice can be cooked 2 days ahead and cooled, uncovered, then chilled, covered.",
            "Red pepper sauce can be made 2 days ahead and chilled, covered.",
            "Filling can be made 1 day ahead and cooled, uncovered, then chilled, covered.",
            "Crêpes can be made and filled 1 day ahead and chilled, wrapped in foil. Brush with melted butter just before baking."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/41/87/79/picHGRNve.jpg"
    },
    {
        "id": 3584,
        "title": "Spinach and Bulgar Salad",
        "ingredients": [
            "Bulgar wheat",
            "green onion",
            "fresh dill",
            "feta cheese",
            "red wine vinegar",
            "olive oil",
            "cherry tomatoes"
        ],
        "direction": [
            "In a small bowl, combine bulgur and 1 and a 1/2 cups boiling water. Let stand until bulgur is tender to bite, about 15 minutes.",
            "Meanwhile, stack spinach leaves and cut into 1/4-inch-wide strips.",
            "Place spinach, onions, dill, and cheese in a wide bowl. Pour bulgur into a fine strainer and press out the excess water. Add bulgur to bowl with spinach.",
            "Mix vinegar and oil. Add to salad and mix. Season with salt and pepper to taste."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/38/24/32/4tyy395TXeU8v1p34le3_untitled-4769.jpg"
    },
    {
        "id": 3585,
        "title": "Vegetarian Mushroom Shepherd's Pie - With Vegan Version",
        "ingredients": [
            "mushroom",
            "carrot",
            "red bell pepper",
            "onions",
            "dill",
            "parsley",
            "eggs",
            "sea salt",
            "ground pepper",
            "sweet paprika",
            "dried thyme"
        ],
        "direction": [
            "Peel the potatoes and put them in a large pot filled with water. Boil them until they're tender. Mash them and let them cool for a while.",
            "Chop the mushrooms, carrot and red bell pepper. Add them into your food processor and pulse until all ingredients are well mixed together.",
            "Heat 2 tbsp of sunflower oil in a large skillet. Add the mixture above, diced onions, chopped dill and parsley, soy granules, eggs ( or egg substitutes + dry yeast flakes) and spices. Sauté for 10 minutes.",
            "* I added the soy granules without boiling them because the mushrooms contain a lot of water and these soy granules will absorb all excess water.",
            "Put some parchment paper on the bottom of a casserole. Divide the mashed potatoes in two. Place the first half in the casserole and spread it with a spatula. Add the filling. Place over the other half of mashed potatoes.",
            "Heat your oven at 392Ëš. Put the casserole in the oven. Cook for 40 minutes.",
            "Don't serve immediately. Let it cool for at least half an hour.",
            "*Textured soy protein substitute: Use 1,5-2kg of mushrooms instead of just 1kg. Add 3-4 tbsp of breadcrumbs(optional). I used soy granules only for economical purposes."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/46/95/87/picyv0GcW.jpg"
    },
    {
        "id": 3586,
        "title": "Artichoke Spinach Lasagna",
        "ingredients": [
            "onion",
            "garlic cloves",
            "vegetable broth",
            "fresh rosemary",
            "frozen chopped spinach",
            "mozzarella cheese"
        ],
        "direction": [
            "Preheat oven to 350 degrees F (175 degrees C).",
            "Spray a 9x13 inch baking dish with cooking spray.",
            "Bring a large pot of lightly salted water to a boil.",
            "Add noodles and cook for 8 to 10 minutes or until al dente; drain.",
            "Spray a large skillet with cooking spray and heat on medium-high.",
            "Saute onion and garlic for 3 minutes, or until onion is tender-crisp.",
            "Stir in broth and rosemary; bring to a boil.",
            "Stir in artichoke hearts and spinach; reduce heat, cover and simmer 5 minutes.",
            "Stir in pasta sauce.",
            "Spread 1/4 of the artichoke mixture in the bottom of the prepared baking dish; top with 3 cooked noodles.",
            "Sprinkle 3/4 cup mozzarella cheese over noodles.",
            "Repeat layers 2 more times, ending with artichoke mixture and mozzarella cheese.",
            "Sprinkle crumbled feta on top.",
            "Bake, covered, for 40 minutes.",
            "Uncover, and bake 15 minutes more, or until hot and bubbly.",
            "Let stand 10 minutes before cutting.",
            "To freeze: Bake, cool, wrap well, and label. freeze up to 2 months. *Note:  You can assemble and freeze without cooking and cook on the day to be eaten!",
            "To serve, defrost overnight and then bake until warmed through, or bake from frozen for 1 hour and a half."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/38/60/7/zsRmi9ILQL6AIf1UPch4_0S9A2663.jpg"
    },
    {
        "id": 3587,
        "title": "Light Spinach Pasta With Tofu",
        "ingredients": [
            "fresh spinach",
            "pasta",
            "firm tofu",
            "onion",
            "garlic cloves",
            "salt"
        ],
        "direction": [
            "Boil pasta according to package directions but only till its almost done.",
            "Wash and clean the spinach and steam with a little water for 4 minutes in the microwave.",
            "Once it is steamed, blenderize it with the same water to get a spinach paste which is kind of watery",
            "In a large non stick skillet, heat oil.",
            "When oil gets hot, add the chopped garlic.",
            "When the garlic is slightly browned add the onions and stir fry till the onions turn brown.",
            "Add the tofu and stir fry till the tofu changes color a bit and looks slightly as if it has been fried.",
            "At this point add the red pepper flakes/powder and stir. Immediately add the the spinach paste",
            "Let it simmer.",
            "Add salt.",
            "When the water from the spinach reduces add the semi cooked pasta and let it cook completely. If you think more water is needed add that.",
            "I don't add cheese, but can also do the last step in the oven with mozzarella on top.",
            "I like this hot and cold--tastes good every way."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/15/12/97/picxthy5s.jpg"
    },
    {
        "id": 3588,
        "title": "Black-Eyed Peas Veggie Jambalaya",
        "ingredients": [
            "Italian plum tomatoes",
            "vegetable broth",
            "quick-cooking brown rice",
            "garlic",
            "bay leaves",
            "dried basil",
            "dried thyme",
            "green bell pepper",
            "black-eyed peas",
            "parsley",
            "chives"
        ],
        "direction": [
            "Combine tomatoes, broth, rice, garlic, bay leaves, basil, thyme and hot pepper sauce in a lage saucepan.  Cover and bring to a boil over high heat.  Lower heat to a simmer and cook until rice is done, about 15 minutes for quick cooking rice or 50 minutes for regular brown rice.",
            "When rice is cooked, cut green pepper into 1 inch  pieces and stir into stew  Stir in black eyed peas, cover and simmer for 10 to 12 minutes, stirring once.",
            "Remove and discard bay leaves.  Sprinkle with parsley and or chives, if desired.",
            "Ladle into bowls and serve with garlic bread."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/50/27/56/qtlBCAcMSGSK4lRSYwik-DSC_0520.JPG"
    },
    {
        "id": 3589,
        "title": "Tofu \"Chicken\" Salad",
        "ingredients": [
            "tofu",
            "vegan mayonnaise",
            "onion",
            "green pepper",
            "cumin",
            "parsley",
            "basil"
        ],
        "direction": [
            "Cut tofu into 1/2 cubes and fry till golden brown, Mix tofu with mayo, onions, peppers and seasonings (use whatever seasonings you like).",
            "Add more or less mayo depending on how\"wet\" you like the salad.",
            "Best served in a pita pocket."
        ],
        "image_url": "https://img.sndimg.com/food/image/upload/f_auto,c_thumb,q_55,w_860,ar_3:2/v1/img/recipes/34/64/1/pictOkQ4B.jpg"
    }
]